[
  {
    "number": 1,
    "text": "Agricultural income tax is assigned to the State Government (a) show poor germination by:",
    "year": "1995",
    "options": {
      "a": "Finance Commission",
      "b": "from low-yielding plants despite the high quality",
      "c": "give rise to sexually sterile plants",
      "d": "give rise to plants incapable of forming viable seeds"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "In which one of the following crops international trade is (a) Maharashtra, U .P., Tamil Nadu, Andhra Pradesh low in the context of total produce?",
    "year": "1995",
    "options": {
      "a": "Rice",
      "b": "U. P., Maharashtra, Tamil Nadu, Andhra Pradesh",
      "c": "Maharashtra, U. P., Andhra Pradesh, Tamil Nadu",
      "d": "Wheat"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Russia B. Leather goods 2. U.S.A C. Tea 3. Japan D. Cotton fabrics 4. U.K. 5. Canada Codes: (a) A -5; B- 1; C -2; D- 3 (b) A -3; B- 1; C -4; D -2 (c) A -1; B-5; C - 4; D- 3 (d) A -3; B - 4; C-1; D -2 Year 5. Consider the following statements:",
    "year": "1999",
    "options": {
      "a": "Pulses",
      "b": "Wheat Regional disparities in India are high and have been rising",
      "c": "Oilseeds",
      "d": "Rice in recent years because:"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "There is a demand-supply gap regarding quality seeds (a) 1 and 2 (b) 2 only in case of low value and high volume crops. (c) 1 and 3 (d) 3 only Select the correct answer using the code given below. 12. Consider the following statement:",
    "year": "2004",
    "options": {
      "a": "1 and 2",
      "b": "3 only India continues to be dependent on imports to meet the",
      "c": "2 and 3",
      "d": "None requirement of oilseeds in the country because:"
    },
    "answer": "a",
    "explanation": "Encyclopedia Britannica: In the 15th and 16th • Investment is a term associated with the capital part centuries, during the Columbian Exchange: numerous of the budget. So “subsidy” - a revenue part is not an plants, animals, and microbes from old world (Europe, example of ‘public investment’. Economic Survey 2019-20 Asia, and Africa) were introduced to the new world page 84 also confirms this. (Americas) and vice versa. From the image given in the • Free electricity to farmers involves the gover"
  },
  {
    "number": 1,
    "text": "The Standard Mark of Bureau of Indian Standards 2. It is a rich source of biodiesel. (BIS) is mandatory for automotive tyres and tubes. 3. It has nutritional value and is well-adapted to live in 2. AGMARK is a quality Certification Mark issued by cold areas of high altitudes. the Food and Agriculture Organisation (FAO). 4. Its timber is of great commercial value. Which of the statements given abov",
    "year": "2019-I",
    "options": {
      "b": "Tobacco, cotton and rubbers implementation?",
      "c": "Cotton, coffee and sugarcane"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "According to the Indian Patents Act, a biological vegetables and planting materials of horticultural process to create a seed can be patented in India. crops. 5337_DBE Agriculture in the National Economy D 31 2. In India, there is no Intellectual Property Appellate Which of the statements given above is/are correct? Board. (a) 1 only (b) 2 and 3 only 3. Plant Varieties are not eligible to the pate",
    "year": "2020-I",
    "options": {
      "c": "3 only",
      "d": "1,2, and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Fixing Minimum Support Price for agriculture 1. Most of India’s external debt is owed by government produce of all crops entities. 2. Computerization of Primary Agriculture Credit 2. All of India’s external debt is denominated in US Societies dollars. 3. Social Capital development Which of the statements given above is/are correct? 4. Free electricity supply of farmers (a) 1 only (b) 2 only 5. Wai",
    "year": "2019-I",
    "options": {
      "a": "1, 2 and 5 only",
      "b": "1, 3, 4 and 5 only",
      "c": "2, 3 and 6 only",
      "d": "1, 2, 3, 4, 5 and 6"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "In terms of short-term credit delivery to the (a) 1 only (b) 2 and 3 only agriculture sector, District Central Cooperative (c) 2 only (d) 1, 2 und 3 Banks (DCCBs) deliver more credit in comparison to 28. With reference to pulse production in India, consider the Scheduled Commercial Banks and Regional Rural following sentences:",
    "year": "2020-I",
    "options": {
      "a": "1 only",
      "b": "2 only 3. In the last three decades, while the production of",
      "c": "Both 1 and 2",
      "d": "Neither It nor 2 kharif pulses has increased, the production of rabi pulses has decreased. D 32 Topicwise Solved Papers HINTS & SOLUTIONS 1."
    },
    "answer": null,
    "explanation": ""
  }
]