[
  {
    "number": 25,
    "text": "With reference to India, which one of the following statements 33. Which one of the following sets of commodities are exported is NOT correct?",
    "year": "2003",
    "options": {
      "a": "IPCL is India's largest petrochemical company",
      "b": "RIL is the largest private sector company in India",
      "c": "MTNL is listed on NYSE",
      "d": "BSNL is the first telecom service organization in India"
    },
    "answer": "d",
    "explanation": "Commercial banks provide long-term credit to rural artisans. NABARD doesnot give “direct” credit government by investing their funds in government assistance. It provides credit Via intermediaries such as securities and short-term finance by purchasing Treasury Microfinance companies, Cooperative society, RRB. Bills. This comes under Statutory Liquidity Ratio (SLR)."
  },
  {
    "number": 34,
    "text": "Which one of the following is not a feature of Limited (a) India is the second largest producer of nitrogenous Liability Partnership firm?",
    "year": "2010",
    "options": {
      "a": "Partners should be less than 20",
      "b": "India is the ninth largest steel producing country in",
      "c": "Internal governance may be decided by mutual",
      "d": "India ranks third in the world in coal production."
    },
    "answer": "d",
    "explanation": "The Reserve Bank of India is the main monetary first paragraph. authority of the country and beside that, in its capacity as Ref : https://rbi.org.in/SCRIPTs/BS_PressRelease Display. the central bank, acts as the bank of the national and state aspxs?prid=35749 governments. D 48 Topicwise Solved Papers"
  },
  {
    "number": 27,
    "text": "During the year 2000-01 which one of the following 35. In India, which of the following, is regulated by the Forward Industries recorded the highest growth rate in India?",
    "year": "2003",
    "options": {
      "a": "Cement",
      "b": "Coal",
      "c": "Electricity",
      "d": "Steel"
    },
    "answer": "a",
    "explanation": "Bear is a speculator who sells shares in anticipation of business correspondents in their village itself. fall operator prices to buy them back and thus make a profit."
  },
  {
    "number": 28,
    "text": "Which one of the following statements is correct?",
    "year": "2003",
    "options": {
      "a": "Alliance Air is a wholly-owned subsidiary of Indian Airlines",
      "b": "Commodities Futures Trading",
      "c": "Equity Futures Trading",
      "d": "Both Commodities Futures and Financial Futures Trading country's international airports"
    },
    "answer": "d",
    "explanation": "It is fixed by Reserve Bank of India. In 2011, RBI money supply and credit off take. 2 may or may not be permitted the commercial banks to fix interest rate on saving correct, to make people's deposit safe, capital adequacy account independently. ratio is the norm. 3 is definitely wrong as to control excess"
  },
  {
    "number": 36,
    "text": "What is/are the recent policy initiative(s) of Government of India (c) The Airports Authority of India is the regulatory to promote the growth of manufacturing sector? [2012 - I] organisation for enforcing civil air regulations in India 1. Setting up of National Investment and Manufacturing (d) It is the function of Directorate General of Civil Aviation Zones to plan and construct runways and term",
    "year": "2004",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "Land development bank started financing long term India and was created to encourage housing, finance loan for more significant rural development activities like institutions and provide them with financial support. rural and cottage industries, rural artisans etc. The main"
  },
  {
    "number": 37,
    "text": "In India, in the overall Index of Industrial Production, the (c) A is true but R is false Indices of Eight Core Industries have a combined weight of (d) A is false but R is true 37.90%. Which of the following are among those Eight Core 30. Assertion (A): Balance of Payments represents a better Industries? [2012 - I] Picture of a country economic transactions with the rest of 1. Cement 2. Fertilize",
    "year": "2006",
    "options": {
      "a": "1 and 5 only",
      "b": "2, 3 and 4 only",
      "c": "1, 2, 3 and 4 only",
      "d": "1, 2, 3, 4 and 5 correct explanation of ‘A’."
    },
    "answer": "a",
    "explanation": "Those who benefit from higher inflation are debtors"
  },
  {
    "number": 43,
    "text": "In India, the steel production industry requires the import 1. Coal sector was nationalized by the Government of of",
    "year": "2015-I",
    "options": {
      "a": "saltpetre",
      "b": "rock phosphate"
    },
    "answer": "c",
    "explanation": "When the Reserve Bank of India reduces the Statutory of shares on behalf of customers, acting as executors and Liquidity Ratio by 50 basis points; the Scheduled transfers of wills, purchase and sale of foreign exchange etc. Commercial Banks may cut their lending rates."
  },
  {
    "number": 2,
    "text": "Now, coal blocks are allocated on lottery basis. (c) coking coal (d) All of the above 3. Till recently, India imported coal to meet the shortages 44. In the 'Index of Eight Core Industries', which one of the of domestic supply, but now india is self-sufficient in following is given the highest weight?",
    "year": "2015-I",
    "options": {
      "a": "Coal production",
      "b": "Electricity generation Which one of the following statements given above is/ are",
      "c": "Fertilizer production",
      "d": "Steel production correct?"
    },
    "answer": "d",
    "explanation": "Bank Rate is that rate of interest at which central bank exchange reserves; controller of credit; clearing house for of a country provides refinancing facilities to commercial settling inter bank transactions. It follows an independent banks. The bank rate, a benchmark rate at which RBI buys monetary policy. or re-discounts bills of exchange or other commercial papers"
  },
  {
    "number": 45,
    "text": "Which of the following brings out the 'Consumer Price Index (a) 1 only (b) 2 and 3 only Number for Industrial Workers'?",
    "year": "2015-I",
    "options": {
      "a": "The Reserve Bank of India",
      "c": "3 only",
      "d": "1,2 and 3"
    },
    "answer": "b",
    "explanation": "(i) They can enable transfers and remittance through"
  },
  {
    "number": 53,
    "text": "With reference to Foreign Direct Investment in India, (b) The Department of Economic Affairs which one of the following is considered its major (c) The Labour Bureau characteristics ?",
    "year": "2020-I",
    "options": {
      "a": "It is the investment through capital instruments",
      "d": "The Department of Personnel and Training"
    },
    "answer": "b",
    "explanation": "NCERT Class 12 Macroeconomics Chapter 3: Legal wherein profits are shifted from jurisdictions that have high tender- is a fiat money which cannot be refused by any taxes (such as the United States and many Western citizen of the country for settlement of any kind of European countries) to jurisdictions that have low (or no) transaction. So, B is the appropriate description. taxes (so-called tax havens). The BEPS project is said to be"
  },
  {
    "number": 46,
    "text": "Recently, India’s first ‘National Investment and essentially in a listed company. Manufacturing Zone’ was proposed to be set up in (b) It is largely non-debt creating capital flow. (a) Andhra Pradesh (b) Gujarat",
    "year": "2016-I",
    "options": {
      "c": "It is the investment which involves debt-servicing.",
      "d": "Uttar Pradesh"
    },
    "answer": "a",
    "explanation": "(i) Core Banking Solution (CBS) is networking of Union Territory Governments, Government companies, branches, which enables Customers to operate their Corporations and other parties. accounts, and avail banking services from any branch of Ref: to the parts of Budget given in Disha’s Crack CSAT the Bank on CBS network, regardless of where he maintains Paper-1, page E-56 (3rd Ed.) his account. The customer is no more the customer of a"
  },
  {
    "number": 1,
    "text": "India’s merchandise exports are less than its 1. List of ingredients including additives merchandise imports. 2. Nutrition information 2. India’s imports of iron and steel, chemicals, fertilisers 3. Recommendations, if any, made by the medical and machinery have decreased in recent years. profession about the possibility of any allergic reactions 3. India’s exports of services are more than its im",
    "year": "2017-I",
    "options": {
      "c": "3 only",
      "d": "1, 3 and 4 only"
    },
    "answer": "d",
    "explanation": "Variable Reserve Ratio (Cash Reserve Ratio) is aimed sign of economic development. This reproduces the trend to control only volume of credit (quantitative method) not shown by western countries as they were developing. both volume and purpose of credit for which bank gives"
  },
  {
    "number": 2,
    "text": "Chairman of QCI is appointed by the Prime Minister 1. Quantitative restrictions on imports by foreign on the recommendations of the industry to the investors are prohibited. Government. 2. They apply to investment measures related to trade Which of the above statements is/are correct? in both goods and services. (a) 1 only (b) 2 only 3. They are not concerned with the regulation of (c) Both 1 and ",
    "year": "2018-I",
    "options": {
      "a": "ILO",
      "b": "IMF",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Bank Rate is that rate of interest at which central bank exchange reserves; controller of credit; clearing house for of a country provides refinancing facilities to commercial settling inter bank transactions. It follows an independent banks. The bank rate, a benchmark rate at which RBI buys monetary policy. or re-discounts bills of exchange or other commercial papers"
  },
  {
    "number": 1,
    "text": "Currency with the public (b) Rationing of credit 2. Demand deposits with banks (c) Margin requirements 3. Time deposits with banks (d) Variable cash reserve ratios 4. Other deposits with RBI 2. Bank Rate implies the rate of interest:",
    "year": "1995",
    "options": {
      "a": "paid by the Reserve Bank of India on the Deposits of",
      "b": "1, 2 and 3 Commercial Banks",
      "c": "1, 2, 3 and 4",
      "d": "1, 2 and 4"
    },
    "answer": "d",
    "explanation": "Variable Reserve Ratio (Cash Reserve Ratio) is aimed sign of economic development. This reproduces the trend to control only volume of credit (quantitative method) not shown by western countries as they were developing. both volume and purpose of credit for which bank gives"
  },
  {
    "number": 4,
    "text": "Only scheme ‘A’ has been withdrawn (a) the Primary Agricultural Cooperative Societies, Codes: commercial banks, RRBs and private money lenders (a) 3 only (b) 1 and 2 (b) the NABARD, RBI, commercial banks and private (c) 1, 2 and 3 (d) 1, 2 and 4 money lenders 5. Hawala transactions relate to payments:",
    "year": "1996",
    "options": {
      "a": "received in rupees against overseas currencies and lead banks, IRDP and JRY vice versa without going through the official channels",
      "b": "received for sale/transfer of shares without going DCCB, IFFCO and commercial banks through the established stock exchanges",
      "d": "the Large Scale Multi-purpose Adivasis Programme,"
    },
    "answer": "d",
    "explanation": "Under the FCNR (A) Scheme, the RBI bore any time deposits into the narrow money, we get the broad exchange rate risk, while in the case of FCNR (B) Scheme money, which is denoted by M3. banks have to bear the exchange rate risk. The FCNR (A) M3 = Narrow money + Time Deposits of public with banks. Scheme was replaced by the FCNR (B) Scheme in 1994. We note here that the Broad money does not include the"
  },
  {
    "number": 11,
    "text": "Since 1980, the share of the tertiary sector in the total GDP (c) received as commission for services rendered to of India has:",
    "year": "1999",
    "options": {
      "a": "shown an increasing trend get over the red tape and/or in getting preferential",
      "b": "shown a decreasing trend treatment",
      "c": "remained constant",
      "d": "made to political parties or to individuals for meeting election expenses"
    },
    "answer": "a",
    "explanation": "The share of the tertiary sector in the total GDP or the repo rate increases borrowing from RBI becomes more Gross Domestic Product of India is increasing which is a expensive. 5337_DBE The Tertiary Sector in the Indian Economy D 47 A value of (0) for Gini Coefficient in a country implies that"
  },
  {
    "number": 14,
    "text": "Consider the following financial institutions of India: (a) Corporation Bank (b) Dena Bank",
    "year": "2002",
    "options": {
      "c": "Federal Bank",
      "d": "Vijaya Bank"
    },
    "answer": "a",
    "explanation": "IFCI – 1948; ICICI – 1955; IDBI – 1964; NABARD - 1982 system works as it is based on mutual trust between the"
  },
  {
    "number": 2,
    "text": "Industrial Credit and Investment Corporation of India 1. Life Insurance Corporation of India is the oldest (ICICI) insurance company in India. 3. Industrial Development Bank of India (IDBI) 2. National Insurance Company Limited was nationalized 4. National Bank for Agriculture and Rural Development in the year 1972 and made a subsidiary of General (NABARD) Insurance Corporation of India. The corre",
    "year": "2003",
    "options": {
      "a": "shareholders",
      "b": "creditors",
      "c": "2 and 3 only",
      "d": "1 and 3 only"
    },
    "answer": "d",
    "explanation": "Bank Rate is that rate of interest at which central bank exchange reserves; controller of credit; clearing house for of a country provides refinancing facilities to commercial settling inter bank transactions. It follows an independent banks. The bank rate, a benchmark rate at which RBI buys monetary policy. or re-discounts bills of exchange or other commercial papers"
  },
  {
    "number": 22,
    "text": "Consider the following statements:",
    "year": "2007",
    "options": {
      "c": "debtors",
      "d": "directors"
    },
    "answer": "a",
    "explanation": "Repo Rate is the rate at which commercial banks borrow activities. As of March 2014, the number of RRBs has been funds from RBI. A reduction in the repo rate will help banks reduced to 57. to get money from the central bank at a cheaper rate. When"
  },
  {
    "number": 1,
    "text": "The repo rate is the rate at which other banks borrow 16. In the last one decade, which one among the following from the Reserve Bank of India. sectors has attracted the highest Foreign Direct Investment 2. A value of 1 for Gini Coefficient in a country implies inflows into India?",
    "year": "2004",
    "options": {
      "a": "Chemicals other than fertilizers population.",
      "b": "Services sector Which of the statements given above is/are correct?",
      "c": "Food processing",
      "d": "Telecommunication"
    },
    "answer": "d",
    "explanation": "Variable Reserve Ratio (Cash Reserve Ratio) is aimed sign of economic development. This reproduces the trend to control only volume of credit (quantitative method) not shown by western countries as they were developing. both volume and purpose of credit for which bank gives"
  },
  {
    "number": 23,
    "text": "The National Housing Bank was set up in India as a wholly- 1. The National Housing Bank the apex institution of owned subsidiary of which one of the following?",
    "year": "2007",
    "options": {
      "a": "State Bank of India subsidiary of the Reserve Bank of India",
      "b": "Reserve Bank of India"
    },
    "answer": "b",
    "explanation": "National Housing Bank has been set up under the increased bank rate increases the cost of borrowing and National Housing Bank Act of 1987, which was passed on effectively reduces its attractiveness. 9th July, 1988. It is wholly owned by the Reserve bank of"
  },
  {
    "number": 2,
    "text": "The Small Industries Development Bank of India was (c) ICICI Bank established as a whollyowned subsidiary of the (d) Life Insurance Corporation of India Industrial Development Bank of India 24. Which one of the following pairs is not correctly matched? Which of the statements given above is/are correct?",
    "year": "2009",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "Bank Rate is that rate of interest at which central bank exchange reserves; controller of credit; clearing house for of a country provides refinancing facilities to commercial settling inter bank transactions. It follows an independent banks. The bank rate, a benchmark rate at which RBI buys monetary policy. or re-discounts bills of exchange or other commercial papers"
  },
  {
    "number": 1,
    "text": "Reserve Bank of India was nationalized on 26 January, (d) USA : Nasdaq 1950 5337_DBE The Tertiary Sector in the Indian Economy D 43 25. Which of the following terms indicates a mechanism used Which of the statements given above is/are correct? by commercial banks for providing credit to the (a) 1 only (b) 2 only government?",
    "year": "2010",
    "options": {
      "a": "Cash Credit Ratio",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "Variable Reserve Ratio (Cash Reserve Ratio) is aimed sign of economic development. This reproduces the trend to control only volume of credit (quantitative method) not shown by western countries as they were developing. both volume and purpose of credit for which bank gives"
  },
  {
    "number": 32,
    "text": "The International Development Association, a lending (b) Debt Service Obligation agency, is administered by the",
    "year": "2010",
    "options": {
      "a": "International Bank for Reconstruction and Development",
      "b": "International Fund for Agricultural Development",
      "c": "Liquidity Adjustment Facility",
      "d": "Statutory Liquidity Ratio"
    },
    "answer": "a",
    "explanation": "International Development Association (IDA) , is that"
  },
  {
    "number": 34,
    "text": "The Reserve Bank of India regulates the commercial banks (a) An investor who feels that the price of a particular in matters of [2013 - I] security is going to fall 1. liquidity of assets 2. branch expansion (b) An investor who expects the price of particular shares 3. merger of banks 4. winding-up of banks to rise Select the correct answer using the codes given below. (c) A shareholder or a bondh",
    "year": "2010",
    "options": {
      "a": "market rate of interest is likely to fall",
      "b": "Central Bank is no longer making loans to commercial",
      "c": "Indian Banks’ Association",
      "d": "None of the above."
    },
    "answer": "d",
    "explanation": "The Reserve Bank of India is the main monetary first paragraph. authority of the country and beside that, in its capacity as Ref : https://rbi.org.in/SCRIPTs/BS_PressRelease Display. the central bank, acts as the bank of the national and state aspxs?prid=35749 governments. D 48 Topicwise Solved Papers"
  },
  {
    "number": 1,
    "text": "Bitcoins are tracked by the Central Banks of the 1. Bank rate 2. Open market operations countries. 3. Public debt 4. Public revenue 2. Anyone with a Bitcoin address can send and receive Which of the above is/are component/ components of Bitcoins from anyone else with a Bitcoin address. Monetary Policy? 3. Online payments can be sent without either side (a) 1 only (b) 2, 3 and 4 (c) 1 and 2 (d) 1, ",
    "year": "2015-I",
    "options": {
      "a": "India's GDP growth rate increases drastically",
      "c": "3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Variable Reserve Ratio (Cash Reserve Ratio) is aimed sign of economic development. This reproduces the trend to control only volume of credit (quantitative method) not shown by western countries as they were developing. both volume and purpose of credit for which bank gives"
  },
  {
    "number": 48,
    "text": "The term ‘Base Erosion and Profit Shifting’ is sometimes (b) Foreign Institutional Investors may bring more capital seen in the news in the context of",
    "year": "2016-I",
    "options": {
      "a": "mining operation by multinational companies in",
      "b": "curbing of the tax evasion by multinational companies system",
      "c": "Scheduled Commercial Banks may cut their lending rates resource-rich but backward areas",
      "d": "It may drastically reduce the liquidity to the banking"
    },
    "answer": "b",
    "explanation": "(i) Base Erosion and Profit Shifting (BEPS) is a tax is correct. avoidance strategy used by multinational companies,"
  }
]