[
  {
    "number": 14,
    "text": "Which one of the following is the objective of National (c) doing away with procedural formalities for foreign direct Renewal Fund?",
    "year": "1999",
    "options": {
      "a": "To safeguard the interests of workers who may be",
      "d": "significant reduction in tax rates affected by technological upgradation of industry or"
    },
    "answer": "c",
    "explanation": "Statutory minimum price of sugarcane for every best indicators of agricultural development. Political stability season is a policy provision while sugar and sugarcane plays a very small role in agricultural development. falls within essential commodities act."
  },
  {
    "number": 1,
    "text": "in respect of Current Account of Balance of payment (c) For the development of infrastructure such as energy, 2. in respect of Capital Account of Balance of payment transport communications and irrigation 3. into gold (d) For human resource development such as full literacy, Which of these statements is/are correct ? employment population control, housing and drinking water (a) 1 alone (b) 3 alone",
    "year": "1999",
    "options": {
      "a": "50 percent of the men and women seeking jobs in rural because the latter takes into account the rate of :",
      "b": "50 percent of the men seeking jobs in rural areas",
      "c": "one man and one woman in a rural family living below",
      "d": "increase in the wage rate"
    },
    "answer": "d",
    "explanation": "Art. 269 says taxes on income other than agricultural"
  },
  {
    "number": 17,
    "text": "Assertion (A) : The rate of growth of India’s exports has (a) Commercial loans shown an appreciable increase after 1991.",
    "year": "2000",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not a correct explanation of A",
      "c": "Foreign Portfolio Investment",
      "d": "External Commercial borrowings"
    },
    "answer": "b",
    "explanation": "We have a National Seed policy made in 2002. So 1 is not 15567 (2012-13 Data). a constraint. The private sector produces high-priced seeds"
  },
  {
    "number": 25,
    "text": "Five Year Plan in India is finally approved by:",
    "year": "2002",
    "options": {
      "a": "Union Cabinet",
      "b": "President on the advice of Prime Minister",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "d",
    "explanation": "not done for all the cereals for which MSP is announced • Majority of the external debt is by the private sector’s (e.g. Jowar, Bajra, Ragi etc). So, #1 is wrong. external commercial borrowing (ECB). So #1 is wrong. • Market factors of Supply and demand may create a • Second statement is extreme worded hyperbole so scenario where market price of cereal/pulses may rise higher it’s wrong. But just to crosscheck: Page 154 of 154 than MSP. Market players are not legally bound to keep Economic Survey"
  },
  {
    "number": 1,
    "text": "UN India Human (a) it has to borrow to make interest payments on Programme Development Report outstanding loans B. National Council 2. India Development (b) It has to abide by the conditionalities imposed by the of Applied Economic International Monetary fund. Report Research (c) it has been refused loans or aid by creditors abroad C. Indira Gandhi 3. World Development (d) the World Bank charges a",
    "year": "2006",
    "options": {
      "a": "direct tax levied by the Central Government. Codes:",
      "b": "indirect tax levied by the Central Government.",
      "c": "direct tax levied by the State Government.",
      "d": "A-2; B-1; C-4; D-3"
    },
    "answer": "d",
    "explanation": "Art. 269 says taxes on income other than agricultural"
  },
  {
    "number": 19,
    "text": "“...instil into the vast millions of workers, men and women, 28. During which Five Year Plan was the Emergency clamped, who actually do the job, a sense of partnership and of new elections took place and the Janata Party was elected? cooperative performance...” The above passage relates to:",
    "year": "2009",
    "options": {
      "a": "Third",
      "b": "Fourth",
      "c": "Fifth",
      "d": "Sixth"
    },
    "answer": "b",
    "explanation": "(i) Spraying urea with Neem oil slows the release of nitrogen, by about 10 to 15 per cent, concomitantly reducing Year consumption of the fertiliser. Many research studies in India"
  },
  {
    "number": 30,
    "text": "Which one of the following brings out the publication called (a) Department of Revenue “Energy Statistics” from time to time?",
    "year": "2009",
    "options": {
      "a": "Central Power Research Institute",
      "b": "Department of Economic Affairs",
      "c": "Department of Financial Services",
      "d": "Department of Expenditure"
    },
    "answer": "d",
    "explanation": "Board (IPAB) from HRD ministry to commerce ministry. • India Patent Act: Chapter 2: Inventions not • Successive Economic surveys have highlighted that patentable: Bullet (j): plants and animals in whole or any Government’s open ended procurement is limited to part thereof, including seeds, varieties and species. So, wheat and rice. #1 is wrong, #3 is right, answer is (c). • And even after PM-AASHA reforms, procurement is"
  },
  {
    "number": 1,
    "text": "Cutting the tax rates 31. In the context of independent India’s economy, which one 2. Increasing the government spending of the following was the earliest event to take place? 3. Abolishing the subsidies in the context of economic",
    "year": "2009",
    "options": {
      "a": "Nationalization of Insurance companies Which of the above actions can be considered a part of the",
      "b": "Nationalization of State Bank of India “fiscal stimulus” package?",
      "c": "Enactment of Banking Regulation Act",
      "d": "Introduction of First Five-Year Plan"
    },
    "answer": "d",
    "explanation": "Art. 269 says taxes on income other than agricultural"
  },
  {
    "number": 1,
    "text": "Development of infrastructure facilities. (a) Fourth Plan (b) Sixth Plan 2. Promotion of investment from foreign sources. (c) Eighth Plan (d) Tenth Plan 3. Promotion of exports of services only. 40. With reference to the Nationa1 Investment Fund to which Which of the above are the objectives of this Act? the disinvestment proceeds are routed, consider the (a) 1 and 2 only (b) 3 only following stat",
    "year": "2010",
    "options": {
      "c": "2 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Art. 269 says taxes on income other than agricultural"
  },
  {
    "number": 3,
    "text": "Certain Asset Management companies are appointed receiving FDI as the fund managers. (b) India has double taxation avoidance agreement with 4. A certain proportion of annual income is used for Mauritius financing select social sectors. (c) Most citizens of Mauritius have ethnic identity with Which of the statements given above is/are correct ? India and so they feel secure to invest in India (a) 1",
    "year": "2010",
    "options": {
      "a": "Service tax",
      "b": "Personal income tax statements:",
      "c": "Excise duty",
      "d": "Corporation tax"
    },
    "answer": "a",
    "explanation": "Encyclopedia Britannica: In the 15th and 16th • Investment is a term associated with the capital part centuries, during the Columbian Exchange: numerous of the budget. So “subsidy” - a revenue part is not an plants, animals, and microbes from old world (Europe, example of ‘public investment’. Economic Survey 2019-20 Asia, and Africa) were introduced to the new world page 84 also confirms this. (Americas) and vice versa. From the image given in the • Free electricity to farmers involves the gover"
  },
  {
    "number": 73,
    "text": "With reference to Union Budget, which of the following (a) providing housing loan to poor people at cheaper is/are covered under Non-Plan Expenditure? [2014 - I] interest rates 1. Defence expenditure (b) promoting women's Self-Help Groups in backward areas 2. Interest payments (c) promoting financial inclusion in the country 3. Salaries and pensions (d) providing financial help to the marginalized",
    "year": "2015-I",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "It has increased the share of States in the central (c) 1, 2, 3 and 4 (d) None divisible pool from 32 percent to 42 percent. 74. The sales tax you pay while purchasing a toothpaste is a 2. It has made recommendations concerning sector- [2014 - I] specific grants. (a) tax imposed by the Central Government Select the correct answer using the code given below. (b) tax imposed by the Central Governmen",
    "year": "2015-I",
    "options": {
      "a": "being able to convert rupee notes into gold",
      "b": "allowing the value of rupee to be fixed by market forces",
      "d": "tax imposed and collected by the State Government"
    },
    "answer": "d",
    "explanation": "Art. 269 says taxes on income other than agricultural"
  },
  {
    "number": 75,
    "text": "What does venture capital mean? [2014 - I] (c) freely permitting the conversion of rupee to other (a) A short-term capital provided to industries currencies and vice versa (b) A long-term start-up capital provided to new (d) developing an international market for currencies in India entrepreneurs 83. The Government of India has established NITI Aayog to (c) Funds provided to industries at times of",
    "year": "2015-I",
    "options": {
      "a": "Human Rights Commission industries",
      "b": "Finance Commission",
      "d": "Funds provided for replacement and renovation of"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "National Payments Corporation of India (NPCI) helps 1. Its purpose is to promote entrepreneurship among in promoting the financial inclusion in the country. SC/ST and women entrepreneurs. 2. NPCI has launched RuPay, a card payment scheme. 2. It provides for refinance through SIDBI. Which of the statements given above is/are correct? Select the correct answer using the code given below. (a) 1 only ",
    "year": "2016-I",
    "options": {
      "a": "bringing the small entrepreneurs into formal financial",
      "b": "providing loans to poor farmers for cultivating payments. particular crops",
      "c": "providing pensions to old and destitute persons currency in about two decades.",
      "d": "funding the voluntary organizations involved in the promotion of skill development and employment"
    },
    "answer": "d",
    "explanation": "Art. 269 says taxes on income other than agricultural"
  },
  {
    "number": 1,
    "text": "Promoting mineral exploration activities in mineral- 1. To supply credit to small business units rich districts 2. To supply credit to small and marginal farmers 2. Protecting the interests of the persons affected by 3. To encourage young entrepreneurs to set up mining operations business particularly in rural areas. 3. Authorizing State Governments to issue licences for mineral exploration Select",
    "year": "2017-I",
    "options": {
      "a": "Resident Indian citizens only",
      "b": "Persons of age from 21 to 55 only",
      "c": "All State Government employees joining the services start-up entrepreneurs after the date of notification by the respective State",
      "d": "providing affordable and quality education to the"
    },
    "answer": "d",
    "explanation": "Art. 269 says taxes on income other than agricultural"
  },
  {
    "number": 1,
    "text": "It will replace multiple taxes collected by multiple 2. It allows you to access your e-documents irrespective authorities and will thus create a single market in of your physical location. India. Select the correct answer using the code given below. 2. It will drastically reduce the 'Current Account Deficit' (a) 1 only (b) 2 only of India and will enable it to increase its foreign (c) Both 1 and 2",
    "year": "2016-I",
    "options": {
      "a": "immunization of children and pregnant women in the near future.",
      "b": "construction of smart cities across the country Select the correct answer using the code given below:",
      "c": "India’s own search for the Earth-like planets in outer space",
      "d": "New Educational Policy"
    },
    "answer": "d",
    "explanation": "Art. 269 says taxes on income other than agricultural"
  },
  {
    "number": 1,
    "text": "Tax revenue as a per cent of GDP of India has Governments. steadily increased in the last decade. 3. Treasury bills offer are issued at a discount from the 2. Fiscal deficit as a per cent of GDP of India has par value. steadily increased in the last decade. Which of the statements given above is/are correct? Which of the statements given above is/are correct? (a) 1 and 2 only (b) 3 Only (a) 1 only",
    "year": "2017-I",
    "options": {
      "a": "Achieving 100% literacy by promoting collaboration",
      "b": "the opportunity cost is ignored. education system and local communities.",
      "c": "the opportunity cost is transferred from the",
      "d": "the opportunity cost is transferred from the through appropriate technologies. consumers of the products to the Government."
    },
    "answer": "d",
    "explanation": "Art. 269 says taxes on income other than agricultural"
  },
  {
    "number": 107,
    "text": "Increase in absolute and per capita real GNP do not connote in order to make India a scientific and technological a higher level of economic development, if",
    "year": "2018-I",
    "options": {
      "a": "industrial output fails to keep pace with agricultural",
      "b": "agricultural output fails to keep pace with industrial poor, and organizing skill development programmes output. and vocational training for them.",
      "c": "poverty and unemployment increase.",
      "d": "Developing human capital by allocating special funds output. for health care and education of rural and urban"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "The WPI does not capture changes in the prices of promoting exports services, which CPI does. (b) Encouraging indian borrowers to issue rupee 3. Reserve Bank of India has now adopted WPI as its denominated Masala bonds key measure of inflation and to decide on changing (c) Easing conditions relating to external commercial borrowing the key policy rates. (d) Following an expansionary monetary polic",
    "year": "2019-I",
    "options": {
      "a": "Increase in the cash reserve ratio",
      "c": "3 only 4,",
      "d": "1, 2 and 3"
    },
    "answer": "a",
    "explanation": "Rice production is highest in India among cereals but offered by the farmers for sale at MSP. Minimum Support its quality of rice cannot compete with other rice producing Price is announced for around 22 crops. Wheat and Rice are countries. Most of rice produced in India is meant for issued by the central Government at Uniform central issue internal consumption. India is a major producer and Prices (CIPs) to states and Union Territories for distribution exporter of Basmati rice. under TPDS. The "
  },
  {
    "number": 2,
    "text": "The percentage share of rural areas in the workforce 1. Not depending on short-term foreign borrowings steadily increased. 2. Opening up to more foreign banks 3. In rural areas, the growth in the non-farm economy 3. Maintaining full capital account convertibility increased. Select the correct answer using the code given below : 4. The growth rate in rural employment decreased. (a) 1 only (b) 1 and",
    "year": "2020-I",
    "options": {
      "a": "to reduce it by `1,00,000",
      "b": "to increase it by `1,00,000"
    },
    "answer": "a",
    "explanation": "Rice production is highest in India among cereals but offered by the farmers for sale at MSP. Minimum Support its quality of rice cannot compete with other rice producing Price is announced for around 22 crops. Wheat and Rice are countries. Most of rice produced in India is meant for issued by the central Government at Uniform central issue internal consumption. India is a major producer and Prices (CIPs) to states and Union Territories for distribution exporter of Basmati rice. under TPDS. The "
  },
  {
    "number": 1,
    "text": "Cost of restoration of the computer system in case (c) to increase it by more than `1,00,000 of malware disrupting access to one’s computer (d) to leave it unchanged 2. Cost of a new computer if some miscreant wilfully 117. Along with the Budget, the Finance Minister also places damages it, if proved so other documents before the Parliament which include 3. Cost of hiring a specialized consultant ",
    "year": "2020-I",
    "options": {
      "a": "Long standing parliamentary convention Select the correct answer using the code given below :",
      "b": "1, 3 and 4 only India",
      "c": "2 and 3 only",
      "d": "1, 2, 3 and 4 D 22 Topicwise Solved Papers HINTS & SOLUTIONS 1."
    },
    "answer": "d",
    "explanation": "Art. 269 says taxes on income other than agricultural"
  }
]