[
  {
    "number": 1,
    "text": "Alamatti (a) chartering wing of the Minister of Surface Transport B. Krishna 2. Mettur (b) container service established by Indian Railways C. Narmada 3. Gandhi Sagar (c) training institute of maritime studies and research D. Chambal 4. Sardar Sarovar (d) passenger insurance scheme of Indian Railways Codes : 16. Which one of the following statements is not true of the (a) A-1; B- 4; C-2; D-3 (b) A",
    "year": "1999",
    "options": {
      "a": "The total length is about 760 km",
      "c": "A-2; B-1; C-3; D-4",
      "d": "A-1; B-3; C-4; D-2"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 1,
    "text": "Assam 4 B. Haflong 2. West Bengal C. Kalimpong 3. Uttar Pradesh 3 D. Kufri 4. Himachal Pradesh Codes: 5 (a) A-1; B-3; C-2; D-4 (b) A-3; B-1; C-4; D-2 (c) A-3; B-1; C-2; D-4 (d) A-1; B-3; C-4; D-2 Names of institutes: 18. The language spoken by the largest number of people of A. Central Marine Fisheries Research Institute the world is :",
    "year": "1999",
    "options": {
      "a": "Hindi",
      "b": "English C. National Dairy Research Institute",
      "c": "Mandarin",
      "d": "Spanish D. National Institute of Agricultural Extension Management"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 19,
    "text": "Which one of the following pairs of folk dance forms and Codes: states and correctly matched?",
    "year": "1999",
    "options": {
      "a": "A-5; B-1; C-3; D-2",
      "b": "A-5; B-2; C-1; D-4",
      "c": "A-4; B-2; C-1; D-3",
      "d": "A-1; B-2; C-3; D-4"
    },
    "answer": "d",
    "explanation": "Monte Carlo officially refers to an administrative area Wally Grout -Test cricketer of the Principality of Monaco specifically the ward of Monte, Eusebio- Football where the Monte Carlo Casino is located. Rod Laver- Lawn Tennis"
  },
  {
    "number": 4,
    "text": "South Atlantic Ocean 5337_DBE Indian Panorama G 21 Codes: 29. The Raga which is sung early in the morning is:",
    "year": "2000",
    "options": {
      "a": "A-2; B-4; C-1; D-3",
      "b": "A-2; B-3; C-1; D-4",
      "c": "A-1; B-3; C-2; D-4",
      "d": "A-1; B-4; C-2; D-3"
    },
    "answer": "c",
    "explanation": "Barry Richards was a famous batsman of South Africa, and World Cup that the two teams who played the opening Tex Dexter was hard hitting batsman of England, Alan match of the championship met again in the final. Greece Davidson was a renowned wicket keeper of Australia and have won their very first major title. Greece became the first Charlie Griffth was a fast bowler of West Indies. nation to win a major championship led by a foreign manager."
  },
  {
    "number": 1,
    "text": "Rice husk Limited, Andhra Pradesh B. M/s K.M. Sugar Mills, 2. Slaughter house Uttar Pradesh waste C. M/s Satia Paper Mills, 3. Distillery spent Punjab wash D. M/s Al Kabeer Exports 4. Black liquor Limited, Andhra Pradesh Codes: (a) A-3; B-1; C-2; D-4 (b) A-3; B-1; C-4; D-2 (c) A-1; B-3; C-4; D-2 (d) A-1; B-3; C-2; D-4 A. I.S.R.O B. I.I.R.S. 27. Match List I with List II and select the correct answ",
    "year": "2000",
    "options": {
      "a": "A-4; B-1; C-2; D-3",
      "b": "A-1; B-4; C-3; D-2 music delivery)",
      "c": "A-1; B-4; C-3; D-2",
      "d": "A-4; B-1; C-3; D-2 A. Balamurali Krishna"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 2,
    "text": "Ghatam (a) Bihar (b) Karnataka C. Kanyakumari 3. Sitar (c) Maharashtra (d) Uttar Pradesh D. Nikhil Bannerjee 4. Violin 35. Match List-I with List-II and select the correct answer using 5. Carnatic Vocal the codes given below the lists:",
    "year": "2001",
    "options": {
      "a": "A-5; B-1; C-2; D-3",
      "b": "A-4; B-3; C-1; D-5 A. Central Institute of"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  },
  {
    "number": 2,
    "text": "Hyderabad (a) Baki Itihas : Badal Sarkar Printing and Diagnostics (b) Sita Swayamvar : Vishnu Das Bhave C. Institute of Microbial 3. New Delhi (c) Yayati : Girish Karnad Technology (d) Giddha : Jabbar Patel D. National Institute of 4. Lucknow Immunology G 22 Topicwise Solved Papers Codes: 42. Which of the following pairs are correctly matched?",
    "year": "2005",
    "options": {
      "a": "A-2; B-4; C-1; D-3",
      "b": "A-4; B-2; C-1; D-3 Enterprise Industrial Group",
      "c": "A-2; B-4; C-3; D-1",
      "d": "A-4; B-2; C-3; D-1"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  },
  {
    "number": 1,
    "text": "Atomic Minerals Directorate for Research and D. Meena Kaushik 4. Avestha Gangraine Exploration Technologies 2. Heavy Water Board 5. Biacon India 3. Indian Rare Earths Limited Codes: 4. Uranium Corporation of India (a) A-4; B-1; C-5; D-3 (b) A-2; B-3; C-4; D-1 Which of these is/are under the Department of Atomic (c) A-4; B-3; C-5; D-1 (d) A-2; B-1; C-4; D-3 Energy? 44. The world's highest ground ba",
    "year": "2002",
    "options": {
      "a": "Colombia",
      "b": "India",
      "c": "2, 3 and 4",
      "d": "1, 2, 3 and 4"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 4,
    "text": "Bharatanatyam The objectives of the National Renewal Fund set up in Codes: February 1992 were: (a) A – 2; B – 3; C – 1; D – 4 1. to give training and counselling for workers affected (b) A – 3; B – 2; C – 4; D – 1 by retrenchment or VRS (c) A – 3; B – 1; C – 4; D – 2 2. redeployment of workers (d) A – 2; B – 3; C – 4; D – 1 Which of these statements is/are correct? 40. Which of the following commi",
    "year": "2001",
    "options": {
      "a": "Abid Hussian Committee",
      "b": "Bhagwati Committee",
      "c": "1 only",
      "d": "2 only"
    },
    "answer": "c",
    "explanation": "Barry Richards was a famous batsman of South Africa, and World Cup that the two teams who played the opening Tex Dexter was hard hitting batsman of England, Alan match of the championship met again in the final. Greece Davidson was a renowned wicket keeper of Australia and have won their very first major title. Greece became the first Charlie Griffth was a fast bowler of West Indies. nation to win a major championship led by a foreign manager."
  },
  {
    "number": 1,
    "text": "Mulk Raj Anand (a) recommendations for reforms in the power sector an Unknown Indian (b) recommendations for tax reforms B. India : A Wounded 2. Nirad C. Chaudhari (c) guidelines for the privatization of public sector undertakings Civilization (d) guidelines for reducing vehicular pollution, and the C. Confessions of a Lover 3. R. K. Narayan promotion of CNG use D. The English Teacher 4. V.S. Naip",
    "year": "2003",
    "options": {
      "a": "A-1; B-3; C-2; D-4",
      "c": "A-1; B- 4; C-2; D-3",
      "d": "A-2; B-3; C-1; D-4 A. National Sugar Institute"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 3,
    "text": "Pune List-I (Artist) List-II (Art) D. Institute of National 4. Hyderabad A. Hira Battacharya 1. Bharatanatyam dance Integration B. Malini Rajurkar 2. Hindustani vocal music 5. Kanpur C. Pratiba Prahlad 3. Kuchipudi dance Codes: D. Vampati Chinna 4. Pupperty (a) A-3; B-1; C-4; D-2 (b) A-5; B-1; C-4; D-3 Satyam (c) A-3; B-4; C-5; D-2 (d) A-5; B-4; C-2; D-3 Codes: 57. Match List-I with List-II and se",
    "year": "2003",
    "options": {
      "c": "A-4; B-1; C-2; D-3",
      "d": "A-3; B-2; C-1; D-4 List-I List II"
    },
    "answer": "d",
    "explanation": "Anjali Vedpathak is related to Rifle Shooting, Mouma"
  },
  {
    "number": 1,
    "text": "National Dairy Development Board (a) With the induction of Prithvi-II, the IAF is the only air B. Anu Aga 2. Park Hotels force in the world with surface to surface ballistic C. Mallika Srinivasan 3. Pfizer Limited missiles under its command D. Priya Paul 4. Thermax Limited (b) Sukhoi-30 MKI jet fighters can launch air-to-air and 5. Tractors and Farm air-to-surface precision missiles Equipment (c) ",
    "year": "2003",
    "options": {
      "a": "literature",
      "b": "musician List-I List-II",
      "c": "scientist"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 1,
    "text": "Executive Director, IMF 1950 as the National Anthem of India B. Suresh Kalamadi 2. Chairman, Steel Authority 54. The thermal power plant of Bokaro is located in: of India Limited C. Praful Patel 3. President Indian Olympic (a) Bihar (b) Chhattisgarh",
    "year": "2003",
    "options": {
      "c": "Jharkhand",
      "d": "Orissa D. V. S. Jain"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 4,
    "text": "Vice-President, South 55. Which one among the following has the largest shipyard in Asian Region, World Bank India?",
    "year": "2003",
    "options": {
      "a": "Kolkata",
      "b": "Kochi",
      "c": "Mumbai",
      "d": "Visakhapatnam"
    },
    "answer": "c",
    "explanation": "Barry Richards was a famous batsman of South Africa, and World Cup that the two teams who played the opening Tex Dexter was hard hitting batsman of England, Alan match of the championship met again in the final. Greece Davidson was a renowned wicket keeper of Australia and have won their very first major title. Greece became the first Charlie Griffth was a fast bowler of West Indies. nation to win a major championship led by a foreign manager."
  },
  {
    "number": 1,
    "text": "P.V. Narasimha Rao’s government established (a) Debu Chaudhuri (b) Madhup Mudgal diplomatic relations between India and Isreal (c) Ronu Mazumdar (d) Sahafaat Ahmad 2. Ariel Sharon is the second Prime Minister of Isreal to 63. Which one of the following statements is not correct? have visited India",
    "year": "2004",
    "options": {
      "a": "The largest Buddhist monastery in India is in Assam",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither I nor 2"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 4,
    "text": "Hyderabad (a) cultivation of genetically modified cotton Research Institute (b) rehabilitation of women victims of AIDS Codes: (c) livelihood projects for destitute rural women (a) A-2; B-3; C-1; D-4 (b) A-1; B-4; C-2; D-3 (d) rain-water harvesting (c) A-2; B-4; C-1; D-3 (d) A-1; B-3; C-2; D-4 73. Which one of the following pairs is not correctly matched? 66. Which one of the following pairs is no",
    "year": "2005",
    "options": {
      "a": "Southern Air Command: Thiruvananthapuram Unit of Indian Railway Location",
      "b": "Eastern Naval Command :Visakhapatnam",
      "c": "Armoured corps centre and school : Jabalpur",
      "d": "Army Medical crops centre and school : Lucknow Railway Electrification Varanasi"
    },
    "answer": "c",
    "explanation": "Barry Richards was a famous batsman of South Africa, and World Cup that the two teams who played the opening Tex Dexter was hard hitting batsman of England, Alan match of the championship met again in the final. Greece Davidson was a renowned wicket keeper of Australia and have won their very first major title. Greece became the first Charlie Griffth was a fast bowler of West Indies. nation to win a major championship led by a foreign manager."
  },
  {
    "number": 74,
    "text": "For which one of the following, is Satara well known? (c) Wheel and Axle Plant Bangalore",
    "year": "2005",
    "options": {
      "a": "Thermal Power Plant",
      "b": "Wind Energy Plant",
      "d": "Rail Coach Factory Kapurthala"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 75,
    "text": "Consider the following statements.",
    "year": "2005",
    "options": {
      "a": "K.V.K Sundaram",
      "b": "G. S. Dhillon"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 85,
    "text": "Which one of the following pairs is NOT correctly matched? Publication: Group: [2G0026]5 1. Sportstars 1. The Hindu Publication Railway Zone Headquarters Group (a) North-Eastern Railway Gorakhpur 2. Business-World 2. ABP Group (b) South-Eastern Railway Bhubaneshwar 3. The Week 3. Malayala Manorama (c) Eastern Railway Kolkata Publication Group (d) South-East Central Railway Bilaspur 4. Reader’s Dig",
    "year": "2006",
    "options": {
      "a": "1, 2, 3 and 4",
      "b": "1, 2 and 3",
      "c": "2 and 4",
      "d": "1 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Automobiles Manufacture (a) States Reorganization Act: Andhra Pradesh B. C.K. Prahald 2. Fisheries Economy (b) Treaty of Yandabu : Assam C. Johan Kurien 3. Information Technology (c) State of Bilaspur : Himachal becomes a State and Software (d) Year 1966 : Gujarat becomes a State D. Kiran Karnik 4. Poultry Farming 88. Match List-I (Indian Scientist/Scholar) with List-II (Area of 5. Management Scie",
    "year": "2006",
    "options": {
      "a": "A-2; B-5; C-1; D-3",
      "b": "A-4; B-3; C-2; D-5 List-I List-II",
      "c": "A-2; B-3; C-1; D-5"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 2,
    "text": "Physics (a) Test Cricket Match Fixing C. G. N. Ramachandran 3. Economics (b) Best Bakery Case D. Ashok Jhunjhunwala 4. Solid State Chemistry (c) Tehelka Tapes Case and Material Science (d) Demolition of the disputed structure at Ayodhya. Codes: 80. Whose autobiography is the book ‘My Music, My Life’? (a) A-4; B-3; C-2; D-1 (b) A-2; B-1; C-4; D-3",
    "year": "2005",
    "options": {
      "a": "Pandit Shiv Kumar Sharma",
      "c": "A-4; B-1; C-2; D-3",
      "d": "A-2; B-3; C-4; D-1"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  },
  {
    "number": 89,
    "text": "In which country is the committee which selects winners (b) Ustad Amjad Ali Khan for Nobel Peace Prize located?",
    "year": "2006",
    "options": {
      "a": "Norway",
      "b": "Sweden",
      "c": "Pandit Ravi Shankar",
      "d": "Ustad Zakir Hussain."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 81,
    "text": "Which one of the following airports in India is the first to be 90. Match List-I (Person) with List-II (Area of Distinction) and select owned by a public limited company?",
    "year": "2005",
    "options": {
      "a": "Dabolim Airport, Goa",
      "b": "Cochin airport List-I List-II",
      "c": "Hyderabad airport"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Violin (a) Arjun : Indigenously produced Main Battle Tank C. T. N. Krishnan 3. Research in Physics (MBT) D. Mahesh Dattani 4. Cancer treatment (b) Phalcon : Cruise missile supplied by Russia to India. 5. Water-harvesting (c) Saras : Indigenously developed civilian passenger Codes: aircraft. (a) A-3; B-1; C-2; D-4 (b) A-2; B-4; C-5; D-1 (d) Operation Seabird: New Indian naval base at Karwar. (c) A-",
    "year": "2005",
    "options": {
      "a": "Ustad Bismillah Kahan",
      "b": "Leela Samson",
      "c": "Gangubai Hangal",
      "d": "Swapnasundari"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  },
  {
    "number": 84,
    "text": "Which one of the following pairs is not correctly matched? (a) Pondicherry",
    "year": "2006",
    "options": {
      "a": "Dhankar Monastery Himachal Pradesh",
      "b": "Maulana Azad National Urdu University, Hyderabad Monastery State",
      "c": "Vishva Bharti, Shanti Niketan"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Women labour sector List-I List-II C. Ebrahim Alkazi 3. Management teaching (Place of Archaeological (State) D. Vijay Govindaraja 4. Literature and social Monument) work for the country A. Sisupalgarh 1. Assam tribal communities B. Piprahwa 2. Manipur Codes: C. Goalpara 3. Orissa (a) A-3; B-1; C-4; D-2 (b) A-2; B-4; C-1; D-3 D. Bishnupur 4. Uttar Pradesh (c) A-3; B-4; C-1; D-2 (d) A-2; B-1; C-4; D",
    "year": "2006",
    "options": {
      "c": "A-3; B-4; C-1; D-2",
      "d": "A-3; B-1; C-4; D-2"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  },
  {
    "number": 3,
    "text": "Sikkim becomes twenty-second State of the Indian Union. (a) Tamil Nadu (b) Karnataka 4. Pokharan-First Nuclear test. (c) Himachal Pradesh (d) Uttaranchal Select the correct answer using the codes given below. 103. Which one of the following pairs is not correctly matched? Codes:",
    "year": "2007",
    "options": {
      "a": "2-4-3-1",
      "b": "3-1-2-4",
      "c": "2-1-4-3",
      "d": "3-4-2-1 Commissioner of India"
    },
    "answer": "d",
    "explanation": "Anjali Vedpathak is related to Rifle Shooting, Mouma"
  },
  {
    "number": 1,
    "text": "An Ordinary Person Guide (d) R C Lahoti : Former Chief Justice of to Empire India B. Bimal Jalan 2. The Argumentative Indian 104. Which one of the following is the correct chronological C. Arundhati Roy 3. The future of India order of the formation of the following as full States of the D. Mani Shankar 4. Confessions of a secular Indian Union?",
    "year": "2007",
    "options": {
      "a": "Sikkim–Arunachal Pradesh–Nagaland–Haryana Codes :",
      "b": "Nagaland –Haryana–Sikkim–Arunachal Pradesh",
      "c": "Sikkim–Haryana–Nagaland–Arunachal Pradesh",
      "d": "A-2; B-3; C-4; D-1"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 96,
    "text": "Which one of the following is not correctly matched? 105. In which one of the following cities is the Global Automotive Prominent Indian Writer Language",
    "year": "2006",
    "options": {
      "a": "Raja Rao : Telugu",
      "b": "Hyderabad",
      "c": "Pune",
      "d": "Gurgaon"
    },
    "answer": "a",
    "explanation": "Raja Rao was an Indian writer of English language headed a committee appointed by the Planning Commission novels and short stories, whose works are deeply rooted in on financial reforms in India. Hinduism."
  },
  {
    "number": 97,
    "text": "Which one of the following pairs is correctly matched? (a) Ashok Lahiri (b) Sumantra Ghoshal",
    "year": "2006",
    "options": {
      "a": "Vikramsila Monastery : Uttar Pradesh",
      "c": "Saumitra Chaudhuri",
      "d": "Raghuram Rajan"
    },
    "answer": "d",
    "explanation": "Vikramasila Monastery is one of the famous (B) Birju Maharaj - Kathak dancer monasteries in Antichak in the Bhagalpur district of Bihar in (C) Priyadarsini - Bharatnatyam dancer India. It is an ancient and great centre of Vajrayana (D) TV Gopalakrishnan - Mridangam Maestro Buddhism and of learning. In 11th century, under the king"
  },
  {
    "number": 107,
    "text": "Match List-I with List-II and select the correct answer using (b) Hemkund Gurudwara : Himachal the code given below the lists:",
    "year": "2007",
    "options": {
      "c": "Udayagiri Caves : Maharashtra A. Bhajan Sopori l. Bharatnatyam dancer",
      "d": "Amaravati Buddhist Stupa : Andhra Pradesh B. Birju Maharaj"
    },
    "answer": "c",
    "explanation": "(A) Bhajan Sopori - Exponent of Santoor"
  },
  {
    "number": 4,
    "text": "Kathak dancer (a) Khadakwasla (b) Sileru Codes: (c) Jamnagar (d) Srisailam (a) A-2; B-1; C-4; D-3 (b) A-3; B-1; C-4; D-2 99. Projects and Development India Limited is mainly engaged (c) A-2; B-4; C-1; D-3 (d) A-3; B-4; C-1; D-2 in design engineering, procurement and supervision of 108. Who among the following wrote the book–Ayodhya : 6 construction/commissioning in which area?",
    "year": "2006",
    "options": {
      "a": "Pharmaceutical plants",
      "b": "P V Narasimha Rao",
      "c": "Jaswant Singh",
      "d": "Arun Shourie"
    },
    "answer": "c",
    "explanation": "Barry Richards was a famous batsman of South Africa, and World Cup that the two teams who played the opening Tex Dexter was hard hitting batsman of England, Alan match of the championship met again in the final. Greece Davidson was a renowned wicket keeper of Australia and have won their very first major title. Greece became the first Charlie Griffth was a fast bowler of West Indies. nation to win a major championship led by a foreign manager."
  },
  {
    "number": 100,
    "text": "To which one of the following process is the term CMYK (a) Environmental protection related?",
    "year": "2006",
    "options": {
      "a": "Railway signaling",
      "b": "Olympics Games",
      "c": "Journalism",
      "d": "Electronic voting machine"
    },
    "answer": "c",
    "explanation": "CMYK refers to the primary colors of pigment: Cyan,"
  },
  {
    "number": 1,
    "text": "Bengaluru G 27 (a) Research in Mathematics B. Rubber Board 2. Guntur (b) Photography C. Tea Board 3. Kottayam (c) Water harvesting D. Tobacco Board 4. Kolkata (d) Pollution control Codes: 111. Match List-I with List-II and select the correct answer using (a) A-2; B-4; C-3;D-1 (b) A-1; B-3; C-4; D-2 the code given below the lists:",
    "year": "2007",
    "options": {
      "c": "A-2; B-3; C-4; D-1",
      "d": "A-1; B-4; C-3; D-2 List-I List-II"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 122,
    "text": "How can the height of a person who is six feet tall be (Eminent Person) (Known As) expressed (approximately) in nanometers?",
    "year": "2008",
    "options": {
      "a": "183 × 106 nanometres",
      "b": "234 × 106 nanometres B. Mike Pandey"
    },
    "answer": "c",
    "explanation": "1 feet = 30.5 cm Headquarter in Mumbai.) 6 feet = 6 × 30.5 = 183.0 cm"
  },
  {
    "number": 4,
    "text": "Wildlife film maker (a) Heart surgery (b) Civil aviation Codes: (c) Theatre training (d) Transport engineering (a) A-1; B-4; C-3; D-2 (b) A-3; B-2; C-1; D-4 124. India is a member of which of the following?",
    "year": "2008",
    "options": {
      "c": "A-1; B-2; C-3; D-4",
      "d": "A-3; B-4; C-1; D-2"
    },
    "answer": "c",
    "explanation": "Barry Richards was a famous batsman of South Africa, and World Cup that the two teams who played the opening Tex Dexter was hard hitting batsman of England, Alan match of the championship met again in the final. Greece Davidson was a renowned wicket keeper of Australia and have won their very first major title. Greece became the first Charlie Griffth was a fast bowler of West Indies. nation to win a major championship led by a foreign manager."
  },
  {
    "number": 3,
    "text": "Colombo Plan (a) B N Rau (b) C Rajagopalachari 4. Organization for Economic Cooperation and (c) Krishna Menon (d) V P Menon Development (OECD) 113. Match List-I with List-II and select the correct answer using Select the correct answer using the code given below: the code given below the lists:",
    "year": "2007",
    "options": {
      "a": "1 and 3 only",
      "b": "2 and 4 only A. V S Naipaul"
    },
    "answer": "d",
    "explanation": "Anjali Vedpathak is related to Rifle Shooting, Mouma"
  },
  {
    "number": 4,
    "text": "Staying On (a) Manipuri (b) Bharat Natyam Codes: (c) Kuchipudi (d) Odissi (a) A-2; B-3; C-4; D-1 (b) A-4; B-1; C-2; D-3 126. How is Sarosh Zaiwalla well-known as?",
    "year": "2008",
    "options": {
      "a": "A leading theatre personality",
      "c": "A-2; B-1; C-4; D-3",
      "d": "A-4; B-3; C-2; D-1"
    },
    "answer": "c",
    "explanation": "Barry Richards was a famous batsman of South Africa, and World Cup that the two teams who played the opening Tex Dexter was hard hitting batsman of England, Alan match of the championship met again in the final. Greece Davidson was a renowned wicket keeper of Australia and have won their very first major title. Greece became the first Charlie Griffth was a fast bowler of West Indies. nation to win a major championship led by a foreign manager."
  },
  {
    "number": 114,
    "text": "Near which one of the following cities are Palitana Temples (b) A leading wildlife photographer located?",
    "year": "2008",
    "options": {
      "a": "Bhavnagar",
      "b": "Mount Abu",
      "c": "A leading international legal expert",
      "d": "A leading orthopaedic surgeon"
    },
    "answer": "a",
    "explanation": "The Palitana temples of Jainism are located on organisation in the world in the field of hydraulics and allied Shatrunjaya by the city of Palitana in Bhavnagar district, research. Gujarat, India."
  },
  {
    "number": 127,
    "text": "Among the Indian languages, which one is spoken maximum 115. With which one of the following is BRIT (Government of in the world after Hindi?",
    "year": "2008",
    "options": {
      "a": "Telugu",
      "b": "Tamil",
      "c": "Bengali",
      "d": "Malayalam"
    },
    "answer": "c",
    "explanation": "India is a land of a thousand languages, or at least Chowdhary over 120. Bengali is the official language of Bangladesh and (C) Romila Thapar - History writing is native to the Bengal region, which is made up of (D) Vanashree Rao - Dance Bangladesh as well as the Indian states of Tripura, West"
  },
  {
    "number": 128,
    "text": "Which of the following pairs are correctly matched?",
    "year": "2008",
    "options": {
      "c": "Isotope Technology",
      "d": "Road Transport Institute Location"
    },
    "answer": "c",
    "explanation": "The National Centre for Cell Science is a National Level, (1) Devi Ahilya Bai Holkar Award, Biotechnology, Tissue Engineering and Tissue Banking (2) Kannagi Devi Award, research center located at Savitribai Phule Pune University (3) Mata Jijabai Award, campus in Pune, Maharashtra. (4) Rani Gaidinliu Zeliang Award,"
  },
  {
    "number": 116,
    "text": "Rajiv Gandhi National Flying Institute is being established 1. National Centre for : Mysore in which State?",
    "year": "2008",
    "options": {
      "a": "Karnataka",
      "b": "Maharashtra"
    },
    "answer": "b",
    "explanation": "Rajiv Gandhi National Flying Institute is located in Magenta, Yellow, and Black. These are the inks used on the Maharashtra. press in \"4-color process printing\", commonly referred to"
  },
  {
    "number": 119,
    "text": "Which was the Capital of Andhra State when it was made a (a) Atal Bihari Vajpayee separate State in the year 1953?",
    "year": "2008",
    "options": {
      "a": "Guntur",
      "b": "Lal Bahadur Shastri",
      "c": "Choudhary Charan Singh",
      "d": "Warangal"
    },
    "answer": "b",
    "explanation": "Andhra attained statehood on 1 November 1953, with Rukmini Devi Arundale - Dancer Kurnool as its capital. On 1 November 1956, the States Suryakant Tripathi Nirala - Poet Reorganization Act merged the Telugu-speaking areas of the"
  },
  {
    "number": 120,
    "text": "Which one of the following is the largest (area wise) Lok 130. Elizabeth Hawley is well-known for her writings relating to Sabha constituency?",
    "year": "2008",
    "options": {
      "a": "Kangra",
      "b": "Ladakh",
      "c": "Kachchh",
      "d": "Bhilwara"
    },
    "answer": "b",
    "explanation": "Laddakh (Jammu and Kashmir) is the largest areawise Naidu. LS constituency and then comes Barmer (Rajasthan), Kutch"
  },
  {
    "number": 132,
    "text": "Which one of the following is not a drug/pharma company? (b) Varahagiri Venkatagiri",
    "year": "2009",
    "options": {
      "a": "Chevron",
      "b": "Nicholas Piramal",
      "c": "Giani Zail Singh",
      "d": "Dr. Shanker Dayal Sharma"
    },
    "answer": "a",
    "explanation": "Chevron Corporation is an American multinational and lies in the middle of white band. Its design is that of the energy corporation. G 35 wheel which appears on the abacus of the Saranath Lion"
  },
  {
    "number": 2,
    "text": "Amitav Ghosh (a) Administrative skills C. The Argumentative 3. Anita Desai (b) Achievements in Scientific Research Indian (c) Achievements in Sports and Games D. Unaccustomed Earth 4. Jhumpa Lahiri (d) Courage and valour Codes: 144. In which State is the Buddhist site Tabo Monastery located? (a) A-4; B-1; C-2; D-3 (b) A-4; B-2; C-1; D-3",
    "year": "2009",
    "options": {
      "a": "Arunachal Pradesh",
      "b": "Himachal Pradesh",
      "c": "A-3; B-2; C-1; D-4",
      "d": "A-3; B-1; C-2; D-4"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  },
  {
    "number": 2,
    "text": "Madhubani, a traditional : Bihar 1. Ashok Leyland : Hinduja Group painting 2. Hindalco Industries : A.V. Birla Group 3. Singhey Khababs Sindhu : Jammu & 3. Suzlon Energy : Punj Lloyd Group Darshan Festival Kashmir Which of the pairs given above is/are correctly matched? Which of the pairs given above is/are correctly matched? (a) 1 and 2 only (b) 2 only",
    "year": "2009",
    "options": {
      "a": "1 and 2 only",
      "b": "3 only",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  },
  {
    "number": 146,
    "text": "Among the following, who are the Agaria community? (a) Prime Minister’s Office",
    "year": "2009",
    "options": {
      "a": "A traditional toddy tappers community of Andhra Pradesh",
      "b": "Cabinet Secretariat",
      "c": "Ministry of Power",
      "d": "Ministry of Science and Technology"
    },
    "answer": "d",
    "explanation": "The Agaria are a Muslim community found in the state is one of the Dwadasa jyotirlingas situated on the Mandhata of Gujarat in India. hills in Vindhya Mountains of Madhya Pradesh. Pushkar is"
  },
  {
    "number": 3,
    "text": "Newspaper establishments 1. The National School of Drama was set up by Sangeet 4. Private medical institutions Natak Akademi in 1959. The employees of which of the above can have the ‘Social 2. The highest honour conferred by the Sahitya Akademi Security’ coverage under Employees’ State Insurance Scheme? on a writer is by electing him its Fellow. Which of the (a) 1, 2 and 3 only (b) 4 only stateme",
    "year": "2009",
    "options": {
      "a": "Literature",
      "b": "Performing Arts"
    },
    "answer": "d",
    "explanation": "Anjali Vedpathak is related to Rifle Shooting, Mouma"
  },
  {
    "number": 2,
    "text": "Dancing on the brass plate by keeping the feet on its (c) Science (d) Social Service edges is a feature of Bharatanatyam but Kuchipudi dance does not have such a form of movements. 5337_DBE Indian Panorama G 29 Which of the statements given above is/are correct? 156. With reference to the cultural history of India, the term (a) 1 only (b) 2 only ‘Panchayatan’ refers to [2014G - I2]9 (c) Both 1 and",
    "year": "2015-I",
    "options": {
      "a": "1, 2 and 3 only",
      "b": "1, 3 and 4 only",
      "c": "2 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  },
  {
    "number": 1,
    "text": "Srisailam : Nallamala Hills (d) It is an ancient martial art and a living tradition in some 2. Omkareshwar : Satmala Hills parts of South India 3. Pushkar : Mahadeo Hills 153. Consider the following pairs : [2014 - I] Which of the above pairs is/are correctly matched? 1. Garba Gujarat (a) 1 only (b) 2 and 3 only 2. Mohiniattam Odisha (c) 1 and 3 only (d) 1, 2 and 3 3. Yakshagana Karnataka 161. Rec",
    "year": "2016-I",
    "options": {
      "a": "Arunachal Pradesh",
      "b": "Himachal Pradesh",
      "c": "1 and 3 only",
      "d": "1, 2 and 3 only"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 154,
    "text": "Consider the following statements : [2014 - I] (c) Karnataka (d) Maharashtra 1. ‘Bijak’ is a composition of the teachings of Saint Dadu 162. In which of the following regions of India are you most Dayal. likely to come across the ‘Great Indian Hornbill’ in its 2. The Philosophy of Pushti Marg was propounded by natural habitat?",
    "year": "2016-I",
    "options": {
      "a": "Sand deserts of northwest India Which of the statements given above is/are correct?",
      "b": "Higher Himalayas of Jammu and Kashmir",
      "c": "Salt marshes of western Gujarat",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "Statement 1 is wrong because Kabir founded a not the only instrument OR they're using drums instead of community – Kabirpnathi, who consider Bijak, a collection cymbals. In either interpretation- statement 2 is wrong. of his verses, as their scripture. Statement 2 is wrong because Hence answer \"B\" 1 and 3 only. Vallabhacharya’s philosophy came to be known as Ccrtindia.gov.in says Males dancers play Pung and Kartal Pushtimarga (the path of grace). during Manipuri Sankirtana.] in either case,#2 is"
  },
  {
    "number": 168,
    "text": "Siachen Glacier is situated to the",
    "year": "2020-I",
    "options": {
      "a": "East of Aksai Chin",
      "b": "East of Leh",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "2019: The Defence Minister announced the Siachen support for scouting, spawning, sustaining and scaling up area will be opened for tourists. It is situated to north of the grassroots innovations across the country. Nubra Valley so correct answer is (d) . 5337_DBE Sports & Games G 37 3 Sports & Games 1. In order to win the Grand Slam in Tennis, a player must win Codes: which one of the followings groups of tournaments? (a) A-3; B-5; C-4; D-2 (b) A-2; B- 4; C-1; D-3 [1999] (c) A-3; B-4; C-1; D-2 ("
  },
  {
    "number": 166,
    "text": "Consider the following Pairs :",
    "year": "2019-I",
    "options": {
      "c": "North of Gilgit",
      "d": "North of Nubra Valley Glacier: River HINTS & SOLUTIONS"
    },
    "answer": "c",
    "explanation": "Siachen Glacier, one of the world's longest mountain has a central shrine surrounded by four subsidiary shrines. glaciers, lying in the Karakoram Range system of Kashmir."
  },
  {
    "number": 1,
    "text": "(c) The lead character in the film “The Bandit Queen” has 8. (c) Austric group (Nishada) spoken by 1.38% of total been played by Seema Biswas. Indian population, this group includes mainly tribal 2. (b) The Nobel Prize for deciphering the language of bee languages and dialects of the central tribal belt, Khasi and was awarded to K.V. Frisch. Jaintia hills of Meghalaya and Nicobar island. 3. (c) In",
    "year": "1999",
    "options": {
      "a": "Australian Open, Wimbledon, French Open, U.S. Open",
      "c": "A-3; B-4; C-1; D-2",
      "d": "A-2; B-5; C-4; D-3"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 2,
    "text": "The Chess player Alexi Shirov represents:",
    "year": "2001",
    "options": {
      "a": "Albania",
      "b": "Kazhakstan A.Wally Grout"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  },
  {
    "number": 4,
    "text": "Football List-I (Sports women) List-II (Sport) 5. Basketball A. Anjali Vedpathak 1. Athletics Codes: B. Mouma Das 2. Gymnastics (a) A-3; B-5; C-2; D-4 (b) A-2; B-4; C-3; D-1 C. Neelam Singh 3. Rifle Shooting (c) A-3; B-4; C-2; D-1 (d) A-2; B-5; C-3; D-4 D. Tumpa Debnath 4. Table Tennis 10. In which Olympic Games did India last win a Gold Medal? 5. Chess",
    "year": "2006",
    "options": {
      "a": "A-3; B-4; C-2; D-3",
      "b": "A-4; B-3; C-1; D-2",
      "c": "A-4; B-3; C-2; D-5",
      "d": "A-4; B-1; C-3; D-2"
    },
    "answer": "c",
    "explanation": "Barry Richards was a famous batsman of South Africa, and World Cup that the two teams who played the opening Tex Dexter was hard hitting batsman of England, Alan match of the championship met again in the final. Greece Davidson was a renowned wicket keeper of Australia and have won their very first major title. Greece became the first Charlie Griffth was a fast bowler of West Indies. nation to win a major championship led by a foreign manager."
  },
  {
    "number": 2,
    "text": "West Indies (a) French Open – US Open – Wimbledon C. Alan Davidson 3. South Africa (b) French Open – Wimbledon – US Open D. Charlie Griffith 4. New Zealand (c) Wimbledon – US Open – French Open 5. Australia (d) Wimbledon – French Open – US Open Codes: 12. For which sport is the Val Barker Cup awarded in the Olympic (a) A-3; B-2; C-5; D-1 (b) A-5; B- 1; C-4; D-2 Games?",
    "year": "2006",
    "options": {
      "a": "Swimming",
      "b": "Boxing",
      "c": "A-3; B-1; C-5; D-2",
      "d": "A-5; B-2; C-4; D-1"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  },
  {
    "number": 5,
    "text": "The sports person Soma Biswas is associated with:",
    "year": "2003",
    "options": {
      "a": "sailing",
      "b": "hockey",
      "c": "Long Jump",
      "d": "High Jump"
    },
    "answer": "d",
    "explanation": "Soma Biswas is related to athletics. She is champion of This had never happened in 11 previous European women’s 200 m Race. Championships or 17 World Cups."
  },
  {
    "number": 13,
    "text": "Match List-I (Leading Woman Lawn Tennis Player) with (c) golf (d) athletics List-II (Country) and select the correct answer using the 6. Famous Golf player Vijay Singh is from which one of the codes given below the lists:",
    "year": "2006",
    "options": {
      "a": "Fiji",
      "c": "Malaysia",
      "d": "Kenya Tennis Player)"
    },
    "answer": "c",
    "explanation": "Correct match is as follows:"
  },
  {
    "number": 1,
    "text": "Badminton (a) India has never participated in the Olympic Football B. Ignace Tirkey 2. Swimming Tournament C. Pankaj Advani 3. Lawn Tennis (b) India played only in the First Round D. Rohan Bopanne 4. Snooker (c) India entered only up to the Quarter Finals 5. Hockey (d) India entered the Semi Final G 38 Topicwise Solved Papers 15. Which one of the following countries won the Euro Football 18. Who o",
    "year": "2009",
    "options": {
      "a": "Fernando Alonso",
      "b": "Kimi Raikkonen",
      "c": "Lewis Hamilton",
      "d": "NicolasAnelka"
    },
    "answer": "a",
    "explanation": "There are four grand slam tournaments in Tennis–"
  },
  {
    "number": 19,
    "text": "Among the following which one is not a football club? 16. Who among the following has been the Captain of the",
    "year": "2009",
    "options": {
      "a": "Arsenal",
      "b": "Aston Villa of times?",
      "c": "Chelsea",
      "d": "Monte Carlo"
    },
    "answer": "d",
    "explanation": "Monte Carlo officially refers to an administrative area Wally Grout -Test cricketer of the Principality of Monaco specifically the ward of Monte, Eusebio- Football where the Monte Carlo Casino is located. Rod Laver- Lawn Tennis"
  },
  {
    "number": 2,
    "text": "Akhil Kumar : Boxing (a) Barbora Spotakova : Javelin throw 3. Shiv Shankar Prasad Chowrasia : Golf (b) Pamela Jelimo : Weightlifting Which of the pairs given above is/are correctly matched? (c) Sanya Richards : Sprint",
    "year": "2009",
    "options": {
      "a": "1 and 2 only",
      "b": "2 and 3 only",
      "c": "3 only",
      "d": "Yelena Isinbayeva : Pole Vault"
    },
    "answer": "d",
    "explanation": "The chess player Alexi Shirov represents spain. He is Daniela Hantuchova – Slovakia remarked 4th in the world. Vishwanathan Anand Alexi Shirov Patty Schnyder – Switzerland in the final to become Wide World Chess Champion, Nadia Patrova – Russia organised in Tehran. A'melie – France"
  }
]