[
  {
    "number": 1,
    "text": "Which of the following constitute the World Bank?",
    "year": "1995",
    "options": {
      "a": "SAPTA",
      "b": "APEC"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Hamas : Palestinian extremist group A. Ringgit 1. Indonesia 2. Sinn Fein : I.R. A's political wing B. Baht 2. South Korea C. Rupiah 3. Thailand 3. True Path Party : A major constituent of the ruling D. Won 4. Malayasia coalition in Turkey Codes : Codes : (a) A-1; B-3; C-4; D-2 (b) A-4; B-3; C-1; D-2 (a) 1 and 2 (b) 1 and 3 (c) A-1; B-2; C-4; D-3 (d) A-4; B-2; C-1; D-3 (c) 1, 2 and 3 (d) 2 and 3 9.",
    "year": "1996",
    "options": {
      "a": "Texas in the USA",
      "b": "France",
      "c": "Russia",
      "d": "U.S.A"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 10,
    "text": "According to Meadows (1972), if the present trends in world (c) Quebec in Canada population, industrialisation, pollution, food production and (d) Maharashtra in India resource depletion continue unchanged, the “Limits to 4. Which of the following were the aims behind the setting up Growth” on our planet will be reached in the next:",
    "year": "1998",
    "options": {
      "a": "50 years",
      "b": "100 years"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Promotion of free trade and resource flows across (c) 150 years (d) 200 years countries 11. Which of the following pairs are correctly matched? 2. Protection of intellectual property rights 1. Dow Jones : New York 3. Managing balanced trade between different countries 2. Hang Seng : Seoul 4. Promotion of trade between the former East Bloc 3. FTSE-100 : London",
    "year": "1998",
    "options": {
      "a": "1, 2 and 3",
      "b": "2 and 3",
      "c": "1 and 2",
      "d": "1 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 5,
    "text": "The emerging trading blocs in the world, such as NAFTA, (a) Africa (b) Asia ASEAN and the like, are expected to :",
    "year": "1996",
    "options": {
      "a": "act as constrictions in free trade across the world",
      "c": "Latin America",
      "d": "South East Asia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 13,
    "text": "The economist who was associated with the WTO draft (b) promote free trade on the lines laid down by the WTO document is:",
    "year": "1998",
    "options": {
      "a": "A.K. Sen",
      "b": "T.N. Srinivasan countries",
      "c": "permit transfer of technology between member",
      "d": "Avinash Dixit"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 22,
    "text": "Falun Gong is :",
    "year": "2001",
    "options": {
      "a": "A- 2; B - 3; C - 4; D -1",
      "b": "A- 2; B - 3; C - 1; D -4",
      "c": "A- 3; B - 2; C - 4; D -1",
      "d": "A- 3; B - 2; C - 1; D -4"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 4,
    "text": "October 3 (a) Sudan (b) Yugoslavia 5. December 10 (c) U.A.E (d) Tunisia Codes: 17. Which one of the following statements is correct?",
    "year": "1999",
    "options": {
      "a": "A-2; B-1; C-4; D-5",
      "b": "A-1; B-2; C-4; D-3 Indian Republic from the French",
      "c": "A-1; B-2; C-3; D-4",
      "d": "A-2; B-1; C-4; D-3 to Sri Lankan and Bangladesh sovereignty respectively"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "China transferred to India by less arrangements with Sri Lanka B. Dyak 2. India and Pakistan respectively C. Dinka 3. Indonesia 18. Which one of the following is known as the \"Coffee port\" D. Uighur 4. Sudan of the world?",
    "year": "2000",
    "options": {
      "a": "Sao Paulo",
      "b": "Santos",
      "c": "Rio de Janeiro",
      "d": "Buenos Aires"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 38,
    "text": "Consider the following statements:",
    "year": "2004",
    "options": {
      "a": "Bhutan",
      "b": "Malaysia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 4,
    "text": "In 1991, Slovenia declared independence from (a) Iceland (b) India Czechoslovakia (c) New Zealand (d) U.S.A Which of the statements given above are correct? 33. Consider the following international language:",
    "year": "2004",
    "options": {
      "a": "1 and 2",
      "b": "1, 2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Berne 1. The Constitution of the United States of America came Industrial Development into force in year 1810. Organization (UNIDO) 2. All revenue bills must originate in the House of D. Universal Postal 4. New York Representative of the US Congress. Union (UPU) 3. George W. Bush is the only President in the history of Codes: the United States of America. Whose father was also (a) A-2; B-3; C-4; D",
    "year": "2004",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "1 and 2",
      "d": "2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "The name of the upper house in the Russian Parliament (a) Seikan Rail Tunnel : China is state Duma. (b) Petronas Towers : Malaysia Which of the statements given above is/are correct? (c) Appalachian Trai : USA (a) 1, 2 and 3 (b) 1 and 2 (d) Rogum Dam : Tajikistan (c) 2 and 3 (d) 1 only 51. For which one of the following countries is Spanish not an 43. Match items in the List-I (country) with those",
    "year": "2005",
    "options": {
      "a": "Chile",
      "b": "Colombia the codes given below the lists:",
      "c": "Republic of Congo",
      "d": "Cuba List-I List-II"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Diet (b) Peasant communist leader of China. B. Ukraine 2. States General (c) A naval ship on yoyage to Canada. C. Poland 3. Supreme Council (d) A Chinese village where Mao Tse lung began his long D. Japan 4. Sejm march. Codes: 53. Which one of the following pairs is not correctly matched ? (a) A-4, B-1, C-2, D-3 (b) A-2, B-3, C-4, D-1",
    "year": "2005",
    "options": {
      "c": "A-4, B-3, C-2, D-1",
      "d": "A-2, B-1, C-4, D-3 British Prime Political Party"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "The winner of the man Booker Prize in year 2004 is a (a) Pretoria (b) Dutban South Asian. (c) Johannesburg (d) Cape Town Which of the statement given above is/are correct? 55. Which one of the following pairs is not correctly matched? (a) 1 only (b) 1 and 3",
    "year": "2006",
    "options": {
      "a": "Slovenia Bratislava",
      "c": "2 and 3",
      "d": "1, 2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "The Trusteeship Council of the United Nations (a) Fire safety code in buildings Organization was established to manage the affairs of (b) Earthquake-resistant building code territories detached from Japan Italy after the second (c) Bar code World War or such territories not under the control of (d) Against adulteration in eatables a country at that time. 57. What is the new administrative capital ",
    "year": "2006",
    "options": {
      "a": "1, 2 and 3",
      "b": "2 only",
      "c": "2 and 3",
      "d": "3 only"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 59,
    "text": "Consider the following statements:",
    "year": "2006",
    "options": {
      "a": "Thailand",
      "b": "Egypt"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The Nobel Prize Awarding Ceremony takes place on (c) Indonesia (d) Philippines December 10, of every year. 48. In which one of the following countries, is Tamil a major 2. The Nobel Prize for Literature was added later on to language?",
    "year": "2005",
    "options": {
      "a": "Myanmar",
      "b": "Indonesia or Medicine, Peace and Economics.",
      "c": "Mauritius"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 49,
    "text": "Which one of the following cities is not a former capital of (a) 1 only (b) 2 only the given country (Country given in the brackets)?",
    "year": "2005",
    "options": {
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2 5337_DBE World Panorama G 5"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 60,
    "text": "In which one of the following films did the Nobel Laureate 69. Where is Davos, the venue of the annual meeting of World Pearl S. Buck collaborate?",
    "year": "2006",
    "options": {
      "a": "Shatranj Ke Khilari",
      "b": "Guide",
      "c": "Lawrence of Arabia",
      "d": "Titanic"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The Richter scale is a logarithmic scale and so an (a) Veer Savarkar increase of 1 magnitude unit represents a factor of 10 (b) Annie Besant times in amplitude. (c) Ramkrishan Paramhansa 2. Each integer reading of the Richter scale has an energy (d) Swami Vivekanand 100 times that the previous integer reading. 62. Who among the following wrote ‘The Communist Which of the statement(s) given above i",
    "year": "2006",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 71,
    "text": "Which one of the following countries is not a member of the 63. Who is Wole Soyinka?",
    "year": "2006",
    "options": {
      "a": "A well-known economist.",
      "b": "A well-known football player.",
      "c": "A well-known industrialist owning steel plants in many",
      "d": "United Kingdom"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 72,
    "text": "Which one of the following countries is not a member of the 64. Which one of the following pairs is not correctly matched? Commonwealth of Independent States (CIS)?",
    "year": "2006",
    "options": {
      "a": "Armenia",
      "b": "Belarus Well-known Company Major area of Work",
      "c": "Estonia",
      "d": "Georgia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 73,
    "text": "Which one of the following countries is not a member of (b) Sasken Communication ASEAN?",
    "year": "2006",
    "options": {
      "a": "Vietnam",
      "b": "Brunei Darussalam",
      "c": "Genpact Power generation",
      "d": "Myanmar"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "V P Singh 2. R Venkataraman (c) Milton Friedman Economics 3. Y B Chavan 4. Pranab Mukherjee (d) Eric R. Kandel Literature Select the correct answer using the code given below: 67. Which one among the following was the first to legalize (a) 1, 2 and 3 only (b) 1, 3 and 4 only Euthanasia?",
    "year": "2006",
    "options": {
      "a": "Austria",
      "b": "Switzerland",
      "c": "2 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 76,
    "text": "Consider the following statements:",
    "year": "2007",
    "options": {
      "c": "Netherlands",
      "d": "Canada"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "NAM Summit : Havana (a) Max Planck (b) Albert Einstein 2. APEC Meeting : Bangkok (c) William Henry Bragg (d) Enrico Fermi 3. EU - India Summit : Helsinki 89. Which of the following pairs in respect of current power 4. UN Climate Change : Geneva generation in India is/are correctly matched?",
    "year": "2008",
    "options": {
      "a": "1 only",
      "b": "1 and 3 only"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Installed electricity : 100000 MW (c) 1, 2 and 3 (d) 2, 3 and 4 Generation capacity 79. Who among the following is Chile’s first woman President? 2. Electricity generation: 660 billion kWh",
    "year": "2007",
    "options": {
      "a": "D Ortega",
      "b": "M Bachelet Codes :",
      "c": "E Morales",
      "d": "A Garcia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Wind energy List-I (Person) List-II (Area) B. AT & T 2. Oil A. Sabyasachi 1. Microfinance loans C. AMD 3. Telephone, internet Mukherjee D. Enercon GmbH 4. Microprocessor B. Aniruddha Bahal 2. Pharmaceuticals Codes: C. Vikram Akula 3. Fashion designing (a) A-2; B-1; C-4; D-3 (b) A-4; B-3; C-2; D-1 D. Yusuf Hamied 4. Investigative journalism (c) A-2; B-3; C-4; D-1 (d) A-4; B-1; C-2; D-3 Codes: 81. W",
    "year": "2007",
    "options": {
      "a": "William Dickson : Motion Picture film",
      "c": "A-1; B-4; C-3; D-2",
      "d": "A-3; B-2; C-1; D-4"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 91,
    "text": "Ogaden region has been a source of conflict between which (b)Charles Babbage : Programmable Computer countries?",
    "year": "2008",
    "options": {
      "a": "Morocco and Algeria",
      "b": "Nigeria and Cameroon",
      "c": "Nicholas Stem : Construction technology",
      "d": "Brian Greene : String theory"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 82,
    "text": "Yom Kippur War was fought between which sides countries? (c) Angola and Zambia",
    "year": "2008",
    "options": {
      "a": "Turkey and Greece",
      "d": "Ethiopia and Somalia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "China (a) Edward Kasner (b) Bill Gates D. The Mossad 4. Russia (c) Tim Berners-Lee (d) Vinod Dham Codes: 84. Where are the headquarters of the Organization of the (a) A-4; B-1; C-2; D-3 (b) A-2; B-3; C-4; D-1 Islamic Conference (OIC) located?",
    "year": "2007",
    "options": {
      "a": "Dubai",
      "b": "Jeddah",
      "c": "A-4; B-3; C-2; D-1",
      "d": "A-2; B-1; C-4; D-3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 85,
    "text": "How is Gabriel Garcia Marquez well-known as (a) United States of America (a) Known for research in agriculture",
    "year": "2007",
    "options": {
      "b": "Mexico",
      "c": "Australia",
      "d": "New Zealand"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 94,
    "text": "Match List-I with List-II and select the correct answer using Which of the above pairs is/are correctly matched? the code given below the Lists:",
    "year": "2008",
    "options": {
      "a": "1 and 2 only",
      "b": "2 only List-I List-II",
      "c": "2 and 3 only"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The Economic and Social Council (ECOSOC) of UN A. Amnesty International 1. Viskuli consists of 24 member States. B. Commonwealth of 2. Paris 2. It is elected by a 2/3rd majority of the General Assembly Independent States for a 3-year term. (CIS) Which of the statements given above is/are correct? C. Danube Commission 3. Peter Benenson (a) 1 only (b) 2 only D. Europe Space Agency 4. Belgrade Conven",
    "year": "2009",
    "options": {
      "a": "Eritrea and Sudan",
      "b": "Ethiopia and Somalia",
      "c": "A-3; B-2; C-4; D-1",
      "d": "A-4; B-1; C-3; D-2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 95,
    "text": "How much is one barrel of oil approximately equal to",
    "year": "2008",
    "options": {
      "c": "Kenya and Somalia",
      "d": "Ethiopia and Sudan"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 105,
    "text": "Consider the following countries:",
    "year": "2009",
    "options": {
      "a": "131 litres",
      "b": "159 1itres"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Brunei Darussalam 2. East Timor (c) 257 litres (d) 321 litres 3. Laos 96. Which of the following pairs is/are correctly matched? Which of the above is/are member/members of ASEAN? 1. Francis Collins : Mapping human genome (a) 1 only (b) 2 and 3 only 2. Sergey Brin : Google Search Engine (c) 1 and 3 only (d) 1, 2 and 3 3. Jimmy Wales : Wikipedia 106. Other than Venezuela, which one among the follow",
    "year": "2009",
    "options": {
      "a": "Argentina",
      "b": "Brazil Codes:",
      "c": "Ecuador",
      "d": "Bolivia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 107,
    "text": "Consider the following pairs:",
    "year": "2009",
    "options": {
      "c": "3 only",
      "d": "1, 2 and 3 Large Bank Country of Origin"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Barclays Bank : UK (a) Klaus Schwab (b) John Kenneth Galbraith 3. Kookmin Bank : Japan (c) Robert Zoellick (d) Paul Krugman Which of the above pairs is/are correctly matched? 98. Consider the following pairs:",
    "year": "2009",
    "options": {
      "a": "1 only",
      "b": "2 only Famous place Country",
      "c": "1 and 2",
      "d": "2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Davos : Denmark Automobile Headquarters 3. Roland Garros : The Netherlands Manufacturer Which of the pairs given above is/are correctly matched? 1. BMW AG : USA (a) 1 only (b) 1 and 2 only 2. Daimler AG : Sweden (c) 2 and 3 only (d) 1, 2 and 3 3. Renault S.A. : France 99. Who of the following is the author of the book “The 4. Volkswagen AG : Germany Audacity of Hope”?",
    "year": "2009",
    "options": {
      "a": "Al Gore",
      "b": "Barack Obama",
      "c": "Bill Clinton",
      "d": "Hillary Clinton"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 100,
    "text": "A present group of nations known as G-8 started first as 109. The Security Council of UN consists of 5 permanent G-7. Which one among the following was not one of them? members, and the remaining 10 members are elected by the",
    "year": "2009",
    "options": {
      "a": "Canada",
      "b": "Italy",
      "c": "Japan",
      "d": "Russia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Switzerland 2. Malta 1. Brazil 2. Mexico 3. Bulgaria 3. South Africa Which of the above are members of European Union? According to UNCTAD, which of the above is/are (a) 1 and 2 only (b) 2 and 3 only categorized as “Emerging Economies”? (c) 1 and 3 only (d) 1, 2 and 3 (a) 1 only (b) 1 and 3 only 102. Consider the following pairs:",
    "year": "2009",
    "options": {
      "c": "2 and 3 only",
      "d": "1, 2 and 3 Organization Location of"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The Commonwealth has no charter, treaty or constitution. Weapons, commonly known as Nuclear Non-Proliferation 2. AU the territories/countries once under the British Treaty (NPT)? empire (jurisdiction/ rule/mandate) automatically joined (a) 1 and 2 only (b) 1, 3, 4 and 5 only the Commonwealth as its members. (c) 2, 4 and 5 only (d) 1, 2, 3, 4 and 5 Which of the statements given above is/are correct",
    "year": "2015-I",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2 civil wars"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 116,
    "text": "A “closed economy’’ is an economy in which ? [2011 - I] (a) agency created by EU to deal with the impact of (a) The money supply is fully controlled. millions of refugees arriving from Middle East (b) Deficit financing takes place. (b) agency of EU that provides financial assistance to (c) Only exports take place. eurozone countries (d) Neither exports nor imports take place. (c) agency of EU to d",
    "year": "2016-I",
    "options": {
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 118,
    "text": "Regarding the International Monetary Fund, which one of 126. In the context of which of the following do you sometimes the following statements is correct ? [2011 - I] find the terms ‘amber box, blue box and green box’ in the (a) It can grant loans to any country news?",
    "year": "2016-I",
    "options": {
      "a": "WTO affairs",
      "b": "It can grant loans to only developed countries",
      "c": "It grants loans to only member countries",
      "d": "It can grant loans to the central bank of a country"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Russian Federation (a) Ruble (b) Rand 4. United Kingdom (c) Indian Rupee (d) Renminbi 5337_DBE World Panorama G 9 128. With reference to ‘IFC Masala Bonds’, sometimes seen in 136. ‘Belt and Road Initiative’ is sometimes mentioned in the the news, which of the statements given below is/are news in the context of the affairs of",
    "year": "2016-I",
    "options": {
      "a": "African Union",
      "b": "Brazil"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "New Development Bank has been set up by APEC. (a) 1 and 2 (b) 2 only 2. The headquarters of New Development Bank is in (c) 2 and 3 (d) 3 only Shanghai. 138. With reference to ‘Organization for the Prohibition of Which of the statements given above is/are correct? Chemical Weapons (OPCW)’, consider the following (a) 1 only (b) 2 only statements :",
    "year": "2016-I",
    "options": {
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Under nourishment 2. Child stunting Select the correct answer using the code given below: 3. Child mortality (a) 1, 2 and 3 (b) 1 and 3 only Select the correct answer using the code given below. (c) 2 and 3 only (d) 1 only (a) 1 only (b) 2 and 3 only 140. The Global Infrastructure Facility is a/an",
    "year": "2017-I",
    "options": {
      "a": "ASEAN initiative to upgrade infrastructure in Asia and",
      "c": "1, 2 and 3",
      "d": "1 and 3 only"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "held in 2015 was the third such Summit preparation and structuring of complex infrastructure 2. was actually initiated by Jawaharlal Nehru in 1951 Public-Private Partnerships (PPPs) to enable Which of the statements given above is/are correct? mobilization of private sector and institutional investor (a) 1 only (b) 2 only capital. (c) Both 1 and 2 (d) Neither 1 nor 2 (c) Collaboration among the ma",
    "year": "2016-I",
    "options": {
      "a": "a division of World Health Organization mobilize private investment.",
      "b": "a non-governmental international organization",
      "c": "an inter-governmental agency sponsored by facilitate infrastructure development in the world. European Union",
      "d": "UNCTAD funded initiative that seeks to finance and"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 135,
    "text": "Which of the following is not a member of ‘Gulf (a) World Economic Forum Cooperation Council’?",
    "year": "2016-I",
    "options": {
      "a": "Iran",
      "b": "UN Human Rights Council",
      "c": "UN Women",
      "d": "Kuwait"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Inaugural IONS was held in India in 2015 under the (a) An Israeli radar system chairmanship of the Indian Navy. (b) India's indigenous anti-missile Programme 2. IONS is a voluntary initiative that seeks to increase (c) An American anti missile system maritime co-operation among navies of the littoral states (d) A defence collaboration between Japan and South of the Indian Ocean Region. Korea Which",
    "year": "2018-I",
    "options": {
      "a": "The Earth Summit on Sustainable Development 2002,",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Most of the world's coral reefs are in tropical waters. (d) Neither 1 nor 2 2. More than one-third of the world's coral reefs are 144. Very recently, in which of the following countries have lakhs located in the territories of Australia, Indonesia and of people either suffered from severe famine/acute Philippines. malnutrition or died due to starvation caused by war/ethnic 3. Coral reefs host far ",
    "year": "2018-I",
    "options": {
      "a": "Angola and Zambia Which of the statements given above is/are correct ?",
      "b": "Morocco and Tunisia",
      "c": "Venezuela and Colombia",
      "d": "Yemen and South Sudan"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 145,
    "text": "The term \"two-state solution\" is sometimes mentioned in 152. \"Momentum for Change : Climate Neutral Now\" is an the news in the context of the affairs of",
    "year": "2018-I",
    "options": {
      "a": "China",
      "b": "Israel",
      "c": "Iraq",
      "d": "Yemen"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 146,
    "text": "International Labour Organization's Conventions 138 and (c) The UNFCCC Secretariat 182 are related to",
    "year": "2018-I",
    "options": {
      "a": "Child labour",
      "d": "The World Meteorological Organisation"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "AIIB has more than 80 member nations. (c) Regulation of food prices and food security 2. India is the largest shareholder in AIIB. (d) Gender parity at the workplace 3. AIIB does not have any members from outside Asia. 147. With reference to the 'Global Alliance for Climate Smart Which of the statements given above is/are correct? Agriculture (GACSA)', which of the following statements (a) 1 only ",
    "year": "2018-I",
    "options": {
      "c": "1 and 3 only",
      "d": "1, 2 and 3 only"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Membership of GACSA does not create any binding (a) Maintenance of law and order obligations. (b) Paying taxes 3. India was instrumental in the creation of GACS(A) (c) Registering property Select the correct answer using the code given (d) Dealing with construction permits (a) 1 and 3 only (b) 2 only 155. Consider the following statements:",
    "year": "2019-I",
    "options": {
      "c": "2 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Aleppo: Syria 2. The UNCAC is the ever-first legally binding global 2. Kirkuk: Yemen anti-corruption instrument. 3. Mosul: Palestine 3. A highlight of the United Nations Convention against 4. Mazar -i- Sharif: Afghanistan Transnational organized Crime (UNTOC) is the Which of the pairs given above are correctly matched? inclusion of a specific chapter aimed at returning assets (a) 1 and 2 (b) 1 and",
    "year": "2020-I",
    "options": {
      "a": "Argentina, Mexico, South Africa and Turkey",
      "c": "2 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 156,
    "text": "“Gold Tranche” (Reserve Tranche) refers to",
    "year": "2020-I",
    "options": {
      "a": "A loan system of the World bank",
      "b": "Australia, Canada, Malaysia and New Zealand",
      "c": "Brazil, Saudi Arabia and Vietnam",
      "d": "Indonesia, Japan, Singapore and South Korea"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Thames — Irish Sea 1. Alma-Ata Declaration : Healthcare of the people 3. Volga — Caspian Sea 2. Hague Convention : Biological and chemical 4. Zambezi — Indian Ocean weapons Which of the pairs given above is/are correctly matched? 3. Talanoa Dialogue : Global climate change (a) 1 and 2 only (b) 3 only 4. Under2 Coalition : Child rights (c) 3 and 4 only (d) 1, 2 and 4 only HINTS & SOLUTIONS 1. (a) T",
    "year": "1995",
    "options": {
      "a": "Pratiba Sinha",
      "b": "Rupa Ganguly",
      "c": "Seema Biswas",
      "d": "Shabana Azmi"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "The Nobel Prize for deciphering the language of bee was awarded to:",
    "year": "1995",
    "options": {
      "a": "H.G. Khurana",
      "b": "K.V. Frisch",
      "c": "Juliane Huxley",
      "d": "Dorothy Hodgkins"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "In which one of the following States of India it is legal for a Hindu male and illegal for a Muslims male to have more than one living wife?",
    "year": "1995",
    "options": {
      "a": "Nagaland",
      "b": "Mizoram",
      "c": "Goa",
      "d": "Arunachal Pradesh"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 4,
    "text": "Which one of the following pairs is correctly matched? A. Central Drug Research Institute",
    "year": "1996",
    "options": {
      "a": "Naqqual–Bihar",
      "b": "Tamasha–Orissa C. National Institute of Ocean Technology",
      "c": "Ankia Nat– Assam",
      "d": "Baha–Punjab D. Temperate Forest Research Centre"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 5,
    "text": "Which one of the following dances involves solo Select the correct answer using the codes given below performance?",
    "year": "1997",
    "options": {
      "a": "Bharatanatyam",
      "b": "Kuchipudi",
      "c": "Mohiniattam",
      "d": "Odissi"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 6,
    "text": "Match List-I with List-II and select the correct answer using (a) rich in proteins (b) pure and unadulterated the codes given below the lists:",
    "year": "1997",
    "options": {
      "c": "environment friendly",
      "d": "economically viable List-I List-II"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Education for (a) Jim Lake : Highest number of wickets in a Cricket Test Yojana women's equality Match C. Indira Mahila 3. Promotion of savings (b) Brian Lara : Highest score in an inning in Test Cricket Yojana among rural women (c) Sanath Jayasurya and Roshan Mahanama : Highest D. Mahila Samakhya 4. Meeting credit needs partnership in an innings in Test Cricket Programme of the poor women (d) Sun",
    "year": "1999",
    "options": {
      "b": "A – 1; B – 3; C – 4; D – 2 List-I List-II",
      "c": "A – 4; B – 3; C – 2; D – 1 A. Pandit Vishnu"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Proponent of Carnatic (b) list system of election to the Lok Sabha music (c) Governmental funding of parliament elections C. Shyama Shastri 3. Proponent of the (d) a ban on the candidature of independent candidates Khayal form of of the parliamentary elections Hindustani music 8. Which one of the following languages belongs to the D. Amir Khusrau 4. Wrote the music for Austric group?",
    "year": "1998",
    "options": {
      "a": "Marathi",
      "b": "Ladakhi Codes:",
      "c": "Khasi",
      "d": "Tamil"
    },
    "answer": null,
    "explanation": ""
  }
]