[
  {
    "number": 1,
    "text": "Uruguay B. Alberto Fujimori 2. Brazil C. Julio Maria Sanguinetti 3. Mexico D. Fermando H. Cardoso 4. Bolivia 5. Peru Codes: (a) A-3; B-5; C-1; D-2 (b) A-4; B-5; C-3; D-1 (c) A-3; B-4; C-4; D-2 (d) A-5; B-3; C-1; D-4 The behaviour of a fictitious stock market index [comprising 2. Which one of the following countries had in 1994 voted a weight average of the market prices of a selected list of again",
    "year": "1995",
    "options": {
      "a": "Norway",
      "b": "Sweden over a 15 day period is shown in the graph. The behaviour of",
      "c": "Finland",
      "d": "Austria the MNC’s in the same period is also shown in the second graph."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Comet shoemaker-Levy 9 hit the planet:",
    "year": "1995",
    "options": {
      "a": "Pluto",
      "b": "Mars",
      "c": "Jupiter",
      "d": "Saturn"
    },
    "answer": "a",
    "explanation": "more than 70% Reason (R) : For the first time, India’s exports crossed worth (b) between 60% and 70% $ 50 billion in the year 2002-03. [2004] (c) between 50% and 60% (a) Both A and R are individually true and R is the correct (d) less than 50% explanation of A 52. Which one of the following statements is correct with (b) Both A and R are individually true but R is not the reference to FEMA in India? [2003] correct explanation of A (a) The Foreign Exchange Regulating Act (FERA) was (c) A is true "
  },
  {
    "number": 4,
    "text": "The signatories to the treaty banning chemical weapons over 5% on the 12th day include:",
    "year": "1995",
    "options": {
      "a": "USA Russia, India, Iran and Israel on the 11th day",
      "b": "Iraq, Libya, India, Russia and China",
      "c": "Government announced a policy disfavouring MNC’s",
      "d": "Whatever be the reason favouring market revival on the 12th day, it appears to be relevant only to non-"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 11,
    "text": "Bishop Carlos Felipe Ximenes Belo and Jos Remos Horta 5. The Prime Minister of which one of the following countries who shared the 1996 Nobel Peace Prize are known for their is chosen by the ruling prince from a state of three work for the cause of:",
    "year": "1997",
    "options": {
      "a": "East Timor",
      "b": "Gautemala",
      "c": "Bosnia",
      "d": "Burundi"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 12,
    "text": "Which one of the following countries had more or less 6. The world’s fastest computer has been able to perform (as evolved into a two-party system?",
    "year": "1996",
    "options": {
      "a": "Sri Lanka",
      "b": "Bangladesh",
      "c": "Pakistan",
      "d": "Myanmar"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 7,
    "text": "The Basque separatist organization is active in:",
    "year": "1997",
    "options": {
      "a": "France",
      "b": "Germany",
      "c": "Italy",
      "d": "Portugal"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 14,
    "text": "Proportional representation is not necessary in a country 8. The film ‘The Making of the Mahatama’ has been directed where:",
    "year": "1997",
    "options": {
      "a": "there are no reserved constituencies",
      "b": "Richard Attenborough",
      "c": "Shyam Benegal",
      "d": "Mira Nair"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 9,
    "text": "A major health mission carried out in 1996 was:",
    "year": "1997",
    "options": {
      "a": "war against leprosy of government",
      "b": "small-pox eradication",
      "d": "there is a fusion of presidential and parliamentary forms"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 15,
    "text": "In which one of the following countries are 75 percent of seats in both Houses of Parliament filled on the basis of (c) pulse polio immunization first past-the post system and 25 percent on the basis of (d) popularisation of oral rehydration theraphy Proportional Representation system of elections?",
    "year": "1997",
    "options": {
      "a": "Germany",
      "b": "Italy"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1999,
    "text": "But the currencies of two countries, franc, have already the same value and circulate freely in both the countries. The countries are:",
    "year": "1997",
    "options": {
      "a": "France and Switzerland",
      "b": "Switzerland and Luxemburg",
      "c": "Luxemburg and Belgium",
      "d": "France and Belgium"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 17,
    "text": "The meeting of G-15 countries held in Malaysia in 1997 was attended by:",
    "year": "1998",
    "options": {
      "a": "14 member countries",
      "b": "15 members countries",
      "c": "16 member countries",
      "d": "17 member countries"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 18,
    "text": "According to the World Development Report, low income economics are those for which the per capita GNP in 1994 was:",
    "year": "1998",
    "options": {
      "a": "US $ 925 or less",
      "b": "US $ 825 or less Contentious Issues",
      "c": "US $ 725 or less",
      "d": "US $ 525 or less"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Sharing river water (a) Canada (b) Japan Match the issue with the areas marked in the map as A, B (c) Sweden (d) Zimbabwe and C and select the correct answer using the codes given 20. Nobel Prize in Economics for the year 1997 was awarded for below: contribution in the area of:",
    "year": "1998",
    "options": {
      "a": "International Economics",
      "b": "A-2; B- 3; C-1",
      "c": "A-1; B-3; C-2",
      "d": "A-3; B-2; C-1"
    },
    "answer": "a",
    "explanation": "more than 70% Reason (R) : For the first time, India’s exports crossed worth (b) between 60% and 70% $ 50 billion in the year 2002-03. [2004] (c) between 50% and 60% (a) Both A and R are individually true and R is the correct (d) less than 50% explanation of A 52. Which one of the following statements is correct with (b) Both A and R are individually true but R is not the reference to FEMA in India? [2003] correct explanation of A (a) The Foreign Exchange Regulating Act (FERA) was (c) A is true "
  },
  {
    "number": 27,
    "text": "Which one of the countries labelled as 1, 2, 3 and 4 on the (d) Development Economics given may was granted membership of G-15 in its VII Summit 21. The currency of the proposed European Monetary Union at Kuala lumpur?",
    "year": "1999",
    "options": {
      "a": "Dollar",
      "b": "Euro",
      "c": "Guilder",
      "d": "Mark"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 22,
    "text": "Assertion (A) : The United States of America has threatened to ask the World Trade Organisation (WTO) to apply sanctions against the developing countries for the non- observance of ILO convention. Reason (R) : The United States of America itself has adopted and implemented those ILO conventions.",
    "year": "1998",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is NOT a correct explanation of A",
      "c": "A is true both R is false",
      "d": "A is false but R is true"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 28,
    "text": "Match the international events listed below with their (a) Stockholm (b) Riodejaneiro respective places labelled as 1, 2, 3, 4 and 5 in the given map (c) Paris (d) Kyoto and select the correct answer using the codes given below 24. The number of economically active women (excluding the list.",
    "year": "2000",
    "options": {
      "a": "USA",
      "b": "China",
      "c": "Russia",
      "d": "S. Korea"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 25,
    "text": "The economic crisis in the later half of 1990s most seriously affected Indonesia, Thailand, Malaysia and South Korea. The cause of the crisis was:",
    "year": "1999",
    "options": {
      "a": "mismanagement of the financial resources and financial sector, in general",
      "b": "the prolonged over-valuation of local currencies vis-vis the western currencies",
      "c": "the downswing and recession in the western economies which earlier provided export market oriented countries International Events :",
      "d": "none of these A. Venue of Commonwealth Conference held in 1999 5337_DBE International H 3 B. Venue of World Trade Organisation meeting held in"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 29,
    "text": "The best performance in terms of Human Development (a) to side with the Tutsi tribe in the country’s civil war among Asian countries is by :",
    "year": "2000",
    "options": {
      "a": "China",
      "b": "to side with the Hutu tribe in the on going ethnic conflict",
      "c": "as a part of United Nations special force to keep control",
      "d": "Philippines on the ethnic groups revolting against the government"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 39,
    "text": "Berber speaking community, frequently in the news, lives (a) USA (b) Singapore in:",
    "year": "2002",
    "options": {
      "a": "Afghanistan",
      "b": "Algeria",
      "c": "Hong Kong",
      "d": "France"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Angola 2. Colombia 3. Congo 4. Sudan Which of these countries has/have been suffering from civil war? (a) 1 only (b) 2 and 3 (c) 4 only (d) 1, 2, 3 and 4 41. The Asia-Pacific Economic Co-operation Forum was held in the year 2001 in:",
    "year": "2002",
    "options": {
      "a": "Bangkok",
      "b": "Hongkong",
      "c": "Jakarta",
      "d": "Shanghai"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 42,
    "text": "In the year 2001, India offered a grant of five million dollars to Tajikistan to:",
    "year": "2002",
    "options": {
      "a": "A",
      "b": "B",
      "c": "C",
      "d": "D"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 32,
    "text": "Resurgent Indian Bonds were issued in US dollar, Pound (c) promote mineral exploration Sterling and:",
    "year": "2000",
    "options": {
      "a": "Japanese Yen",
      "b": "Deutsche Mark",
      "d": "procure defence equipment"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 33,
    "text": "The theme of the World Development Report 2001is: (a) AIDS control (b) global terrorism (a) from plan to market",
    "year": "2001",
    "options": {
      "b": "knowledge for development",
      "c": "human rights",
      "d": "sustainable development"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 34,
    "text": "Which one among the following countries has the lowest A. Congo 1. Levy Mwanawasa GDP per capita?",
    "year": "2003",
    "options": {
      "a": "China",
      "b": "India B. Nigeria"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Vicente Fox (a) Mars Climate Orbiter (b) Mars Global Surveryer B. Philippines 2. Hugo Chavez (c) Mars Odyssey (d) Mars Polar Lander C. Mexico 3. Gloria Macapagal Arroya 46. The main reason for unrest and violence in Zimbabwe in D. Venezuela 4. Andres Pastrana recent years is due to:",
    "year": "2002",
    "options": {
      "a": "conflict between different native ethnic groups",
      "b": "A-3; B-4; C-2; D-1",
      "c": "A-4; B-3; C-1; D-2",
      "d": "A-3; B-4; C-1; D-2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Archbishop Desmond Tutu European settlers and native black community H 4 Topicwise Solved Papers 47. The Basque people who are frequently in the news for their 56. The research work of Paul Lauterbur and Peter Mansfield, separatist activity live in :",
    "year": "2003",
    "options": {
      "a": "France",
      "b": "Italy",
      "c": "Portugal",
      "d": "Spain"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 57,
    "text": "In 2003, Alison Richard took over as the first ever women (a) Ethnic conflict between the native Red Indian tribes Vice-Chancellor of :",
    "year": "2004",
    "options": {
      "a": "Oxford University",
      "b": "Cambridge University",
      "c": "Harward University",
      "d": "Purdue University"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 58,
    "text": "George W. Bush, thc President of America, comes from instruction in schools which of the following American States?",
    "year": "2004",
    "options": {
      "a": "California",
      "b": "Texas groups",
      "c": "Virginia",
      "d": "Clashes between government troops and secessionist"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 49,
    "text": "As per the Human Development Index given by UNDP, 59. Which of the following authors won the Booker Prize twice? which one of the following sequences of South Asian",
    "year": "2004",
    "options": {
      "a": "Margaret Atwood",
      "b": "J.M. Coetzee development?",
      "c": "Graham Swift",
      "d": "Ian McEwan"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 60,
    "text": "Shirin Ebadi, who won the Nobel Peace Prize in 2003, is (b) Maldives–Sri Lanka–India–Pakistan from:",
    "year": "2004",
    "options": {
      "a": "Iraq",
      "b": "Nigeria",
      "c": "Sri Lanka–Maldives–India–Pakistan",
      "d": "Maldives–India–Pakistan–Sri Lanka"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 50,
    "text": "Which one of the following cities (they were in the news in (c) Iran (d) Libya recent times) is not correctly matched with its country? 61. Where has world’s largest ever meet on HIV AIDS held in",
    "year": "2004",
    "options": {
      "a": "Salamanca : Spain",
      "b": "Singapore",
      "c": "New York",
      "d": "Rome"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 63,
    "text": "In which one of the following countries did hundreds of (a) Democratic Republic of Congo people die in year 2004 as a result of flooding and mudslides (b) Indonesia triggered by Tropical Storm Jeanne?",
    "year": "2005",
    "options": {
      "a": "Columbia",
      "b": "Haiti",
      "c": "Nigeria.",
      "d": "Zambia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 52,
    "text": "Serbia was in the international news in the recent times for: 64. Where do the Sahariya tribals, who were recently in the",
    "year": "2004",
    "options": {
      "a": "harbouring terrorists associated with relegious",
      "b": "Assam fundamentalism",
      "c": "Rajasthan",
      "d": "Orissa"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Nobel Prize Winner for (b) separatist rebellious activities by the local people literature (c) continuous conflict between the government troops C. Dicky Dolma 3. Leading campaigner and the narcotic mafia resulting in a great loss of human life against apart held in (d) intense cold wave killing hundreds of people South Africa. 54. The Prime Minister of which one of the following countries D. Kim ",
    "year": "2004",
    "options": {
      "a": "Czech Republic",
      "b": "Romania"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 5,
    "text": "American violinist (c) Serbia (d) Slovenia Codes: 55. More than 40 Heads of States/Governments were invited (a) A-5; B-3; C-2; D-1 (b) A-2; B-3; C-4; D-1 by Vladimir Putin in May, 2003 to:",
    "year": "2004",
    "options": {
      "a": "discuss the issues related to the rehabilitation of Iraq",
      "b": "celebrate the tricentenary of the city of St. Petersburg",
      "c": "A-5; B-3; C-4; D-2",
      "d": "A-2; B-4; C-1; D-3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 66,
    "text": "Which one of the following countries is the first country in (c) convene a meeting of European and CIS countries to the world to propose a carbon tax for its people to address discuss the issue of missile shield for European and global warming?",
    "year": "2006",
    "options": {
      "a": "Australia",
      "b": "Germany",
      "c": "Japan",
      "d": "develop the strategies for containing global terrorism"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 67,
    "text": "Who among the following directed the film chosen as India (a) 1 only (b) 2 only official entry for of 2006 Academy Awards?",
    "year": "2006",
    "options": {
      "a": "Adoor Gopalakrishnan",
      "b": "Amol Palekar",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 77,
    "text": "What is the broad area in which the Nobel Prize winners for (c) Sanjay Leela Bhansali (d) Kunal Kohli the year 2006 in Physiology or Medicine, worked to get the 68. What is Medicines Sans Frontieres (MSF)?",
    "year": "2006",
    "options": {
      "a": "An agency formed by the International Olympic",
      "b": "Flow of genetic information",
      "c": "Immunology and disease resistance sportspersons.",
      "d": "Adult stem cell research"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 78,
    "text": "Which one of the following countries is planning to in international humanitarian aid and emergency construct a rival to the Panama Canal to link the Pacific and medical assistance. Atlantic Oceans?",
    "year": "2007",
    "options": {
      "a": "Colombia",
      "b": "Costa Rica nanotechnology in medicine.",
      "c": "An organization to develop applications of",
      "d": "Nicaragua"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 69,
    "text": "Zayed bin Sultan-al-Nahyan was a long serving President (b) Bulgaria and Belgium of which of the following?",
    "year": "2006",
    "options": {
      "a": "Oman",
      "b": "Kuwait",
      "c": "Romania and Slovenia",
      "d": "Hungary and Croatia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 80,
    "text": "Which one of the following countries recently upgraded its (c) United Arab Emirates defence agency to a full defence ministry?",
    "year": "2007",
    "options": {
      "a": "Italy",
      "b": "Japan",
      "d": "Saudi Arabia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 70,
    "text": "Where is Bundala Biosphere Reserve which has been (c) Switzerland (d) Poland recently added to the UNESCO’s Man and Biosphere (MAB) 81. In the latter half of the year 2006, in which one of the network located?",
    "year": "2006",
    "options": {
      "a": "Russia",
      "b": "India",
      "c": "Sri Lanka",
      "d": "Bangladesh"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 71,
    "text": "Recently with which country government did ONGC Mittal 82. Near the end of the year 2006, which one of the following Energy Limited (OMEL) sign a joint-venture deal of $6 billion countries was suspended from the Commonwealth after a dealing with infrastructure, refinery and power?",
    "year": "2006",
    "options": {
      "a": "Colombia",
      "b": "Venezuela",
      "c": "Nigeria",
      "d": "Saudi Arabia"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 72,
    "text": "What was the main reason for which Niger was in the news 83. Who was Leander Paes’s partner when he won Doubles in recent times?",
    "year": "2006",
    "options": {
      "a": "Many deaths due to AIDS",
      "b": "Martin Damm",
      "c": "Bob Bryan",
      "d": "Mike Bryan"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 84,
    "text": "Which one of the following cities has been the venue of the (d) Famine and starvation Asian Games for the maximum number of times from the 73. Which of the following countries signed the Tshwane year 1951 to the year 2006?",
    "year": "2007",
    "options": {
      "a": "Delhi",
      "b": "Bangkok",
      "c": "Tokyo",
      "d": "Beijing"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 74,
    "text": "Recently, the European Union and other six countries (a) Journalism including India signed the International Thermonuclear (b) International economics Experimental Reactor (ITER) Project. Which one of the (c) Sustainable development following was not a signatory to it?",
    "year": "2007",
    "options": {
      "a": "Canada",
      "b": "China",
      "d": "Child development"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 86,
    "text": "Cristina Kirchner succeeded her husband to become (c) Japan (d) USA President of a South American country. Which is that 75. How is Steve Fossett known as",
    "year": "2007",
    "options": {
      "a": "as a crocodile hunter",
      "b": "Argentina",
      "c": "Colombia",
      "d": "Venezuela globe"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Orange Prize is awarded to a work of published fiction (d) for climbing to Mt Everest without any co-climber in English by a woman. 76. Consider the following statements: 2. Pulitzer Prize is awarded by the Commonwealth 1. Republicans won the majority in the US House of Foundation to a citizen of any Commonwealth country Representatives Elections held in the year 2006. for any literary work in Eng",
    "year": "2007",
    "options": {
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2 H 6 Topicwise Solved Papers"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 88,
    "text": "In the year 2007, an earthquake led to massive radioactive 99. In the context of Indian news in recent times, what is MCX- water leakage in the largest nuclear plant in the world. In SX?",
    "year": "2009",
    "options": {
      "a": "A kind of supercomputer",
      "b": "Canada",
      "c": "Japan",
      "d": "USA"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 100,
    "text": "From which one of the following did Kosovo declare its (a) Davos (b) Nova Scotia independence?",
    "year": "2009",
    "options": {
      "a": "Bulgaria",
      "b": "Croatia",
      "c": "Johannesburg",
      "d": "Shanghai"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 90,
    "text": "Where was the first desalination plant in India to produce (c) Macedonia (d) Serbia one lakh litres freshwater per day based on low temperature 101. In the middle of the year 2008 the Parliament of which one of thermal desalination principle commissioned?",
    "year": "2008",
    "options": {
      "a": "Kavaratti",
      "b": "Port Blair a Climate Act by passing “The Climate Change",
      "c": "Mangalore",
      "d": "Valsad Accountability Bill”?"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 91,
    "text": "‘Hand-in-Hand 2007’, a joint anti terrorism military training (a) Australia (b) Canada was held by the officers of the Indian Army and officers of Army of which one of the following countries?",
    "year": "2008",
    "options": {
      "a": "China",
      "b": "Japan",
      "c": "Germany",
      "d": "Japan"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 102,
    "text": "Elephant pass, which is frequently in the news, is mentioned (c) Russia (d) USA in the context of the affairs of which one of the following? 92. Kim Dae-jung won the Nobel for Peace. He is from which",
    "year": "2009",
    "options": {
      "a": "Bangladesh",
      "b": "India",
      "c": "Nepal",
      "d": "Sri Lanka"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 103,
    "text": "Among other things, which one of the following was the 93. How is the United Nations Monetary and Financial purpose for which the Deepak Parekh Committee was Conference where in the agreements were signed to set up constituted?",
    "year": "2009",
    "options": {
      "a": "To study the current socio-economic conditions of",
      "b": "Bretton Woods Conference",
      "c": "Versailles Conference",
      "d": "Yalta Conference infrastructure"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 94,
    "text": "A very big refugee camp called Dadaab, recently in the news, (c) To frame a policy on the production of genetically is located in",
    "year": "2009",
    "options": {
      "a": "Ethiopia",
      "b": "Kenya",
      "c": "Somalia",
      "d": "To suggest measures to reduce the fiscal deficit in the"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 95,
    "text": "Consider the following names: 104. In the context of the affairs of which of the following is the 1. Ike 2. Kate phrase “Special Safeguard Mechanisms” mentioned in the 3. Gustav news frequently?",
    "year": "2010",
    "options": {
      "a": "United Nations Environment Programme occurred very recently?",
      "b": "World Trade Organisation",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 96,
    "text": "In the latter half of the year 2008, which one of the following (d) G-20 Summits countries pulled out of Commonwealth of Independent 105. Stiglitz Commission established by the President of the States?",
    "year": "2009",
    "options": {
      "a": "Azerbaijan",
      "b": "Belarus news. The commission was supposed to deal with",
      "c": "Georgia",
      "d": "Kazakhstan"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Kenya B. Mwai Kibaki 2. Mozambique (c) Global terrorism and prepare a global action plan for C. Rupiah Banda 3. Zambia the mitigation of terrorism 4. Zimbabwe (d) Expansion of the United Nations Security Council in Codes: the present global scenario (a) A-1; B-2; C-3 (b) A-2; B-1; C-3 106. As per the UN-Habitat’s Global Report on Human (c) A-2; B-1; C-4 (d) A-1; B-2; C-4 Settlements 2009, which on",
    "year": "2009",
    "options": {
      "a": "Asia Pacific Economic Cooperation",
      "b": "International Bank for Reconstruction and Development",
      "c": "World Health Organization",
      "d": "World Economic Forum"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 109,
    "text": "Recently, the USA decided to support India’s membership (a) goods and services in multi-lateral export control regimes called the “Australia (b) gold and silver group” and the “Wassenaar arrangement”. What is the (c) dollars and other hard currencies difference between them ? (d) exportable surplus 1. The Australia group is an informal arrangement which 115. The 'Fortaleza Declaration', recently i",
    "year": "2015-I",
    "options": {
      "a": "ASEAN",
      "b": "BRICS proliferation, whereas the Wassenaar arrangement is a",
      "c": "OECD",
      "d": "WTO formal group under the OECD holding identical"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Other than China, Australia, Canada and Chile, these (b) Guinea, Sierra Leone and Liberia elements are not found in any country. (c) Philippines and Papua New Guinea 3. Rare earth metals are essential for the manufacture of (d) Jamaica, Haiti and Surinam various kinds of electronic items and there is a growing 118. The area known as 'Golan Heights' sometimes appears in demand for these elements. t",
    "year": "2015-I",
    "options": {
      "a": "Central Asia",
      "b": "Middle East",
      "c": "South-East Asia",
      "d": "Central Africa"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 119,
    "text": "The term 'Goldilocks Zone' is of ten seen in the news in the 111. The efforts to detect the existence of Higgs boson particle context of",
    "year": "2015-I",
    "options": {
      "a": "the limits of habitable zone above the surface of the the importance / importances of discovering this particle? Earth",
      "b": "regions inside the Earth where shale gas is available"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2013,
    "text": "(a) Australia 3. TFA came into force in January 2016. (b) Canada Which of the statements given above is/are correct? (c) The European Union (a) 1 and 2 only (b) 1 and 3 only (d) The United States of America (c) 2 and 3 only (d) 1, 2 and 3 130. Recently, India signed a deal known as 'Action Plan for 122. The term 'Digital Single Market Strategy' seen in the news Prioritization and Implementation of",
    "year": "2017-I",
    "options": {
      "a": "ASEAN",
      "b": "BRICS",
      "c": "EU",
      "d": "G20"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Department of Industrial Policy and Promotion is the (a) 'Higgs boson particles' were detected. nodal agency for regulating intellectual property rights (b) 'Gravitational waves' were detected. in India. (c) Possibility of inter-galactic space travel through Which of the above statements is/are correct? 'wormhole' was confirmed. (a) 1 only (b) 2 only (d) It enabled the scientists to understand to ",
    "year": "2019-I",
    "options": {
      "a": "A molecular scissors used in targeted gene editing.",
      "b": "A biosensor used in the accurate detection of increase. pathogens in patients.",
      "c": "A gene that makes plants pest-resistant be strengthened.",
      "d": "A herbicidal substance synthesized in generally"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "The structure and design of blockchain is such that (a) Exo-planets (b) Crypto-currency all the data in it are about cryptocurrency only (c) Cyber attacks (d) Mini satellites 3. Applications that depend on basic features of blockchain 126. Among the following, which one of the following is the largest can be developed without anybody’s permission. exporter of rice in the world in the last five yea",
    "year": "2019-I",
    "options": {
      "a": "China",
      "b": "India",
      "c": "Myanmar",
      "d": "Vietnam"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 134,
    "text": "Consider the following statements:",
    "year": "2020-I",
    "options": {
      "a": "1 and 2 only",
      "b": "2 only regions of the wetlands as determined by the authority",
      "c": "3 only",
      "d": "1, 2 and 3 5337_DBE International H 9 HINTS & SOLUTIONS 1."
    },
    "answer": null,
    "explanation": ""
  }
]