[
  {
    "number": 1,
    "text": "Consider the table given below providing some details of 1. Bahujana Samaj Party 2. Haryana Vikas Party the results of the election to the Karnataka State Legislature 3. Samata Party 4. Asom Gana Parishad Assembly held in December, 1994 : Select the correct answer using the codes given below: Codes: Political Party Percentage. of Number of (a) 1, 2, 3 and 4 (b) 1, 2 and 3 Popular Votes Seats obtai",
    "year": "1998",
    "options": {
      "a": "collision with a Soyuz cargo ship In terms of electoral analysis, the voter-seat distortion is to",
      "b": "faulty material design of the Spektr Module be explained as the result of the adoption of the:",
      "c": "explosion inside the space station",
      "d": "collision with an asteroid"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 12,
    "text": "Which one of the following was the venue for the (c) first-past-the post system preliminary talks between the Sri Lankan Government and (d) plural vote system representatives of Tamil United Liberation Front and other 2. To prevent recurrence of scams in Indian Capital Market, the militant groups?",
    "year": "1998",
    "options": {
      "a": "New Delhi",
      "b": "Colombo",
      "c": "SBI",
      "d": "ICICI"
    },
    "answer": "a",
    "explanation": "Albert Costa won the French Open Title of Men in the"
  },
  {
    "number": 3,
    "text": "In the field of space technology–India has demonstrated 13. The following news item appeared in a National daily dated during 1994, her capability to:",
    "year": "1995",
    "options": {
      "a": "design advance intercontinental ballistic missile “...Parliament today rejected a Bill to grant women the right warning systems to vote and stand for office in parliamentary elections, by a",
      "b": "build satellites margin of 32 to"
    },
    "answer": "d",
    "explanation": "Director Dev Bengal has made a full length feature test inning. film, starring Rahul Bose, on Upamanyu Chatterjee’s novel"
  },
  {
    "number": 30,
    "text": "(c) build stealth missiles The National Assembly was split between liberal (d) launch geo-stationary satellites pro-government and Shiite Muslim deputies who were in 4. Which one of the following satellites is to be launched from favour of women’s rights, while the opposition camp India in 1996?",
    "year": "1996",
    "options": {
      "a": "IRS-P2",
      "b": "IRS-P3 A total of 64 MPs and Ministers were present, of whom two",
      "c": "IRS-EN",
      "d": "IRS-ID abstained.”"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 5,
    "text": "Which one of the following is a modern tank?",
    "year": "1996",
    "options": {
      "a": "Bhim",
      "b": "Akash",
      "c": "Arjun",
      "d": "Prithvi"
    },
    "answer": "d",
    "explanation": "To reach the final of Australian open which is the first Australian open 2004 Justine Henin Hardenne grandslam of the year 2000, Martina Hingis defeated"
  },
  {
    "number": 6,
    "text": "The average rate of domestic savings (gross) for the Indian 14. The given map shows locations of airports labelled as 1, 2, 3, economy is currently estimated to be in the range of: 4 and 5. What is the correct sequence of the airports in which (a) 15 to 20 percent (b) 20 to 25 percent",
    "year": "1997",
    "options": {
      "c": "25 to 30 percent",
      "d": "30 to 35 percent take off from Kathmandu in December 1999 ?"
    },
    "answer": "d",
    "explanation": "In U.S. Open 2001, Venus William defeated Serena"
  },
  {
    "number": 7,
    "text": "One of the important agreements reached in the 1996 Ministerial Conference of WTO refers to:",
    "year": "1997",
    "options": {
      "a": "Commerce in Information Technology",
      "b": "Multilateral Agreement on Investment",
      "c": "Multi-fibre Agreement",
      "d": "Exchange of technical personal?"
    },
    "answer": "a",
    "explanation": "Australia has been involved in two test ties in test important tournament between nations in men's tennis. A cricket against England and India. total of 130 teams participated in the tournament. The final"
  },
  {
    "number": 8,
    "text": "Which one of the following States of India has passed a legislation (in 1996) making the maintenance of one's parents mandatory?",
    "year": "1997",
    "options": {
      "a": "Kerala",
      "b": "West Bengal",
      "c": "Maharashtra",
      "d": "Himachal Pradesh"
    },
    "answer": "b",
    "explanation": "In 9th FlNA–World Swimming Championship held at took place 2-4 December at the Sibamac Arena in Bratislava, Fukuoka in Japan in 2001, Ian Thorpe of Australia won six Slovakia, with Croatia defeating Slovakia for their first title. gold medals."
  },
  {
    "number": 9,
    "text": "Bharat Ratna was awarded in 1997 to:",
    "year": "1998",
    "options": {
      "a": "3, 1, 2, 4",
      "b": "2, 4, 1, 3",
      "c": "5, 4, 2, 3",
      "d": "5, 1, 3, 2"
    },
    "answer": "b",
    "explanation": "Hendraan of Indonesia won the men’s singles title at Cup, the quadrennial international football world the world Badminton Championship in the year 2001, championship tournament. It was held from 9 June to 9 defeating Peter Gade of Sweden in the final. July 2006 in Germany, which won the right to host the event"
  },
  {
    "number": 10,
    "text": "Which of the following Parties were not a part of the United (a) 1991 – 92 (b) 1992 – 93 Front Which was in power during '96-97' ?",
    "year": "1998",
    "options": {
      "c": "1993 – 94",
      "d": "1994 – 95 5337_DBE National H 15"
    },
    "answer": "c",
    "explanation": "Tim Montgomery set a new world record at the IAAF in July 2000. Russia did not participate in this event. Grand Prix Final in the year 2002 in 100 m Dash."
  },
  {
    "number": 16,
    "text": "The Standing Committee of State Finance Ministers List I (Person) List II (Achievement) recommended in January, 2000 uniform rates across the A. Deep Sen Gupta 1. India’s youngest International states in respect of:",
    "year": "2000",
    "options": {
      "a": "value-added tax Chess Tournament 2000",
      "b": "sales tax B. P. Harikrishna"
    },
    "answer": "c",
    "explanation": "He is mid-fielder in Indian football team. Conchita Martinez 6-3,6-2."
  },
  {
    "number": 2,
    "text": "The first Indian ever to win (c) stamp duty and registration fees a gold in discuss in the (d) agricultural income tax World Junior Athletic 17. The Swarna Jayanti Shahari Rozgar Yojana which came into Championship it Santiago, operation from 1-12-1997 aims to provide gainful 2000 employment to the urban unemployed or underemployed C. Seema Anti 3. Won the title in the Asian poor but does not incl",
    "year": "2000",
    "options": {
      "a": "Nehru Rozgar Yojana in Mumbai 2000",
      "b": "Urban Basic Services Programme D. Tejas Bakre"
    },
    "answer": "b",
    "explanation": "India qualified for Atlanta Olympic in Hockey on 19-28 this record was broken by Brian Lara of West Indies with January 1996 in Barcelona, so till 1995 India had not qualified 375 runs, this was broken by Mathew Hayden with 380 for Atlanta Olympic. runs but recently Lara broke his record with 400 runs in a"
  },
  {
    "number": 4,
    "text": "Won the under 12 title in (c) Prime Minister’s Integrated Urban Poverty Eradication the World Youth Chess Programme Festival in Oropesa, 2000 (d) Prime Minister’s Rozgar Yojana Codes: 18. Consider the following statements:",
    "year": "2000",
    "options": {
      "a": "A-4; B-3; C-2; D-1",
      "b": "A-2; B-4; C-1; D-3 The Ministerial Meeting of WTO held in December 1999",
      "c": "A-4; B-1; C-2; D-3",
      "d": "A-2; B-1; C-3; D-4 was unsuccessful because in attempted to link trade with:"
    },
    "answer": "c",
    "explanation": "The 2004 Olympic was held in Athens in Greece which Wimbledon 2004 – Maria Sharapova is ancient Rome. U.S Open – Svetlana Kuznetsova"
  },
  {
    "number": 3,
    "text": "terrorism related issues 4. debt related issues (a) Anil Kakodkar (b) Abdul Kalam Which of these statements are correct? (c) K. Kasturirangan (d) U.R.Rao (a) 1, 3 and 4 (b) 1 and 2 24. The theme of Indian Science Congress 2001 was:",
    "year": "2001",
    "options": {
      "a": "“Food nutrition and environmental security”",
      "c": "2 and 3",
      "d": "2 and 4"
    },
    "answer": "d",
    "explanation": "Director Dev Bengal has made a full length feature test inning. film, starring Rahul Bose, on Upamanyu Chatterjee’s novel"
  },
  {
    "number": 1,
    "text": "T.V. host B. Oprah Winfrey 2. Journalist 2600 C. Oscar Wilde 3. Mountaineer 2400 D. P. Sainath 4. Dramatist and Author 2200 Codes : (a) A – 3; B – 1; C – 4; D – 2 (b) A – 1; B – 3; C – 2; D – 4 Jan FebMarAprMayJun JulAug (c) A – 3; B – 1; C – 2; D – 4 (d) A – 1; B – 3; C – 4; D – 2 Automobile Share 26. The largest share of Foreign Direct Investment (1997-2000) went to:",
    "year": "2001",
    "options": {
      "a": "food and food-product sector",
      "b": "engineering sector Jan FebMarAprMayJun Jul Aug",
      "c": "electronics and electric equipment sector Which one of the following inferences can be drawn from",
      "d": "services sector the graphs?"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 27,
    "text": "Who among the following set a new national record in the (a) The automobile share market has been as unstable as women's Pole-vault event in the 7th edition of Senior BSE Sensex in that period Federation Cup held in Karnataka in the year 2001?",
    "year": "2002",
    "options": {
      "a": "G. G. Pramila",
      "b": "There has been a major political change in June/July",
      "c": "Automobile shares have shown a steady improvement",
      "d": "Manisha Dey in price, unaffected by large fluctuations in BSE Sensex"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "In the new WPI series, the weight for primary articles (a) 1981-82 (b) 1990-91 has gone down by 10 percentage points (c) 1993-94 (d) 1994-95 3. The weight for electricity has increased in the new 21. The Union Budget 2000 awarded a Tax Holiday for the North- WPI series Eastern Region to promote industrialisation for:",
    "year": "2001",
    "options": {
      "a": "5 years",
      "b": "7 years",
      "c": "9 years",
      "d": "10 years"
    },
    "answer": "b",
    "explanation": "India qualified for Atlanta Olympic in Hockey on 19-28 this record was broken by Brian Lara of West Indies with January 1996 in Barcelona, so till 1995 India had not qualified 375 runs, this was broken by Mathew Hayden with 380 for Atlanta Olympic. runs but recently Lara broke his record with 400 runs in a"
  },
  {
    "number": 29,
    "text": "Among the following major stock exchanges of India, the Which of these statements are correct? exchange which recorded highest turnover during the year (a) 1, 2 and 3 (b) 2, 3 and 4 2000-01 is:",
    "year": "2002",
    "options": {
      "a": "Bombay Stock Exchange",
      "c": "1, 2 and 4",
      "d": "1, 3 and 4"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Trade, Hotels, Transport and Communication (a) USA (b) Japan (c) Germany (d) UAE 31. India’s external debt increased from US $ 91,158 million as at 4. Financing, Insurance, Real Estate and Business services the end of March 2000 to US $ 100,225 million as at the end of The decreasing order of the contribution of these sectors March 2001 due to increase in:",
    "year": "2002",
    "options": {
      "a": "3, 1, 2, 4",
      "b": "rupee debt",
      "c": "commercial borrowings",
      "d": "1, 3, 2, 4"
    },
    "answer": "d",
    "explanation": "Director Dev Bengal has made a full length feature test inning. film, starring Rahul Bose, on Upamanyu Chatterjee’s novel"
  },
  {
    "number": 1,
    "text": "Tinner of Neerja Bhanot Award B. Kaveri Thakur 2. Recipient of Stree Shakti Puraskar (a) Both A and R are individually true and R is the correct C. Mira Nair 3. Became the fastestswimmer explanation of A in Asia at the age of 16 years (b) Both A and R are individually true but R is not the D. Yasoda Ekambaram 4. Recipient of the Golden Lion correct explanation of A at Venice film festival (c) A is",
    "year": "2003",
    "options": {
      "a": "Edible oil",
      "b": "Fertilizers",
      "c": "Organic and inorganic chemicals",
      "d": "Pearls, precious and semi-precious stones"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 34,
    "text": "In the year 2001, Germany approved a $ 32 million credit to 1. The maximum limit of shareholding of Indian promoters India:",
    "year": "2002",
    "options": {
      "a": "to promote primary education in select states paid up capital",
      "b": "for Tehri dam project"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Demolition of a religious (a) Dev Anand (b) Lata Mangeshkar structure at Ayodhya (c) Ramanand Sagar (d) Yash Chopra D. Jain Commission 4. Riots in Mumbai in 1993 43. In the year 2002, the President of India presented the national Codes: award for excellence in public administration and management (a) A-3; B-2; C-4; D-1 (b) A-2; B-3; C-4; D-1 science to:",
    "year": "2003",
    "options": {
      "a": "Kumar Manglam Birla",
      "b": "N.R. Narayana Murthy",
      "c": "A-3; B-2; C-1; D-4",
      "d": "A-2; B-3; C-1; D-4"
    },
    "answer": "d",
    "explanation": "Director Dev Bengal has made a full length feature test inning. film, starring Rahul Bose, on Upamanyu Chatterjee’s novel"
  },
  {
    "number": 36,
    "text": "Consider the following statements:",
    "year": "2002",
    "options": {
      "c": "Rahul Bajaj",
      "d": "Ratan Tata The Draft Electricity Bill, 2001 seeks to replace:"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 4,
    "text": "Wipro Technologies 1. India’s Import of crude and petroleum products during Codes: the year 2001-02 accounted for about 27% of India’s (a) A-4; B-1; C-3; D-2 (b) A-4; B- 3; C-1; D-2 total imports (c) A-2; B-3; C-1; D-4 (d) A-2; B-1; C-3; D-4 2. During the year 2001-02, India’s exports had increased by 46. In December 2002, the Prime Minister of India signed: 10% as compared to the previous year ‘D",
    "year": "2003",
    "options": {
      "a": "President of Indonesia",
      "b": "Only 2",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "c",
    "explanation": "The 2004 Olympic was held in Athens in Greece which Wimbledon 2004 – Maria Sharapova is ancient Rome. U.S Open – Svetlana Kuznetsova"
  },
  {
    "number": 47,
    "text": "The Indira Gandhi Peace Prize 2002 was awarded to:",
    "year": "2003",
    "options": {
      "a": "Under the Targeted Public Distribution System, the",
      "b": "Nelson Mandela families Below Poverty Line are provided 50 kg of",
      "c": "Norodom Sihanouk",
      "d": "Sadako Ogata foodgrains per month per family at subsidised price"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 48,
    "text": "Assertion (A) : The new EXIM policy is liberal, market- (b) Under Annapurna Scheme, indigent senior citizens of 65 oriented and favours global trade. years of age or above eligible for National Old Age Pension Reason (R) : GATT has played a significant role in the but not getting pension can get 10 kg of foodgrains per liberalisation of the economy.",
    "year": "2003",
    "options": {
      "a": "Both A and R are individually true and R is the correct",
      "b": "Both A and R are individually true but R is not the institutions like orphanages are given 15 kg of correct explanation of A foodgrains per person per month at BPL rates",
      "c": "Ministry of Social Justice and Empowerment has explanation of A scheme in which indigent people living in welfare",
      "d": "Ministry of Human Resource Development gives"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "In the last five years, Indian software exports have increased Government aided Schools at a compound annual growth rate of about 60% 55. Which one of the following was the largest IT software and 2. The software and service industry in India registered services exporter in India during the year 2002-03?",
    "year": "2004",
    "options": {
      "a": "Birlasoft the year 2001-2002 .",
      "b": "Infosys Technologies Which of these statements is/are not correct?",
      "c": "Tata Consultancy Services",
      "d": "Wipro Technologies"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 3,
    "text": "(a) more than 70% Reason (R) : For the first time, India’s exports crossed worth (b) between 60% and 70% $ 50 billion in the year 2002-03.",
    "year": "2004",
    "options": {
      "a": "Both A and R are individually true and R is the correct",
      "c": "between 50% and 60%",
      "d": "less than 50% explanation of A"
    },
    "answer": "d",
    "explanation": "Director Dev Bengal has made a full length feature test inning. film, starring Rahul Bose, on Upamanyu Chatterjee’s novel"
  },
  {
    "number": 3,
    "text": "Dilip Kumar, Raj Kapoor and Dev Anand have all been (a) They were demanding tax relief recipients of Dada Saheb Phalke (b) They were against the Hong Kong Governments plan Which of the statements given above is/are correct? to impose an internal security law",
    "year": "2004",
    "options": {
      "a": "1 and 3",
      "b": "2 and 3",
      "c": "They were the members of Falun Gong group who",
      "d": "3 only were demanding religious freedom"
    },
    "answer": "d",
    "explanation": "Director Dev Bengal has made a full length feature test inning. film, starring Rahul Bose, on Upamanyu Chatterjee’s novel"
  },
  {
    "number": 1,
    "text": "Global Trust Bank has been amalgamated with the Hong Kong. . Punjab National bank. 60. The Ramon Magsaysay Award winner Shanta Sinha is 2. The second report of the Kelkar Committee dealing known as:",
    "year": "2004",
    "options": {
      "a": "a campaigner for urban sanitation original recommendation including the abolition of",
      "b": "an anti-child labour activist exemptions relating to housing loans.",
      "c": "an organizer of rain-water harvesting schemes Which of the statements given above is/are correct?",
      "d": "an activist for the welfare of poor rural women"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 4,
    "text": "Lakshmibaf National Institute of Physical Education List-I List-II Gwalior (Location) (Known for/ in News for) Select the correct answer using the codes given below: A. Kakinada 1. Sky Bus Metro rail (a) 1 , 2 and 3 (b) 3 and 4 test-run (c) 1, 2 and 4 (d) 1, 2, 3 and 4 B. Dundigal 2. ITC paper board unit 62. In the well-known Lawn Tennis doubles team; Max Mirnyi C. Margao 3. Bio-diesel plant – the",
    "year": "2004",
    "options": {
      "a": "Italy",
      "b": "Sweden",
      "c": "Belarus",
      "d": "Croatia"
    },
    "answer": "c",
    "explanation": "The 2004 Olympic was held in Athens in Greece which Wimbledon 2004 – Maria Sharapova is ancient Rome. U.S Open – Svetlana Kuznetsova"
  },
  {
    "number": 71,
    "text": "Consider the following statements:",
    "year": "2005",
    "options": {
      "a": "Israel",
      "b": "USA",
      "c": "Russia",
      "d": "France"
    },
    "answer": "a",
    "explanation": "The Second World Buddhist Summit was held at"
  },
  {
    "number": 2,
    "text": "World Punjabi Conference was held in Jalandhar in (a) French Guiana (b) Seychelles December, 2004. (c) Mauritius (d) Mauritania 3. 4th Meeting of the SAARC Trade Ministers was held 65. Match List-I (Person) with List-II (Position) and select the in Islamabad in November, 2004. correct answer using the codes given below the lists: Which of the statements given above is/are correct?",
    "year": "2004",
    "options": {
      "a": "3 only",
      "b": "1 and 2 List-I List-II",
      "c": "2 and 3",
      "d": "1, 2 and 3 A. Anil Kokodar"
    },
    "answer": "b",
    "explanation": "India qualified for Atlanta Olympic in Hockey on 19-28 this record was broken by Brian Lara of West Indies with January 1996 in Barcelona, so till 1995 India had not qualified 375 runs, this was broken by Mathew Hayden with 380 for Atlanta Olympic. runs but recently Lara broke his record with 400 runs in a"
  },
  {
    "number": 2,
    "text": "Chairman, 17th Law List-I (Person) List-II (Organization) Commission A. V.R. S. Natrajan 1. Bharat Heavy Electricals C. M. Jagannatha Rao 3. Chairman, ISRO Limited D. G. Madhavan Nair 4. Chairman Atomic Energy B. A.K. Puri 2. Air India Codes: C. V. Thulasidas 3. Maruti Udyog Limited (a) A-3; B-1; C-2; D-4 (b) A-4; B-2; C-1; D-3 D. Jagdish Khattar 4. Bharat Earth Movers Limited (c) A-3; B-2; C-1; D",
    "year": "2004",
    "options": {
      "a": "a book on Chhatrapati Shivaji",
      "b": "a warship recently acquired by the Indian Navy",
      "c": "a recently started air service between Mumbai and Colombo",
      "d": "a luxury train which travels through Maharashtra and"
    },
    "answer": "b",
    "explanation": "India qualified for Atlanta Olympic in Hockey on 19-28 this record was broken by Brian Lara of West Indies with January 1996 in Barcelona, so till 1995 India had not qualified 375 runs, this was broken by Mathew Hayden with 380 for Atlanta Olympic. runs but recently Lara broke his record with 400 runs in a"
  },
  {
    "number": 73,
    "text": "Who among the following is the President of the FlCCI? Which of the statement(s) given above is/are correct?",
    "year": "2005",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "c",
    "explanation": "Mr. Rajesh shah took over as the President of coverage of upto 75% of the rural population and up to 50% Federation of Indian Chambers of Commerce & Industry of the urban population for receiving highly subsidized food (FICCI) for 2017-18. grains. Under this act, beneficiaries of the Public Distribution"
  },
  {
    "number": 85,
    "text": "Consider the following statements:",
    "year": "2006",
    "options": {
      "a": "ITC",
      "b": "Dabur I. According to the census 2001, Kerala has the smallest",
      "c": "Procor and Gamble",
      "d": "Hindustan Liver gap in male and female literacy rates among the 28"
    },
    "answer": "d",
    "explanation": "Mizoram is the state where male literacy is 90.7% and Piers Sellers - Space Walker female literacy is 86.7%. So, Mizoram is the state of smallest"
  },
  {
    "number": 1,
    "text": "The agreement on South Asian Free Trade Area (b) Midas Communication Technologies (SAFTA) came into effect from 1st December, 2005. (c) Tata Consultancy Services 2. As per SAFT A agreement terms, India, Pakistan and (d) Biocon India Ltd. Sri Lanka have to decrease their custom duties to the 78. Who is the President of the Council of Scientific and level of 0 to 5 per cent by the year 2013. Industr",
    "year": "2006",
    "options": {
      "a": "President of India",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither I nor 2"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 2,
    "text": "Info Edge India (which (a) Hampi Temple (b) Mamallapuram Temple runs naukri.com) (c) Sun Temple of Konark(d) Khajuraho Temple C. Shashi Ruia 3. Indian (Indian 80. Recently Uttar Pradesh and Madhya Pradesh govern-ments Airlines) signed a Memorandum of Understanding for the linking of two D. D S Bikhchandani 4. Suzlon Energy rivers as a link project. Which are these two rivers?",
    "year": "2006",
    "options": {
      "a": "Betwa and Chambal",
      "b": "Betwa and Ken",
      "c": "Chambal and Son",
      "d": "Ken and Narmada"
    },
    "answer": "b",
    "explanation": "India qualified for Atlanta Olympic in Hockey on 19-28 this record was broken by Brian Lara of West Indies with January 1996 in Barcelona, so till 1995 India had not qualified 375 runs, this was broken by Mathew Hayden with 380 for Atlanta Olympic. runs but recently Lara broke his record with 400 runs in a"
  },
  {
    "number": 1,
    "text": "The Judges (Inquiry) Bill 2006 contemplates to achievement in dance?",
    "year": "2006",
    "options": {
      "a": "Chandralekha",
      "b": "Tanjavur Balasaraswati complaints against Judges of the Supreme Court",
      "c": "Uma Sharma",
      "d": "Yamini Krishnamurthy including the Chief Justice of India, High Court Chief"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 1,
    "text": "In India, during the financial year 2004-2005 an increase (a) Finding high quality gas reserves",
    "year": "2007",
    "options": {
      "b": "Finding uranium deposits in the financial year 2003-2004 was reported.",
      "c": "Finding zinc deposits"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 2,
    "text": "According to the WTO, India share in the world (d) Installation of wind power units merchandise exports crosses 2% in the year 2005. H 20 Topicwise Solved Papers 90. Who among the following have been the Union Finance Codes: Ministers of India?",
    "year": "2007",
    "options": {
      "a": "A-4; B-1; C-3; D-2",
      "b": "A-2; B-3; C-1; D-4"
    },
    "answer": "b",
    "explanation": "India qualified for Atlanta Olympic in Hockey on 19-28 this record was broken by Brian Lara of West Indies with January 1996 in Barcelona, so till 1995 India had not qualified 375 runs, this was broken by Mathew Hayden with 380 for Atlanta Olympic. runs but recently Lara broke his record with 400 runs in a"
  },
  {
    "number": 1,
    "text": "V P Singh 2. R Venkataraman (c) A-4; B-3; C-1; D-2 (d) A-2; B-1; C-3; D-4 3. Y B Chavan 4. Pranab Mukherjee 99. Basel II relates to which one of the following?",
    "year": "2007",
    "options": {
      "a": "International standards for safety in civil aviation",
      "b": "1, 3 and 4 only",
      "c": "2 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 100,
    "text": "Tarapore Committee was associated with which one of the (a) Chang La (b) Jara La following?",
    "year": "2007",
    "options": {
      "a": "Special Economic Zones",
      "c": "Nathu La",
      "d": "Shipki La"
    },
    "answer": "b",
    "explanation": "The Tarapore committee was setup by the Reserve phase of the two-year period ending in 2007. Bank of India in 1997 under the chairmanship of former RBI"
  },
  {
    "number": 3,
    "text": "Chief Justice of India (a) The Secret River D. Ashok Desai 4. Attorney General of India (b) In the Country of Men Codes: (c) The Inheritance of Loss (a) A-1; B-4; C-2; D-3 (b) A-2; B-3; C-1; D-4 (d) Mother’s Milk (c) A-1; B-3; C-2; D-4 (d) A-2; B-4; C-1; D-3 94. What was the purpose of the Operation Sukoon launched 102. In August 2006, the Government of India notified the by the Government of Indi",
    "year": "2007",
    "options": {
      "a": "Helping Indonesia in its efforts to rehabilitate the access to all households by which year?",
      "b": "2009",
      "c": "2010",
      "d": "2012"
    },
    "answer": "d",
    "explanation": "Director Dev Bengal has made a full length feature test inning. film, starring Rahul Bose, on Upamanyu Chatterjee’s novel"
  },
  {
    "number": 103,
    "text": "Recently, the manuscripts of which one of the following have the conflict in the Middle East been included in the UNESCO’s Memory of World Register? (c) Assisting United Nations in its efforts to help the civil",
    "year": "2008",
    "options": {
      "a": "Abhidhamma Pitaka",
      "b": "Mahabharata",
      "c": "Ramayana",
      "d": "Providing a relief package to farmers after a spate of"
    },
    "answer": "d",
    "explanation": "The Rig Veda manuscripts have been selected for a first class Judicial Magistrate. inscription in UNESCO's \"Memory of the World\" Register"
  },
  {
    "number": 97,
    "text": "MCA-21 is a major initiative taken up by the Government of (a) Police Reforms India in which one of the following areas?",
    "year": "2007",
    "options": {
      "a": "Foreign direct investment in India",
      "b": "Tax Reforms",
      "c": "Reforms in Technical Education",
      "d": "Administrative Reforms"
    },
    "answer": "c",
    "explanation": "The Ministry of Corporate Affairs has introduced the Gautam H. Singhania - Raymond Limited MCA21 e-Governance programme with a view to providing Sanjay Dalmia - Gujarat Heavy Chemicals Limited all services relating to ROC offices on-line in e-Governance Venugopal Dhoot - Videocon Industries mode."
  },
  {
    "number": 1,
    "text": "Gujarat Heavy Chemicals Ltd. (a) Ministry of Science and Technology B. Gautam H. Singhania 2. Raymond Ltd. (b) Ministry of Health and Family Welfare C. Sanjay Dalmia 3. Vedanta Resources (c) Ministry of Environment and Forests D. Venugopal Dhoot 4. Videocon Group (d) Ministry of Chemicals and Fertilizers Codes: 119. With which one of the following has the B.K. Chaturvedi (a) A-3; B-1; C-2; D-4 (b)",
    "year": "2009",
    "options": {
      "a": "Review of Centre-State relations",
      "c": "A-3; B-2; C-1; D-4",
      "d": "A-4; B-2; C-1; D-3"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 110,
    "text": "In which one of the following States has India’s largest (b) Review of Delimitation Act private sector sea port been commissioned recently?",
    "year": "2009",
    "options": {
      "a": "Andhra Pradesh",
      "b": "Karnataka",
      "c": "Tax reforms and measures to increase revenues",
      "d": "Price reforms in the oil sector"
    },
    "answer": "a",
    "explanation": "India's largest private sector sea port was inaugurated at Krishnapatnam in Nellore district of Andhra Pradesh. The H 28 Topicwise Solved Papers new port opened a new gateway to South India through the"
  },
  {
    "number": 120,
    "text": "In the context of global economy, which one of the following 111. In India, who is the Chairman of the National Water pairs is not correctly matched?",
    "year": "2009",
    "options": {
      "a": "JP Morgan Chase : Financial Services",
      "b": "Roche Holding AG : Financial Services",
      "c": "WL Ross & Co. : Private Equity Firm",
      "d": "Warburg Pincus : Private Equity Firm"
    },
    "answer": "b",
    "explanation": "JPMorgan Chase - Investment banking company transport and will be able to shed the tag of a landlocked Roche Holding AG - Health Care Company state. W L Ross & Co. - Private Equity Firm Warburg Pincus - Private Equity Firm (ii) Rajasthan wants to develop artificial inland shipping"
  },
  {
    "number": 123,
    "text": "In the union budget 2011-12, a full exemption from the basic List-I List-II customs duty was extended to the bio-based asphalt (bioasphalt). (Famous Person) (Well known as) What is the importance of this material ? [2011 - I] A. Anna Hazare 1. Lawyer 1. Unlike traditional asphalt, bio-asphalt is not based on B. Deepak Parekh 2. Banker fossil fuels. C. GVK Reddy 3. Gandhian and social activist 2. B",
    "year": "2009",
    "options": {
      "c": "2 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "answer": "b",
    "explanation": "It is based on renewable resources like sugar, molasses,"
  },
  {
    "number": 3,
    "text": "to provide for wage loss due to pregnancy and 1. It is a centrally sponsored scheme for developing every confinement city of our country into Smart Cities in a decade. Which of the statements given above is/are correct? 2. It is an initiative to identify new digital technology (a) 1 and 2 only (b) 2 only innovations for solving the many problems faced by (c) 3 only (d) 1, 2 and 3 our country. 128.",
    "year": "2015-I",
    "options": {
      "a": "Odia",
      "b": "Konkani decade.",
      "c": "Bhojpuri",
      "d": "Assamese Select the correct answer using the code given below:"
    },
    "answer": "d",
    "explanation": "Director Dev Bengal has made a full length feature test inning. film, starring Rahul Bose, on Upamanyu Chatterjee’s novel"
  },
  {
    "number": 129,
    "text": "Indira Gandhi Prize for Peace, Disarmament and Development (a) 1 and 3 only (b) 2 only for 2014 was given to which one of the following?",
    "year": "2015-I",
    "options": {
      "a": "Bhabha Atomic Research Centre",
      "c": "3 only",
      "d": "2 and 3 only"
    },
    "answer": "c",
    "explanation": "Indian space agency ISRO was conferred the Indira in the Indian judicial system. Gandhi Prize for Peace, Disarmament and Development for"
  },
  {
    "number": 1,
    "text": "Service providers 2. Data centres (d) Tata Institute of Fundamental research 3. Body corporate 130. Recently, linking of which of the following rivers was Select the correct answer using the code given below: undertaken?",
    "year": "2016-I",
    "options": {
      "a": "1 only",
      "b": "1 and 2 only",
      "c": "3 only",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 1,
    "text": "The families coming under the category of 'below (a) To lessen the Government of India's perennial burden poverty line (BPL)' only are eligible to receive of fiscal deficit and current account deficit subsidised grains. (b) To support the infrastructure projects of Central and 2. The eldest woman in a household, of age 18 years or State Governments above, shall be the head of the household for the",
    "year": "2019-I",
    "options": {
      "a": "1 and 2",
      "b": "2 only",
      "c": "1 and 3",
      "d": "3 only"
    },
    "answer": "c",
    "explanation": "U.A.E, Kenya and Holland are the non-test playing"
  },
  {
    "number": 151,
    "text": "Among the agricultural commodities imported by India, 1. A substantial saving in seed material is when ‘bud which one of the following accounts for the highest imports chip settings’ are raised in a nursery and in terms of value in the last five years?",
    "year": "2019-I",
    "options": {
      "a": "Spices",
      "b": "Fresh fruits"
    },
    "answer": "d",
    "explanation": "From the data released by the Commerce Ministry: • page 156: “Prices of rice and wheat remained stable Import in ` Cr. 2017 2018 since 2014 due to adequate supply and also due to Vegetable Oil 5433 5103.6 maintenance of adequate buffer stock of rice and wheat (by FCI)” So, #3 is correct. So Option a eliminated. Pulses 1357.4 976.37 • Page 210: “Sale of wheat and rice is undertaken Fruits & vegetables 1329 1309.3 through Open Market Sale Scheme (OMSS) so as to Export data of spices is given but i"
  },
  {
    "number": 3,
    "text": "Aadhaar is mandatory for obtaining insurance 1. Minimum Support Price 2. Government’s trading products. 3. Government’s stockpiling 4. Consumer subsidies 4. Aadhar is mandatory for getting benefits funded out Select the correct answer using the code given below: of the Consolidate fund of India. (a) 1,2 and 4 only (b) 1,3 and 4 only Which of the statements give above is/are correct? (c) 2 and 3 on",
    "year": "1996",
    "options": {
      "a": "UAE, Kenya and Canada to win the title?",
      "b": "UAE, Kenya and Hong Kong",
      "c": "UAE, Kenya and Holland",
      "d": "Canada, Kenya and Hong Kong"
    },
    "answer": "d",
    "explanation": "Director Dev Bengal has made a full length feature test inning. film, starring Rahul Bose, on Upamanyu Chatterjee’s novel"
  },
  {
    "number": 2,
    "text": "India beat Pakistan in the South Asian Federation (a) Albert Costa (b) Juan Carlos Ferrero games final (c) Andra Agassi (d) Pete Sampras 3. India had by then qualified for the Atlanta Olympics 13. In the FIFA World Cup Football event in the year 2002, the (a) 1, 2 and 3 are correct (b) 1 and 2 are correct number of goals scored by Ronaldo of Brazil was:",
    "year": "2003",
    "options": {
      "a": "6",
      "b": "7",
      "c": "1 and 3 are correct",
      "d": "2 and 3 are correct"
    },
    "answer": "b",
    "explanation": "India qualified for Atlanta Olympic in Hockey on 19-28 this record was broken by Brian Lara of West Indies with January 1996 in Barcelona, so till 1995 India had not qualified 375 runs, this was broken by Mathew Hayden with 380 for Atlanta Olympic. runs but recently Lara broke his record with 400 runs in a"
  },
  {
    "number": 14,
    "text": "The record for the highest score in an innings in Test Cricket (a) R.K. Narayan’s Malgudi Days is now being held by M. Hayden.Immediately prior to him, (b) Salman Rushdie’s Midnight’s Children the three record holders were:",
    "year": "2004",
    "options": {
      "a": "Don Bradman, Sunil Gavaskar and Colin Cowdrey",
      "b": "Len Hutton, Peter May and Vivian Richards",
      "c": "Vikram Seth’s A suitable Boy",
      "d": "Upamanyu Chatterjee’s English August"
    },
    "answer": "c",
    "explanation": "Hanif Mohammaed of Pakistan scored 356 Runs which nations who participated in 1996 World Cup. was broken by Garfilled Sobers with a score of 365 runs,"
  },
  {
    "number": 4,
    "text": "Olympics 2004 is to be held in:",
    "year": "1998",
    "options": {
      "a": "Johannesberg",
      "b": "Capetown",
      "c": "Hanif Mohammed, Garfield Sobers and Brian Lara",
      "d": "Bob Cowper, Bill Lawry and Brian Lara"
    },
    "answer": "c",
    "explanation": "The 2004 Olympic was held in Athens in Greece which Wimbledon 2004 – Maria Sharapova is ancient Rome. U.S Open – Svetlana Kuznetsova"
  },
  {
    "number": 15,
    "text": "Match List-I (Lawn Tennis Tournament) with List-II (Winner 5. To reach the final of first grand slam of the year 2000, Martina of women singles) and select the correct answer using the Hingis defeated:",
    "year": "2000",
    "options": {
      "a": "Lindsay Davenport",
      "b": "Jennifer Capriati List-I List-II",
      "c": "Sarena William"
    },
    "answer": "b",
    "explanation": "The correct match is given below: “English August”. French Open 2004 – Anastsia"
  },
  {
    "number": 6,
    "text": "In the year 2001, in which one of the following events of Tournament) Singles) women’s singles did Venus Williams defeat Serena Williams A. French Open : 2004 1. Svetlana to win the title?",
    "year": "2002",
    "options": {
      "a": "Australian Open 2001",
      "b": "French Open 2001 B. Wimbledon : 2004"
    },
    "answer": "d",
    "explanation": "In U.S. Open 2001, Venus William defeated Serena"
  },
  {
    "number": 16,
    "text": "Of which one of the following games is Shanmugham (a) Grant Hackett (b) Ian Thorpe Venkatesh an outstanding player?",
    "year": "2005",
    "options": {
      "a": "Table Tennis",
      "b": "Hockey",
      "c": "Michael Phelps",
      "d": "Roman Sloudnov"
    },
    "answer": "c",
    "explanation": "He is mid-fielder in Indian football team. Conchita Martinez 6-3,6-2."
  },
  {
    "number": 17,
    "text": "Which countries played in the Lawn Tennis Davis Cup Final (a) Gopichand (b) Hendrawan in the year 2004 ?",
    "year": "2005",
    "options": {
      "c": "Ji Xin Peng",
      "d": "Peter Gade"
    },
    "answer": "b",
    "explanation": "Spain and U.S.A. played in the Lawn Tennis Davis Williams to lift the title. This was first time in the history of Cup Final in the year 2004 grand slam that two sisters have played the final."
  },
  {
    "number": 10,
    "text": "Time Montgomery set a new world record at the IAAF Grand (a) Switzerland and United States of America. Prix final in the year 2002 in:",
    "year": "2003",
    "options": {
      "a": "Long Jump",
      "b": "Spain and United States of America.",
      "c": "Australia and Argentina",
      "d": "High Jump"
    },
    "answer": "c",
    "explanation": "Tim Montgomery set a new world record at the IAAF in July 2000. Russia did not participate in this event. Grand Prix Final in the year 2002 in 100 m Dash."
  },
  {
    "number": 18,
    "text": "Who did Croatia defeat in the Davis Cup-2005 Finals to win Select the correct answer using the code given below: the Davis Cup-2005?",
    "year": "2006",
    "options": {
      "a": "1 and 2 only",
      "b": "3 and 4 only",
      "c": "1, 2 and 3 only",
      "d": "1, 2, 3 and 4"
    },
    "answer": "b",
    "explanation": "The 2005 Davis Cup was the 94th edition of the most"
  },
  {
    "number": 21,
    "text": "Parimarjan Negi has excelled in which one of the following (c) Argentina games?",
    "year": "2007",
    "options": {
      "a": "Billiards",
      "b": "Swimming",
      "d": "Spain"
    },
    "answer": "c",
    "explanation": "Parimarjan Negi is a chess Grandmaster from India. year 2002."
  },
  {
    "number": 20,
    "text": "Who among the following bowlers have taken more than 500 wickets in Test Cricket?",
    "year": "2007",
    "options": {
      "a": "Ana Ivanovic",
      "b": "Cara Black 1. Wasim Akram 2. Richard Hadlee",
      "c": "Dinara Safina",
      "d": "Jelena Jankovic 3. Glen McGrath 4. Courtney Walsh HINTS & SOLUTIONS 1."
    },
    "answer": "b",
    "explanation": "Glen McGrath and Courtney Walsh are the only"
  }
]