[
  {
    "number": 126,
    "text": "What is the most logical, rational and crucial message that adaptation actions are a matter of intense debate in the multilateral is implied in the above passage? negotiations under the United Nations Framework Convention (a) Under the present circumstances, India should on Climate Change (UNFCCC). The Convention squarely puts completely avoid all trade liberalisation policies and the responsibili",
    "year": "2016-II",
    "options": {
      "a": "Biodiversity sustains the ability of nature to recycle",
      "b": "We cannot get potable water without the existence of",
      "c": "Parliamentary democracy is possible only if the water Government has wider discretionary power.",
      "d": "None of the above statements is a logical assumption living organisms that can be made from this passage."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 140,
    "text": "Which among the following is the most logical corollary to 143. Which one of the following is the message that is the above passage ?",
    "year": "2016-II",
    "options": {
      "a": "Launching more welfare schemes and allocating more",
      "b": "Need for a radical restructuring of our entire public",
      "c": "Need to integrate banking and non-banking",
      "d": "Need to promote financial inclusion needed at present PASSAGE"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "There is a need to promote greater awareness on safe developing countries sanitation practices in urban areas. (b) Improving food security is a far more complex issue Which of the statements given above is/are correct? than climate adaptation (a) 1 only (b) 2 only (c) Every developmental activity is directly or indirectly (c) Both 1 and 2 (d) Neither 1 nor 2 linked to climate adaptation PASSAGE (d",
    "year": "2016-II",
    "options": {
      "a": "Nature has created a great diversity in human society type of diet is best for us",
      "b": "Any given human society is always short of its wants PASSAGE",
      "c": "Social life is a specific characteristic of man",
      "d": "From a global perspective, we still do not know which"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 149,
    "text": "Which among the following is the most logical assumption (a) the antithesis of Politics and Economics that can be made from the above passage?",
    "year": "2016-II",
    "options": {
      "a": "About 10,000 years ago, the domestication of animals",
      "b": "the interrelationship of Politics and Economics",
      "c": "the predominance of Economics over Politics took place in some parts of the world",
      "d": "the predominance of Politics over Economics"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 147,
    "text": "Which among the following is the most logical and (a) the entire national output produced and consumed in rational inference that can be made from the above industrialized countries passes through commercial passage?",
    "year": "2016-II",
    "options": {
      "a": "Organic farming should immediately replace",
      "b": "the existence of a non-commercialized sector in mechanised and chemical dependant agricultural different underdeveloped countries renders the practices all over the world national income comparisons o",
      "c": "no part of national output should be produced and in order to mitigate climate change. consumed without passing through commercial",
      "d": "a part of the national output being produced and"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 148,
    "text": "What is the critical message conveyed by the above atmosphere. This is largely because of increased plant growth. passage?",
    "year": "2016-II",
    "options": {
      "a": "Our increasing demand for foods sourced from supports plant growth. As trees and other vegetation flourish in animals puts a greater burden on our natural a carbon dioxide-rich future, their roots cou",
      "b": "Diets based on grains, nuts, fruits and vegetables are soil carbon and its release into the atmosphere as carbon dioxide. best suited for health in developing countries"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Setting up more agro-based industries The issue is where to draw the line. Over the years, the emphasis 2. Improving the price affordability by the poor seems to have tilted in favour of greater internal accountability of 3. Regulating the conditions of marketing the civil services to the political leaders of the day who in turn are 4. Providing food subsidy to one and all expected to be externall",
    "year": "2016-II",
    "options": {
      "a": "to find sufficient land for agriculture and to expand should be reviewed and laws and regulations framed to ensure food processing industries external accountability of civil services. The proposed Ci",
      "b": "to eradicate hunger in underdeveloped countries Services Bill seeks to address some of these requirements. The",
      "c": "to achieve a balance between the production of food respective roles of professional civil services and the political and non-food items executive should be defined so that professional managerial",
      "d": "to achieve a balance between demand for and supply functions and management of civil services are depoliticized. For of food this purpose, effective statutory civil service boards should be 5337_DBE G"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Human beings can be duty bound only if they believe devolution of authority to bring government and decision in god making closer to the people also helps to enhance accountability. 3. Religious traditions are essential to practice and 156. According to the passage, which of the following factor/ understand justice factors led to the adverse consequences for governance/ Which of these assumption(s",
    "year": "2016-II",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Political executive is an obstacle to the accountability of the civil services to the society PASSAGE 2. In the present framework of Indian polity, the political executive is no longer accountable to the society Biomass as fuel for power, heat, and transport has the highest Which of these assumptions is/are valid? mitigation potential of all renewable sources. It comes from (a) 1 only (b) 2 only a",
    "year": "2016-II",
    "options": {
      "a": "Civil services are not accountable to the society they collection. Energy crops, if not managed properly, compete with are serving food production and may have undesirable impacts on food",
      "b": "Educated and enlightened persons are not taking up prices. Biomass production is also sensitive to the physical political leadership impacts of a changing climate.",
      "c": "The framers of the Constitution did not envisage the Projections of the future role of biomass are probably problems being encountered by the civil services overestimated, given the limits to the sust",
      "d": "There is a need and scope for reforms to improve the supply, unless breakthrough technologies substantially increase accountability of civil services productivity. Climate -energy models project that "
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 159,
    "text": "According to the passage, which one of the following is could increase nearly four-fold to around 150 – 200 exajoules, not a means of enhancing internal accountability of civil almost a quarter of world primary energy in 2050. However the services?",
    "year": "2016-II",
    "options": {
      "b": "Supervision by Central Vigilance Commission forest resources ranges from 80 – 170 exajoules a year by 2050,",
      "c": "Judicial review of executive decisions and only part of this is realistically and economically feasible. In",
      "d": "Seeking accountability through enhanced addition, some climate models rely on biomass-based carbon participation by people in decision making process capture and storage, an unproven technology, to ac"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Some climate-energy models suggest that the use of suggestion of a friend-who fluctuates from opinion to opinion biomass as a fuel for power generation helps in and veers from plan to plan-can never accomplish anything. He mitigating greenhouse gas emissions will at best be stationary and probably retrograde in all. It is 2. It is not possible to use biomass as a fuel for power only the man who fi",
    "year": "2016-II",
    "options": {
      "a": "In our agricultural practices, we have become heavily",
      "b": "Polar bears can be shifted to South Pole to ensure",
      "c": "Without the presence of polar bears, the food chains",
      "d": "Climate change poses a threat to the survival of"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 170,
    "text": "Which among the following is the most crucial message 173. The main idea of the passage is that [2017 - II] conveyed by the above passage? [2017 - II] (a) it is essential for human beings to work (a) The ideas of purity and pollution are so deep-rooted (b) there should be a balance between work and leisure that they cannot be removed from the minds of the (c) working is a tyranny which we have to ",
    "year": "2017-II",
    "options": {
      "a": "All problems of governance can be solved by using international community is yet to recognize this new category of digital technologies. migrants. There is no consensus on the definition and status of",
      "b": "Speaking of digital technologies is speaking of our climate refugees owing to the distinct meaning the term refugees life and living. carry under international laws. There are still gaps in",
      "c": "Our creativity and imagination cannot be expressed understanding how climate change will work as the root cause without digital media. of migration. Even if there is recognition of climate refugees, w",
      "d": "Use of digital systems is imperative for the existence is going to provide protection? More emphasis has been given of mankind in future. to international migration due to climate change. But there is"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 187,
    "text": "Which of the following is the most rational inference Asia face the risk of falling into 'middle-income trap'. It means from the above passage? [2017 - II] that average incomes in these countries, which till now have (a) The world will not be able to cope with large-scale been growing rapidly, will stop growing beyond a point-a point migration of climate refugees. that is well short of incomes in ",
    "year": "2018-II",
    "options": {
      "a": "Mass production of meat through industrial farming of rice, wheat, milk, fruits and vegetables. India is still home to is cheap and is suitable for providing protein nutrition a quarter of all underno",
      "b": "Meat-producing industry violates the laws against the households is on food. cruelty to animals."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 194,
    "text": "Which among the following is the most logical corollary (c) Mass production of meat through industrial farming to the above passage? [2017 - II] is undesirable and should be stopped immediately. (a) Increasing the efficiency of farm-to-fork value chain (d) Environmental cost of meat production is unsustainable is necessary to reduce the poverty and malnutrition. when it is produced through industr",
    "year": "2018-II",
    "options": {
      "a": "The conflict between man and wildlife cannot be",
      "b": "Safe wildlife corridors between protected areas is an",
      "c": "India needs to declare more protected areas and set",
      "d": "State autonomy is a prerequisite for a federation."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The strategy of conservation of wildlife by relocating thing. Over and beyond the dangers with which it threatens them from one protected area to another is not often the present, it opens up as nothing else can, the vision of a successful. possible happy world; a world without poverty, without war, 2. India does not have suitable legislation to save the with little illness. Science, whatever unpl",
    "year": "2018-II",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Climate change is a complex policy issue and also a and free access to its resources. development issue for many countries. (b) Melting of summer ice in the Arctic leads to changes 3. Ways and means of finance must be found to enable in the geopolitics. developing countries to enhance their adaptive capacity. (c) The Arctic region will solve the world’s future Which of the above assumptions is/are",
    "year": "2018-II",
    "options": {
      "a": "India should revise its PDS. passage?",
      "b": "India should not be a member of WTO.",
      "c": "For India, food security collides with trade. fuels due to their increasing awareness of health",
      "d": "India provides food security to its poor. hazards."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "India continues to be a developing country economic, cultural and indeed linguistic and pedagogic issues, essentially due to its faulty education system. factors that prevent children from weaker sections and 2. Today’s learners need to acquire new-age skill-sets. disadvantaged groups, as also girls, from regularly attending 3. A good number of Indians go to some developed and complementing elemen",
    "year": "2018-II",
    "options": {
      "a": "Obesity has become an epidemic all over the world. tuition centres, and bypass childhood.",
      "b": "A lot of people are obsessed with attaining a perfect"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "The Right to Education guarantees 100% enrolment (a) Preserving crop genetic diversity is an insurance of children in the schools. against the effects of climate change. 3. The Right to Education intends to take full advantage (b) Despite great risks, monoculture is the only way of demographic dividend. to ensure food security in the world. Which of the above assumptions is/are valid? (c) More and",
    "year": "2018-II",
    "options": {
      "b": "Giving pecuniary benefits to teachers to motivation them passage and answer the four items that follow. Your answers",
      "c": "Understanding the socio-cultural background of children to these items should be based on the passage only.",
      "d": "Inculcating learning through activities and discovery F 142 Topicwise Solved Papers"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 211,
    "text": "What is the essential message in this passage?",
    "year": "2018-II",
    "options": {
      "a": "The Right to Education now is a Fundamental Right. widespread presumption that scientific and spiritual views are",
      "b": "The Right to Education enables the children of poor incompatible. and weaker sections of the society to attend schools."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 214,
    "text": "Which of the following is the most logical and rational (c) The Right to Free and Compulsory Education should inference that can be made from the above passage? include quality education for all.",
    "year": "2018-II",
    "options": {
      "a": "It is the faith and not science that can finally solve that all children attend schools. all the problems of mankind.",
      "c": "There are some very fundamental questions which to these items should be based on the passages only. cannot be answered by either science or faith.",
      "d": "The Government as well a parents should ensure"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2100,
    "text": "Unlike Europe and North America, where and am anxious that India should rid herself of all shackles that only three to four percent of population is engaged in agriculture, bind and contain her and divide her people, and suppress vast around 47 percent of India’s population is dependent upon numbers of them, and prevent the free development of the body agriculture. Even if India continues to do we",
    "year": "2018-II",
    "options": {
      "a": "he is not able to see the relevance of the past",
      "b": "there is not much to be proud of to India.",
      "c": "he is not interested in the history of India",
      "d": "they obstruct her physical and spiritual growth"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 213,
    "text": "Which of the following is the most logical corollary to Haryana and western Uttar Pradesh, and site quality decline-a the above passage?",
    "year": "2018-II",
    "options": {
      "a": "With more options for food come more risks. monotonous monoculture of rice/wheat across the Indian plains.",
      "b": "Food processing is the source of all foodborne A major consequence of deforestation is that it relates to adverse illnesses. alterations in the hydrology and related soil and nutrient losses.",
      "c": "We should depend on locally produced food only. The consequences of deforestation invariably arise out of site"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Conservation of natural water sources ultimate consequences of site desertification are soil 2. Conservation of wider gene pool degradation, alteration in available water and its quality, and 3. Existing crop management practices the consequent decline in food, fodder and fuelwood yields 4. Migration corridors essential for the economic well-being of rural communities. Select the correct answer us",
    "year": "2018-II",
    "options": {
      "c": "3 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Desertification is a phenomenon in tropical areas limit human population. only. (c) Reducing our consumerism is very much in our own 2. Deforestation invariably leads to floods and interest. desertification. (d) Knowledge of biological systems can only help us Which of the above assumptions is/are valid? save this planet. (a) 1 only (b) 2 only (c) Both 1 and 2 (d) Neither 1 nor 2 PASSAGE PASSAGE S",
    "year": "2018-II",
    "options": {
      "a": "leadership can be taught through war experience crops, breeds and their wild relatives. Relatively intact only ecosystems, such as forested catchments, mangroves, wetlands,",
      "b": "leadership can be acquired as well as taught can buffer the Impacts of climate change. Under a changing",
      "c": "the results of training show that more people acquire climate, these ecosystems are themselves at risk, and leadership than are expected management approaches will need to be more proactive and",
      "d": "despite rigorous instruction few leaders are produced F 144 Topicwise Solved Papers"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 225,
    "text": "Which one of the following is the most logical, rational Directions for the following 7 (seven) items: Read the following and crucial inference that can be derived from the above five passages and answer the items that follow each passage. passage?",
    "year": "2019-II",
    "options": {
      "a": "If malnourished condition in children is caused by gut only. bacteria, it cannot be treated.",
      "b": "The guts of malnourished babies should be inoculated PASSAGE with mature microbiomes. India’s economic footprint, given its population, still remains small",
      "c": "Babies of malnourished mothers should be fed with compared to the US, the European Union or China. It has much to dairy milk fortified with sialylated oligosaccharides learn from other economies, yet ",
      "d": "Research on benign effects of gut bacteria on nutrition term regulatory system based on collaboration rather than the has policy implications. current top-down approach. Regulations seek desirable out"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Processed probiotic foods are a solution to treat the economic growth – or less restrictive alternatives. Regulations children suffering from malnutrition due to immature may be used to protect local markets at the expense of more widely gut bacteria composition. shared prosperity in the future. Additionally, regulations inevitably 2. The babies of malnourished mothers gererally tend to result in ",
    "year": "2019-II",
    "options": {
      "a": "A better regulatory system will help India achieve the Antarctic Peninsula than the global average over the past five size of economy appropriate to its population. decades. Researchers have now found",
      "b": "In a competitive global economy, India must use causing a loss of species diversity among benthos in the coastal regulations strategically. waters off the Antarctic Peninsula, impacting an entire seaf",
      "c": "Regulations in India do not favour its integration with ecosystem. They believe increased levels of suspended sediment today’s hyper competitive global economy. in water to be the cause of the dwindli",
      "d": "Job creation and economic growth should be dominant region. considerations in developing India’s regulatory"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "India needs to make sufficient legislation for governing (a) Public research institutions should take the lead in food processing industry. GM technology and prioritise the technology agenda. Which of the above assumptions is/are valid? (b) Developing countries should raise this issue in WTO (a) 1 and 2 only (b) 3 only and ensure the abolition of Intellectual Property Rights. (c) 1 and 3 only (d) ",
    "year": "2019-II",
    "options": {
      "a": "against the monopoly of builders and the interests of elite groups. Political theorists no doubt have to take history of injustice, for",
      "b": "against the need for global and smart cities. example, untouchability, seriously. The concept of historical",
      "c": "in favour of planning cities mainly for working class injustice takes note of a variety of historical wrongs that continue and poor people. into the present in some form or the other and tend to resis",
      "d": "in favour of participation of peoples’ groups in city Two reasons might account for resistance to repair. One, not only planning. are the roots of injustice buried deep in history, injustice itself co"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "most of modern economic growth is based on (a) Untouchability in India has not been taken seriously technological progress. by political theorists. 2. much of modern Indian economy does not nurture (b) Historical injustice is inevitable in any society and is sufficient symbiotic relationship with labour-intensive, always beyond repair. natural resource-based livelihoods. (c) Social discrimination ",
    "year": "2019-II",
    "options": {
      "c": "1, 2 and 3 only",
      "d": "1, 2, 3 and 4"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Removal of economic discrimination leads to removal PASSAGE of social discrimination. 2. Democratic polity is the best way to repair historical India has banking correspondents, who help bring people in the wrongs. hinterland into the banking fold. For them to succeed, banks cannot Which of the above assumptions is/are valid? crimp on costs. They also cannot afford to ignore investing in (a) 1 onl",
    "year": "2019-II",
    "options": {
      "a": "Efforts to bring people in India’s hinterland into the to start from and their culture will lead them as deep as philosophy banking system are not successful. and as high as art. Together it will impa",
      "b": "For meaningful financial inclusion, India’s banking existence. system needs more number of banking correspondents"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 248,
    "text": "What is the most logical and rational corollary to the appliances, thermostats, security and monitoring devices and above passage?",
    "year": "2019-II",
    "options": {
      "a": "Supporting small farmers is an important part of any trackers, certain medical implants and computer-like devices in agenda regarding environmentally sustainable automobiles. The IoT is expected to ex",
      "b": "Poor countries have little role to play in the mitigation"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 245,
    "text": "Which one of the following statements is the most logical of global warming. and rational inference that can be made from the above (c) Due to a large number of farmer households, India will passage?",
    "year": "2019-II",
    "options": {
      "a": "Development of enabling technologies in India can be future. a big boost to its manufacturing sector.",
      "b": "India is not yet fully ready to adopt IoT in view of the security. imminent security challenges.",
      "d": "Only small-holder farmers in India can ensure food"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Governments and companies need to be adequately undermines its socio-economic structures. prepared to face the climate change. (b) India should be careful to protect its digital sovereignty 2. Extreme weather events will reduce the economic in global trade talks. growth of governments and companies in future. (c) India should charge monopoly rents from multinational 3. Ignoring climate change is a",
    "year": "2019-II",
    "options": {
      "a": "Big Data is the key resource in the digital space. Access to schooling for those coming of school age is close to",
      "b": "Big economies create Big Data. universal, but access to quality exhibits a sharp gradient with",
      "c": "Access to Big Data is the prerogative of developed socio-economic status Quotas for the weaker sections in private countries. schools is a provision introduced by the Right of Children to",
      "d": "Access to and possession of Big Data is a Free and Compulsory Education Act,"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 276,
    "text": "Which of the following is/are the most rational and logical rotovator to cut the leftover straw into pieces, which can be inference/inferences that can be made from the passage? ploughed back and will decompose very fast. All this is difficult 1. It is essential to rethink and redefine the economic role of with leftover paddy stalks that cannot be easily salvaged or the State in the quest for deve",
    "year": "2020-II",
    "options": {
      "a": "1 only 1. Farmers’ income will be higher with pulse cultivation",
      "b": "2 only than with paddy cultivation.",
      "c": "Both 1 and 2 2. Pulse cultivation causes less pollution as compared",
      "d": "Neither 1 nor 2 to paddy cultivation. 277. With reference to the above passage, the following 3. Pulse straw can be used to improve soil quality. assumptions have been made: 4. In the context of north"
    },
    "answer": "d",
    "explanation": "The inference drawn from the passage that it is genome editing does not require the transfer of genes from essential to rethink and redefine the economic role of the one plant to another. It further says that through genome State in the quest for development is not admissible. editing, the chosen genes can be altered precisely in a Similarly, India has not made effective implementation of manner akin to the natural process that helps plants to its policies in social sectors nor made sufficient i"
  }
]