[
  {
    "number": 16,
    "text": "(d) Let the angles be 4x, 3x and 2 x. 4x + 3x + 2x = 180° x = 20° P Q \\ angles are 80°, 60° and 40°. 17. (c) A = (20, 60) and B = (–40, –20) AB = é20-(-40 )ù 2 +é60-(-20 )ù 2 ë û ë û 22. (c) Let the maximum no of small pieces of cake be n. = 3600+6400 = 10000 = 100 Now, n(5 × 5 × 10) =5 × 30 × 30 18. (a) Let the minor diameter of ellipse = 2b 5´30´30 Major diameter of ellipse = 2a = 2(2b) n = = 18",
    "year": "1995",
    "options": {
      "a": "12",
      "b": "36",
      "c": "4",
      "d": "10"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "X and Y are two variables whose values at Y time are related to 1 1 1 1 each other as shown in Fig. (i). X is known to vary periodically (a) (b) (c) (d) 3 6 8 12 with reference to time as shown in Fig. (ii) 7. In a factory quality assurance test is conducted on various Figure (i) Figure (ii) samples for a specific characteristic value of the product. The values and the number of samples are as giv",
    "year": "1999",
    "options": {
      "a": "O t",
      "b": "O t Consider the following statements based on the table:"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The probability that X£15 is 0.64 2. The probability that 13<X£17 is greater than 0.64 Y Y 3. The probability that X = 15 is less than 0.22 Which of the above statements is/are not true? (c) O t (d) O t (a) 1 alone (b) 1 and 2 (c) 2 and 3 (d) 1, 2 and 3 8. A bag contains 20 balls, 8 balls are green, 7 are white and 5 are red. What is minimum number of balls that must be picked up from the bag blin",
    "year": "2000",
    "options": {
      "a": "4",
      "b": "7",
      "c": "11",
      "d": "16"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 9,
    "text": "A complete cycle of a traffic light takes 60 seconds. During (c) 7/1339 (d) 1/169 each cycle the light is green for 25 seconds, yellow for 5 5. In the given figure, if QRS is an equilateral triangle and TQS seconds and red for 30 seconds. At a randomly chosen is an isosceles triangle and x = 47°, then the value of y (in time, the probability that the light will not be green, is degrees) will be",
    "year": "1997",
    "options": {
      "a": "1/3",
      "b": "1/4",
      "c": "5/12",
      "d": "7/12 F 78 Topicwise Solved Papers"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 10,
    "text": "Three flags, each of different colour, are available for a can be turned upside down. What is the minimum total military exercise. Using these flags, different codes can be number of attempts in which the ‘T’ faces of all the 10 coins generated by waving",
    "year": "2003",
    "options": {
      "a": "4",
      "c": "8",
      "d": "Not possible Or"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 20,
    "text": "Ten identical particles are moving randomly inside a closed box. (iii) three flags in a different sequence of colours. What is the probability that at any given point of time all the ten The maximum number of codes that can be generated, is particles will be lying in the same half of the box?",
    "year": "2005",
    "options": {
      "a": "6",
      "b": "9",
      "c": "15",
      "d": "18 1 1 1 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 11,
    "text": "A two member committee comprising of one male and one (a) (b) (c) (d) female member is to be constituted out of five males and 2 5 29 11 three females. Amongst the females, Mrs. A refused to be a 21. Each of two women and three men is to occupy one chair out member of the committee in which Mr. B is taken as the of eight chairs, each of which numbered from 1 to 8. First, member. In how many differ",
    "year": "2003",
    "options": {
      "a": "11",
      "b": "12",
      "c": "13",
      "d": "14 out of the remaining six chairs. What is the maximum number"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 12,
    "text": "In a question of a test paper, there are five items each under of different ways in which this can be done?",
    "year": "2006",
    "options": {
      "a": "40",
      "b": "132",
      "c": "1440",
      "d": "3660 item under List-A with its corresponding correct item under"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 22,
    "text": "In a tournament, each of the participants was to play one List-B. Further, it is given that match against each of the other participants. Three players (i) no examinee has given the correct answer. fell ill after each of them had played three matches and had (ii) answers of no two examinees are identical to leave the tournament. What was the total number of Which is the maximum number of examinees",
    "year": "2004",
    "options": {
      "a": "24",
      "b": "26",
      "c": "119",
      "d": "129"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 13,
    "text": "Nine different letters are to be dropped in three different 23. There are three parallel straight lines. Two points, 'A' and letter boxes. In how many different ways can this be done? 'B', are marked on the first line, points, 'C' and 'D' are marked",
    "year": "2004",
    "options": {
      "a": "27",
      "b": "39",
      "c": "92",
      "d": "39 –3 third line. Each of these 6 points can move to any position"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The maximum number of triangles that can be drawn (a) 120 (b) 240 (c) 360 (d) 480 by joining these points is 18. 15. Three students are picked at random from a school having 2. The minimum number of triangles that can be drawn a total of 1000 students. The probability that these three by joining these points is zero. students will have identical date and month of their birth, is Which of the state",
    "year": "2004",
    "options": {
      "a": "1 only",
      "b": "2 only 3 3",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 24,
    "text": "A mixed doubles tennis game is to be played between two teams (each team consists of one male and one female.) 1 (c) (d) None of these There are four married couples. No team is to consist of a (365)2 husband and his wife. What is the maximum number of 16. On a railway route between two places A and B, there are 20 games that can be played?",
    "year": "2006",
    "options": {
      "a": "12",
      "b": "21",
      "c": "36",
      "d": "42 many types of new tickets will be required if each ticket is"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 25,
    "text": "3 digits are chosen at random from 1,2,3,4,5,6,7,8 and 9 issued for a one way journey?",
    "year": "2005",
    "options": {
      "a": "14",
      "b": "48",
      "c": "96",
      "d": "108 their product is odd?"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 17,
    "text": "2 men and 1 women board a bus in which 5 seats are vacant. (a) 2/3 (b) 5/108 (c) 5/42 (d) 8/42 One of these five seats is reserved for ladies. A women may or 26. In a question paper, there are four multiple choice type questions. may not sit on the seat reserved for ladies but a man can not sit Each question has five choices with only one choice for its on the seat reserved for ladies. In how many",
    "year": "2005",
    "options": {
      "a": "15",
      "b": "36",
      "c": "48",
      "d": "60"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 18,
    "text": "A square is divided into 9 identical smaller squares. 27. Each of eight identical balls is to be placed in the squares Six identical balls are to be placed in these smaller square shown in the figures given below in a horizontal direction such that each of the three rows gets at least one ball (one such that one horizontal row contains six balls and the other ball in one square only). In how many ",
    "year": "2005",
    "options": {
      "a": "27",
      "b": "36",
      "c": "54",
      "d": "81"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 19,
    "text": "There are 10 identical coins and each one of them has ‘H’ engraved on its one face and ‘T’ engraved on its other face. These 10 coins are lying on a table and each one of them has ‘H’ face as the upper face. In one attempt, exactly four (neither more nor less) coins (a) 38 (b) 28 (c) 16 (d) 14 5337_DBE Permutation, Combination & Probability F 79 28. Each of the 3 persons is to be given some identi",
    "year": "2008",
    "options": {
      "a": "21",
      "b": "24",
      "c": "27",
      "d": "33"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 29,
    "text": "In the figure shown below, what is the maximum number of different ways in which 8 identical balls can be placed in the small triangles 1, 2, 3 and 4 such that each triangle contains at least one ball?",
    "year": "2007",
    "options": {
      "a": "64",
      "b": "81",
      "c": "84",
      "d": "108"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 39,
    "text": "There are 6 different letters and 6 correspondingly 1 addressed envelopes. If the letters are randomly put in the envelopes, what is the probability that exactly 5 letters go into the correctly addressed envelopes?",
    "year": "2008",
    "options": {
      "a": "Zero",
      "b": "1/6",
      "c": "1",
      "d": "5/6 2"
    },
    "answer": "a",
    "explanation": "As there are 6 letters and envelopes, so if exactly 5 are 3 Case II : When balls lie along the vertical straight line 3 into correctly addressed envelopes, then the remaining 1 will balls can be put in any of the 3 boxes along the vertical row automatically be placed in the correctly addressed envelope. in 3C ways. Thus, the probability that exactly 5 go into the correctly 3 Now, as there are 4 vertical rows, so number of ways for addressed envelope is zero. Case II = 3C × 4 = 4"
  },
  {
    "number": 40,
    "text": "There are two identical red, two identical black and two 30. Amit has five friends: 3 girls and 2 boys. Amit’s wife also has 5 identical white balls. In how many different ways can the friends: 3 boys and 2 girls. In how many maximum number of balls be placed in the cells (each cell to contain one ball) different ways can they invite 2 boys and 2 girls such that two shown below such that balls of ",
    "year": "2007",
    "options": {
      "a": "24",
      "b": "38",
      "c": "46",
      "d": "58"
    },
    "answer": "c",
    "explanation": "Let us start with Red colour 3 Case III : Balls lie along the 2 diagonal lines towards the left Where, R = Red, B = Black, W = White and 2 diagonal lines towards the right. R B R W Number of ways = 2 + 2 = 4 Number of ways, when balls lie along the line = 12 + 4 + 4 R W R B = 20 R B R B Number of ways when balls don't lie along the line = Total R W R W number of ways – number of ways when balls lie along the R B W R line. = 220 – 20 = 200. R W B R"
  },
  {
    "number": 31,
    "text": "Five balls of different colours are to be placed in three different boxes such that any box contains at least one ball. (a) 15 (b) 18 (c) 24 (d) 30 What is the maximum number of different ways in which 41. A person has 4 coins each of different denomination. What this can be done?",
    "year": "2007",
    "options": {
      "a": "90",
      "b": "120",
      "c": "150"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 32,
    "text": "All the six letters of the name SACHIN are arranged to form different (a) 16 (b) 15 (c) 12 (d) 11 words without repeating any letter in any one word. The words so 42. How many numbers lie between 300 and 500 in which 4 formed are then arranged as in a dictionary. What will be the comes only one time?",
    "year": "2009",
    "options": {
      "a": "99",
      "b": "100",
      "c": "110",
      "d": "120"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 43,
    "text": "How many three-digit numbers can be generated from 1, 2, 33. Three dice (each having six faces with each face having one 3, 4, 5, 6, 7, 8, 9 such that the digits are in ascending order? number from 1 to 6) are rolled. What is the number of",
    "year": "2009",
    "options": {
      "a": "80",
      "b": "81",
      "c": "83",
      "d": "84 number 2?"
    },
    "answer": "d",
    "explanation": "Any 3 digits out of 9 can be selected in 9C ways. 5! 3 It can be done in 5C ways = =10 Now, these three digits can be arranged among themselves 2 2!´3! in ascending order in only 1 way."
  },
  {
    "number": 30,
    "text": "2. The number of games in which both players were girls is 78. Which of the statements given above is/are correct? (a) 1 only (b) 2 only (c) Both 1 and 2 (d) Neither 1 nor 2 45. A question paper had ten questions. Each question could (a) 144 (b) 200 (c) 204 (d) 216 only be answered as True (T) or False (F). Each candidate 35. Groups each containing 3 boys are to be formed out of 5 answered all the",
    "year": "2010",
    "options": {
      "a": "20",
      "b": "40",
      "c": "512",
      "d": "1024"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 46,
    "text": "A person X has four notes of Rupee 1, 2, 5 and 10 36. In how many different ways can four books A, B, C and D be denomination. The number of different sums of money she arranged one above another in a vertical order such that the can form from them is",
    "year": "2010",
    "options": {
      "a": "16",
      "b": "15",
      "c": "12",
      "d": "8"
    },
    "answer": "b",
    "explanation": "Different sums of money can be formed by taking one, Task two, three and all the four notes together. No. of different sums= 4C 1 + 4C 2 + 4C 3 + 4C 4 T 2 = 4 + 6 + 4 + 1 = 15 1 2 3 4 5"
  },
  {
    "number": 47,
    "text": "When ten persons shake hands with one another, in how 37. A schoolteacher has to select the maximum possible number many ways is it possible?",
    "year": "2010",
    "options": {
      "a": "20",
      "b": "25",
      "c": "40",
      "d": "45 In how many groups any particular student will be included?"
    },
    "answer": "d",
    "explanation": "First person can shake hand with the other 9 i.e, in 9 No. of ways for Task T = 2 ways. Second person can shake hand with the remaining 8 1 No. of ways for Task T = 1 persons and so on. 2 No. of ways for Task T = 3 \\ total no. of hands shaked = 9 + 8 + ....... + 2 + 1 3 No. of ways for Task T = 3 4 = 9(9+1) =45 No. of ways for Task T 5 = 3 Total number of ways for condition II 2 = 3 + 3 + 3 + 2 +1 = 12"
  },
  {
    "number": 48,
    "text": "In how many ways can four children be made to stand in a line",
    "year": "2008",
    "options": {
      "a": "6",
      "b": "8",
      "c": "10",
      "d": "12"
    },
    "answer": "b",
    "explanation": "Take, A and B to be always together as a single entity. Total number of ways for condition I and II = 12 + 12 = 24 Now, total no. of children = 4 – 2 + 1 = 3"
  },
  {
    "number": 49,
    "text": "There are 100 students in a particular class. 60% students 2. The total number of persons who read either one play cricket, 30% student play football and 10% students magazine or both the magazines is twice the number of play both the games. What is the number of students who persons who read both the magazines. play neither cricket nor football ? [2011 - II] Select the correct answer using the co",
    "year": "2016-II",
    "options": {
      "a": "3",
      "b": "4",
      "c": "5",
      "d": "6"
    },
    "answer": "b",
    "explanation": "Given, n (U) = 100 2 2 Number of students who play cricket = 60 6´5 4´3 = 6C +4C , = + , = 15 + 6 = 21 i.e. n(C) = 60 2 2 2´1 2 Number of students who play football = 30"
  },
  {
    "number": 1,
    "text": "2 and 3 are not to immediately follow each other 51. Twelve people form a club. By picking lots, one of them will 2. 1 is not to be immediately followed by 3 host a dinner for all once in a month. The number of dinners 3. 4 is not to appear at the last place a particular member has to host in one year is 4. 1 is not to appear at the first place",
    "year": "2015-II",
    "options": {
      "a": "One",
      "b": "Zero",
      "c": "Three",
      "d": "Cannot be predicted"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 52,
    "text": "There are 5 tasks and 5 persons. Task-l cannot be assigned 60. A bag contains 20 balls. 8 balls are green, 7 are white and to either person-l or person-2. Task-2 must be assigned to 5 are red. What is the minimum number of balls that must either person-3 or person-4. Every person is to be assigned be picked up from the bag blindfolded (without replacing one task. In how many ways can the assignmen",
    "year": "2015-II",
    "options": {
      "a": "6",
      "b": "12",
      "c": "24",
      "d": "144"
    },
    "answer": "c",
    "explanation": "Here are five persons, and 5 tasks (15x+yx)´100 So, When T task is fixed for person 3 3xy + 5x = (15x+yx)+ 2 100 Task Þ 3xy + 5x = 30x + 2xy ... (ii) Þ 30x + 2yx = 3xy + 5x T 2 Þ 25x = xy 1 2 3 4 5 y = 25 \\ So, number of brown socks = 25 F 86 Topicwise Solved Papers 58. (*)"
  },
  {
    "number": 53,
    "text": "In a society it is customary for friends of the same sex to 61. If 2 boys and 2 girls are to be arranged in a row so that hug and for friends of opposite sex to shake hands when the girls are not next to each other, how many possible they meet. A group of friends met in a party and there were arrangements are there?",
    "year": "2017-II",
    "options": {
      "a": "3",
      "b": "6",
      "c": "12",
      "d": "24 Which one among the following numbers indicates the"
    },
    "answer": "c",
    "explanation": "Let x be the number of women. These can be arranged in 3! ways and A, B can be arranged Let y be the number of men. among themselves in 2! ways. Total number of hand shakes = xy = 24 Hence, no. of arrangements such that A and B are always Then, the possible factors of x and y are x = 6 or 4, y = 4 or 6 together = 3! × 2! = 3 × 2 × 2 = 12 Number of hugs =xC + yC"
  },
  {
    "number": 62,
    "text": "For a sports meet, a winners’ stand comprising three possible number of hugs?",
    "year": "2015-II",
    "options": {
      "a": "39",
      "b": "30",
      "c": "21",
      "d": "20"
    },
    "answer": "a",
    "explanation": "Required number of ways = = 120 3! 2 (adjacent or opposite faces are 4 2 white)"
  },
  {
    "number": 54,
    "text": "In a box of marbles, there are three less white marbles than the red ones and five more white marbles than the green ones. If there are a total of 10 white marbles, how many marbles are there in the box?",
    "year": "2015-II",
    "options": {
      "a": "26",
      "b": "28",
      "c": "32",
      "d": "36 There are six different colours available to choose from and"
    },
    "answer": "b",
    "explanation": "White MarblesRed Marbles i.e. n(F) = 30 10 13 Number of students who play both the games = 10 White MarblesGreen Marbles i.e. n(C Ç F) = 10 10 . 0 5 Now, total number of Marbles = 5 + 10 + 13 = 28 To find : n(C¢Ç F¢) = ?"
  },
  {
    "number": 63,
    "text": "How many diagonals can be drawn by joining the vertices (a) 4 (b) 12 of an octagon?",
    "year": "2018-II",
    "options": {
      "a": "20",
      "b": "24",
      "c": "18",
      "d": "None of the above"
    },
    "answer": "a",
    "explanation": "Number of diagonals in an octagon =8C – 8 2 8´7 5 1 1 = – 8 = 20 6 0 1 2 Hence, total number of ways"
  },
  {
    "number": 56,
    "text": "A student has to opt for 2 subjects out of 5 subjects for a 64. While writing all the numbers from 700 to 1000, how many course, namely, Commerce, Economics, Statistics, numbers occur in which the digit at hundred’s place is Mathematics I and Mathematics II. Mathematics II can be greater than the digit at ten’s place, and the digit at ten’s offered only if Mathematics I is also opted. The number o",
    "year": "2018-II",
    "options": {
      "a": "61",
      "b": "64",
      "c": "85",
      "d": "91"
    },
    "answer": "c",
    "explanation": "It mathematics I is not opted, then two subjects out of 3 ( y-1 ) y four subjects have to be opted for. xy = 630 – \\ Number of ways in which two subjects can be opted for 2 4´3 621 =6 (a) If y = 3, then 3x = 630 – 9 Þ x= = 207 2 3 If mathematics II is opted, then it can be offered only if 612 mathematics I is also opted for Number of ways in which (b) If y = 4, then 4x = 630 – 18 Þ x= = 153 two subjects can be opted for 4 = 6 +1 = 7. 600"
  },
  {
    "number": 65,
    "text": "A bag contains 15 red balls and 20 black balls. Each ball is",
    "year": "2015-II",
    "options": {
      "a": "5",
      "b": "6",
      "c": "7",
      "d": "8 is numbered either 1or 2 or"
    },
    "answer": "b",
    "explanation": "Total number of balls 15 + 20 = 35 Total number of red balls numbered 3 `50 `10 `1 Numberofways æ100-20-40ö 40 2 0 7 1 = 15 ×ç ÷ = 15× = 6 è 100 ø 100 1 (0–5) (7–57) 6 Total number of black ball numbered 1 or 2 0 (0–10) (7–107) 11 æ100-30ö 70 Total number of ways = 1 + 6 + 11 = 18. = 20 × ç ÷ = 20 × = 14 è 100 ø 100"
  },
  {
    "number": 3,
    "text": "20% of the red balls are 57. A person ordered 5 pairs of black socks and some pairs of numbered 1 and 40% of them are numbered 3. Similarly, brown socks. The price of a black pair was thrice that of a among the black balls, 45% are numbered 2 and 30% are brown pair. While preparing the bill, the bill clerk interchanged numbered 3. A boy picks a ball at random. He wins if the the number of black an",
    "year": "2018-II",
    "options": {
      "a": "10",
      "b": "15",
      "c": "20",
      "d": "25"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 58,
    "text": "The number of persons who read magazine X only is thrice 66. Each face of a cube can be painted in black or white colours. the number of persons who read magazine Y. The number of In how many different ways can the cube be painted? persons who read magazine Y only is thrice the number of (a) 9 (b) 10",
    "year": "2019-II",
    "options": {
      "c": "11",
      "d": "12 conclusions can be drawn?"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 67,
    "text": "How many triplets (x, y, z) satisfy the equation x + y + z = 6, 1. The number of persons who read both the magazines is where x, y and z are natural numbers?",
    "year": "2019-II",
    "options": {
      "a": "4",
      "b": "5",
      "c": "9",
      "d": "10 5337_DBE Permutation, Combination & Probability F 81"
    },
    "answer": "d",
    "explanation": "x y z 7 1 0,1 ï 1 1 4 2 ï 3 0,1,2 ïï 1 4 1 ý21 0,1,2,3 4 1 1 4 ï 0,1,2,3,4 ï 1 2 3 5 ï 6 0,1,2,3,4,5ïþ 1 3 2 3 1 2 8 1 0 ü 3 2 1 ï 2 0,1 ï 2 2 2 3 0,1,2 ï 2 3 1 ï 4 0,1,2,3 ý28 2 1 3 ï 5 0,1,2,3,4 ï Total Number of triplets = 10. 6 0,1,2,3,4,5 ï 7 ï"
  },
  {
    "number": 68,
    "text": "A printer numbers the pages of a book starting with 1 and 72. How many five-digit prime numbers can be obtained by uses 3089 digits in all. How many pages does the book using all the digits 1, 2, 3, 4 and 5 without repetition of have?",
    "year": "2019-II",
    "options": {
      "a": "1040",
      "b": "1048",
      "c": "1049",
      "d": "1050"
    },
    "answer": "c",
    "explanation": "Pages till 9 uses 9 digits i.e.; 1 to 9. 0,1,2,3,4,5,6þ Pages from 10 to 99 uses 2 digits each. 9 1 0 ü Number of pages = (99 – 10) + 1 = 90 ï Number of digits = 2 × 90 = 180. 2 0,1 ï Pages from 100 to 999 uses 3 digits each. 3 0,1,2 ï Number of pages = 999 – 100 + 1 = 900. ï Number of digits = 3 × 900 = 2700. 4 0,1,2,3 ï ý36 Pages from 1000 to 9999 uses 4 digits each. 5 0,1,2,3,4 ï Remaining digits = 3089 – 2700 – 180 – 9 = 200. 6 0,1,2,3,4,5 ï 200 ï Remaining number of pages = =50. 7 0,1,2,3,4"
  },
  {
    "number": 69,
    "text": "Suppose you have sufficient amount of rupee currency in (c) Nine (d) Ten three denominations: `1, `10 and ` 50. In how many different 73. How many different 5-letter words (with or without meaning) ways can you pay a bill of ` 107?",
    "year": "2019-II",
    "options": {
      "a": "16",
      "b": "17",
      "c": "18",
      "d": "19 that each word has to start with D and end with I?"
    },
    "answer": "c",
    "explanation": "Number of Denominations are shown in the table:"
  },
  {
    "number": 70,
    "text": "The number of parallelograms that can be formed from a set of four parallel lines intersecting another set of four parallel (a) 24 (b) 18 lines, is",
    "year": "2019-II",
    "options": {
      "a": "18",
      "b": "24",
      "c": "12",
      "d": "6"
    },
    "answer": "d",
    "explanation": "Number of parallelograms that can be formed from 'm' parallel horizental and 'n' parallel vertical lines 6+14 4 Required chances = = = m C × n C 35 7 2 2"
  },
  {
    "number": 195,
    "text": "The torn page (a) 16 (b) 15 contains which of the following numbers?",
    "year": "2020-II",
    "options": {
      "a": "5, 6",
      "b": "7, 8",
      "c": "14",
      "d": "10"
    },
    "answer": null,
    "explanation": ""
  }
]