[
  {
    "number": 32,
    "text": "Forest areas have been labelled as 1, 2, 3 and 4 in the map: (b) Awadhi, Maithili, Bhojpuri and Brajbhasha (c) Brajbhasha, Awadhi, Bhojpuri and Maithili (d) Maithili, Bhojpuri, Brajbhasha and Awadhi 25. The canal-carrying capacity of Farakka is :",
    "year": "1997",
    "options": {
      "a": "75,000 Cusecs",
      "b": "70,000 Cusecs",
      "c": "40,000 Cusecs",
      "d": "35,000 Cusecs"
    },
    "answer": "d",
    "explanation": "Chikmagalur is famous for coffee. Mandya is famous for the production of starch.Oil extracted from maize can be for sugar and paper production. a feedstock for biodiesel. Alcoholic beverages can be"
  },
  {
    "number": 26,
    "text": "Which one of the following pairs is correctly matched? (a) Teak : Jammu and Kashmir",
    "year": "1997",
    "options": {
      "b": "Deodar : Madhya Pradesh",
      "c": "Sandalwood : Kerala Among these, those which were threatened in 1997 by a",
      "d": "Sundari : West Bengal serious epidemic include:"
    },
    "answer": "c",
    "explanation": "Laterite soil is mostly found in areas of high rainfall"
  },
  {
    "number": 27,
    "text": "Consider the map given below:",
    "year": "1997",
    "options": {
      "a": "teak forests of 3 and 4",
      "b": "oak forests of 1 and sal forests of 2",
      "c": "sal forests of 3",
      "d": "sandalwood forests of 4"
    },
    "answer": "d",
    "explanation": "Production of rice is 96.43 MT, wheat is 78.4 MT, pulses varies from 5° – 18° C. is 15.11 MT and coarse cereals are 40.73 MT in India. So, C. The suitable climatic condition for sugar beet requires the correct sequence in decreasing order is Rice – Wheat – 500–600 mm and temperature 18°–22° C. Coarse cereals – Pulses. D. Jute cultivation needs 500–1000 mm rainfall and"
  },
  {
    "number": 33,
    "text": "Commercial production of mineral oil has started in which one of the areas of India, labelled 1, 2, 3 and 4 in the map given below:",
    "year": "1998",
    "options": {
      "a": "Rift valley region, Chhattisgarh plain, Rain shadow 4 region and Chhota Nagpur",
      "b": "Chhattisgarh plain, Chhota Nagpur plateau, Rift valley region, and Rain shadow region",
      "c": "Rift valley region, Chhattisgarh plain, Chhota Nagpur",
      "d": "4 plateau and Rain shadow region"
    },
    "answer": "c",
    "explanation": "Not only the tea plants but also the coffee plants can produced by using maize. be propagated by seeds and stem cutting."
  },
  {
    "number": 2,
    "text": "Didwana (a) declining (b) stable C. Salt 3. Rampa (c) increasing (d) fluctuating D. Silver 4. Zawar 29. The tribal population in Andaman and Nicobar islands Codes: belongs to the:",
    "year": "1997",
    "options": {
      "a": "A-3; B -4; C-1; D-2",
      "b": "A-1; B -4; C-2; D-3",
      "c": "A-3; B-1; C-4; D-2",
      "d": "A-2; B-3; C-1; D-4"
    },
    "answer": "c",
    "explanation": "Coffee cultivation in Sri Lanka was abandoned because agricultural practices was possible in the Nile river and the leaf rust disease which affects the fruit and leaf of coffee. islands of Java. So, in this regions high density of The causative fungus is Hemileia Vastarix. population is found."
  },
  {
    "number": 35,
    "text": "The discovery of Oak flora in 1966 added a new chapter to (c) Mongoloid race (d) Negroid race the history of Indian Sericulture. Which one of the following 30. In the map shown rivers labelled as 1, 2, 3 and 4 respectively: states is the leading producer of Oak tasar silk ?",
    "year": "1998",
    "options": {
      "a": "Assam",
      "b": "Bihar 2 NEPAL",
      "c": "Manipur",
      "d": "Orissa · KATHMANDU"
    },
    "answer": "b",
    "explanation": "National Food Security Mission launched by Rural development to minimise the adverse effects of government of India to increase the food production of drought on production of crops and livestock and rice, wheat and pulses and commercial gaps like sugarcance productivity of land, water and human resources. The desert jute. The target is to increase the production of rice by 10 development programme is also by ministry of Rural million tones, wheat by 8 million tones and pulses, by 2 development "
  },
  {
    "number": 1,
    "text": "Aluminium B. Hospet 2. Woollen textile (a) Kosi, Gomti, Ghaghara and Gandak C. Korba 3. Fertilizers (b) Kosi, Ganga, Gomti and Ghaghara D. Haldia 4. Cement (c) Gandak, Ganga, Gomti and Ghaghara 5. Iron and steel (d) Teesta, Gomti, Ghaghara and Kosi Codes: 31. Which one of the following east flowing rivers of India has (a) A-4; B-3; C- 1; D-2 (b) A-2; B-5; C- 1; D-3 rift valley due to down warping?",
    "year": "1998",
    "options": {
      "c": "A-4; B-5; C- 2; D-1",
      "d": "A-2; B-1; C- 4; D-3 B 28 Topicwise Solved Papers"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 1,
    "text": "Haryana 2. Maharashtra 3. Punjab 4. Tamil Nadu Select the correct answer using the codes given below: Codes: (a) 1, 3, 2, 4 (b) 3, 1, 2, 4 (a) 4, 3, 2, 1 (b) 4, 3,1, 2 (c) 3, 1, 4, 2 (d) 1, 3, 4, 2 (c) 3, 4, 1, 2 (d) 3, 4, 2, 1 43. Which one of the following sets of states benefits the most 39. The four railway junctions shown by numerals 1, 2, 3, 4 on from the Konkan Railway?",
    "year": "1998",
    "options": {
      "a": "Goa, Karnataka, Maharashtra, Kerala",
      "b": "Madhya Pradesh, Maharashtra, Tamil Nadu, Kerala",
      "c": "Tamil Nadu, Kerala, Goa, Maharashtra",
      "d": "Gujarat, Maharashtra, Goa, Tamil Nadu"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 44,
    "text": "Which one of the following pairs of cities has recently been connected through a 6-lane express way?",
    "year": "1998",
    "options": {
      "a": "Ahmedabad : Vadodara",
      "b": "Dhaka : Chittagong",
      "c": "Islamabad : Lahore",
      "d": "Mumbai : Pune"
    },
    "answer": "c",
    "explanation": "Rice is the main kharif crop and groundnut and cotton cost to the identified farmers in the area. The farmers will are also the kharif crops wheat is a raki. use these quality seeds and take up their own seed"
  },
  {
    "number": 45,
    "text": "\"India has the largest population of the Asian X. Today, there are just about 20,000 to 25,000 X in their natural habitat spreading across the evergreen forests, dry thorn forest, (a) Palanpur, Mahesana, Ahmedabad and Vadodara swamps and grasslands. Their prime habitats, are however (b) Mahesana, Surendranagar, Rajkot and Junagarh the moist deciduous forests. The X population in India (c) Palanpur",
    "year": "1998",
    "options": {
      "a": "Tipis",
      "b": "Barkhans Bihar and Orissa. In the East, they are seen in North Bengal,",
      "c": "Phoomdis",
      "d": "Izba Assam and a few other states.\""
    },
    "answer": "c",
    "explanation": "Neem oil can be used as pesticide to control the production in a small area (1 acre) for their own use. The proliferation of some species of insects and mites and also crops are Rice, Pulses and Oilseeds. has applications in pharmaceutical industry as neem oil has"
  },
  {
    "number": 46,
    "text": "Assertion (A ) : According to statistics, more female children are born each year than male children in India. Reason (R) : In India, the death rate of a male child is higher than that of the female child.",
    "year": "1999",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not a correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "d",
    "explanation": "Kinnaur (Himachal) is famous for apples. Areca nut ground water. mostly confined to Karnataka, Kerala and Assam."
  },
  {
    "number": 47,
    "text": "The minimum land area recommended for forest cover to maintain proper ecological balance in India is : (a) 25% (b) 33%",
    "year": "1999",
    "options": {
      "c": "43%",
      "d": "53% 5337_DBE Geography of India B 29"
    },
    "answer": "d",
    "explanation": "Cytoplasmic male sterility and gene silencing are used cultural heritage systems, in 2002 FAO started an initiative for creation of transgenic crops. Grafting and budding in for the dynamic conservation of Globally Important B 58 Topicwise Solved Papers Agricultural Heritage Systems (GIAHS). The GIAHS"
  },
  {
    "number": 48,
    "text": "In which one of the following areas in the given map was 53. In the rough outline map of a part of Jammu and Kashmir there a recent discovery of copper deposits by the Atomic shown in the figure, places marked A, B, C and D represent Minerals Division of Department Atomic Energy ?",
    "year": "1999",
    "options": {
      "a": "1",
      "b": "2",
      "c": "4",
      "d": "3"
    },
    "answer": "d",
    "explanation": "All three statements are correct as Maize can be used"
  },
  {
    "number": 49,
    "text": "In the given figure, the site of the Tehri dam has been labelled (a) Anantnag, Baramula, Srinagar and Kargil as:",
    "year": "1999",
    "options": {
      "b": "Baramula, Srinagar, Kargil and Anantnag",
      "c": "Baramula, Srinagar, Anantnag and Kargil A Bhilangana River",
      "d": "Srinagar, Baramula, Kargil and Anantnag"
    },
    "answer": "b",
    "explanation": "NPK (fertilizers) can be applied at the rate of 112 kg, 25"
  },
  {
    "number": 54,
    "text": "If it is 10.00 am. I.S.T., then what would be the local time at Shillong on 92° E longitude?",
    "year": "1999",
    "options": {
      "a": "9.38 a.m.",
      "b": "10.38 a.m. C",
      "c": "10.22 a.m.",
      "d": "9.22 a.m. Koteshwar Dam"
    },
    "answer": "b",
    "explanation": "Capital-augmenting technological progress results in"
  },
  {
    "number": 57,
    "text": "Match the locations of ports labelled as A, B, C and D in the given map with the names of those ports and select the Tuticorin correct answer using the codes given below the names of the ports: Tiruvanthapuram Ports of India Kanyakumari (a) A (b) B (c) C (d) D 51. The first marine sanctuary in India, within its bounds coral reefs, mollusca, dolphins, tortoises and various kinds of sea birds, has b",
    "year": "1999",
    "options": {
      "a": "Sundarbans",
      "b": "Chilka Lake",
      "c": "Gulf of Kutch",
      "d": "Lakshadweep Names of Ports"
    },
    "answer": "b",
    "explanation": "Agricultural Produce Market Committee Acts of Mewat in haryana is not famous for mango. UP is famous respective states are responsible for markets in agricultural for mango. products. Similarly, coromandel coast is not famous for soya beans.Top"
  },
  {
    "number": 3,
    "text": "Mangalore 4. Tuticorin (a) Assam : Miri 5. Veraval (b) Nagaland : Konyak Codes: (c) Arunachal : Apatani (a) A-4; B-2; C-3; D-5 (b) A-5; B-2; C-4; D-1 (d) Madhya Pradesh : Lambada (c) A-1; B-3; C-4; D-2 (d) A-5; B-3; C-2; D-1 B 30 Topicwise Solved Papers 58. Which one of the following pairs of primitive tribes and places of their inhabitation is NOT correctly matched? 63. (a) Buksa : Pauri-Garhwal ",
    "year": "2000",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A C",
      "b": "Both A and R are true but R is not a correct explanation In the above map, the black marks show distribution of : of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "a",
    "explanation": "Wheat is a temperate region crop thus require moderate"
  },
  {
    "number": 64,
    "text": "(a) U.P. has the highest density of population in India INDIA (b) Himachal Pradesh has the highest female to male sex ratio in India (c) West Bengal has the highest growth rate of population in India (d) Bihar has the lowest literacy rate in India 61. Assertion (A) : Ganga plain is the most densely populated part of India. Reason (R) : Ganga is the most harnessed river of India.",
    "year": "2000",
    "options": {
      "a": "Both A and R are true and R is the correct explanation of A",
      "b": "Both A and R are true but R is not a correct explanation In the shaded area of the above map, the mean temperature of A for the month of July varies between:",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "d",
    "explanation": "Since UPSC has combined the preliminary exam of rainfall, 210 frost-free days. civil services and forest services, so few such odd • Considering these descriptions, cotton seems to be questions are expected. There is no need to lose sleep, if the better choice among the given options. you can't solve it. But let's do it:"
  },
  {
    "number": 62,
    "text": "Match the different ports of Union Territory of Pondicherry 65. Mekong Ganga Co-operation Project is :",
    "year": "2001",
    "options": {
      "a": "an irrigation project involving India and Myanmar respective names and select the correct answer using the",
      "b": "a joint tourism initiative of some Asian countries codes given below the lists of ports:",
      "c": "a hydroelectric power project involving India, Bangladesh and Myanmar",
      "d": "a defence and security agreement of India with its eastern neighbours"
    },
    "answer": "c",
    "explanation": "Both statements are correct as per Government"
  },
  {
    "number": 66,
    "text": "Assertion (A) : Anticyclonic conditions are formed in winter INDIA season when atmospheric pressure is high and air temperatures are low. Reason (R) : Winter rainfall in northern India causes development of anticyclonic conditions with low temperatures.",
    "year": "2001",
    "options": {
      "a": "Both A and R are true and R is the correct explanation D of A",
      "b": "Both A and R are true but R is not a correct explanation A C of A B",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "c",
    "explanation": "NCERT vocational class 11 floriculturist book page “ALL” varieties. Hence statement 3 is wrong. By 84: When an element forms precipitate with another elimination method, we are left with answer (b) only 2. substance commonly found in the irrigation water, it is"
  },
  {
    "number": 3,
    "text": "Pondicherry 4. Yanam 1. The installed capacity of power generation is around Codes: 95000 MW (a) A-2; B-1; C-3; D-4 (b) A-1; B-2; C-3; D-4 2. Nuclear plants contribute nearly 15% of total power (c) A-2; B-1; C-4; D-3 (d) A-1; B-2; C-4; D-3 generation 5337_DBE Geography of India B 31 3. Hydroelectricity plants contribute nearly 40% of total (b) The dominant source of irrigation in the country is po",
    "year": "2001",
    "options": {
      "a": "370 million years",
      "b": "470 million years commonly found in :",
      "c": "570 million years",
      "d": "670 million years"
    },
    "answer": "a",
    "explanation": "Wheat is a temperate region crop thus require moderate"
  },
  {
    "number": 69,
    "text": "The correct sequence of the eastward flowing rivers of the (b) North-Eastern Tamil Nadu peninsular India from north to south is :",
    "year": "2002",
    "options": {
      "a": "Subarnarekha, Mahanadi, Godavari, Krishna, Pennar,",
      "c": "Shivalik and Terai region",
      "d": "Western Andhra Pradesh Cauvery and Vagai"
    },
    "answer": "d",
    "explanation": "NCERT Class 12 Biology Chapter 6: \"Molecular Basis of Inheritance\". • Biochar is a stable, carbon–rich form of charcoal It explains the benefits of human genome sequencing that is applied to soil. that- \"It is the sequence of bases in DNA that determines • biochars from manures and food wastes recorded the genetic information of a given organism. So, learning higher nitrogen and phosphorus levels. So #2 is right. about the DNA sequences can lead to an understanding • Some biochars can increase s"
  },
  {
    "number": 1,
    "text": "Steady growth (b) A-4; B-5; C-3; D-2 B. 1921 -1951 2. Rapid high growth (c) A-2; B-5; C-3; D-4 C. 1951-1981 3. Stagnant growth (d) A-4; B-1; C-5; D-2 D. 1981 -2001 4. High growth with definite 77. What is the correct sequence of the rivers–Godavari, signs of slowdown Mahanadi, Narmada and Tapi in the descending order of Codes : their lengths?",
    "year": "2003",
    "options": {
      "a": "A-3; B-1; C-4; D-2",
      "b": "A-1; B-3; C-2; D-4",
      "c": "A-3; B-1; C-2; D-4",
      "d": "A-1; B-3; C-4; D-2"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 3,
    "text": "Among the states, Kerala has the highest density of (a) Assam Himalayas (b) Kumaon Himalayas surface road (c) Nepal Himalayas (d) Punjab Himalayas 4. National Highway No. 7 is the longest in the country 80. Among the following cities, which one has the highest Which of these statements are correct ? altitude above mean sea level?",
    "year": "2003",
    "options": {
      "a": "1 and 2",
      "b": "1 and 3",
      "c": "2 and 3",
      "d": "2 and 4"
    },
    "answer": "a",
    "explanation": "Wheat is a temperate region crop thus require moderate"
  },
  {
    "number": 1,
    "text": "Longitude of Jabalpur's location is between those of range temperature is 9°C. The station in question is :",
    "year": "2002",
    "options": {
      "a": "Allahabad",
      "b": "Chennai"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 2,
    "text": "Latitude of Aurangabad's location is between those of (c) Cherrapunji (d) Kolkata Vadodara and Pune. 73. The sea coast of which one of the following states has become famous as a nesting place for the giant Olive Ridley 3. Bangalore is situated more southward than Chennai turtles from South America?",
    "year": "2002",
    "options": {
      "a": "Goa",
      "b": "Gujarat",
      "c": "Orissa",
      "d": "Tamil Nadu"
    },
    "answer": "c",
    "explanation": "Coffee cultivation in Sri Lanka was abandoned because agricultural practices was possible in the Nile river and the leaf rust disease which affects the fruit and leaf of coffee. islands of Java. So, in this regions high density of The causative fungus is Hemileia Vastarix. population is found."
  },
  {
    "number": 74,
    "text": "With reference to India, which one of the following statements 82. Which one among the following states is smallest in area? is not correct?",
    "year": "2002",
    "options": {
      "a": "About one-third of the area of the country records",
      "b": "Gujarat more than 750 millimetres of annual rainfall",
      "c": "Karnataka",
      "d": "Tamil Nadu B 32 Topicwise Solved Papers"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 83,
    "text": "Among the following cities, which one is nearest to the 91. Lake Sambhar is nearest to which one of the following cities Tropic of Cancer?",
    "year": "2003",
    "options": {
      "a": "Delhi",
      "b": "Kolkata",
      "c": "Jodhpur",
      "d": "Nagpur"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 84,
    "text": "In which one of the following Union Territories, do people 92. Match List I (National Park/Sanctuary) with List II (State) of the Onge tribe live?",
    "year": "2004",
    "options": {
      "a": "Andaman and Nicobar Islands",
      "b": "Dadra and Nagar Haveli List-I List-II",
      "c": "Daman and Diu A Kanger Ghati National"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Andhra Pradesh has the longest coastline 94. Assertion (A) : Bangalore receives much higher average 2. Gujarat has the highest number of airports annual rainfall than that of Mangalore. Which of the statements given above is/are correct? Reason (R) : Bangalore has the benefit of receiving rainfall (a) 1 only (b) 2 only both from south-west and north-east monsoons.",
    "year": "2004",
    "options": {
      "a": "Both A and R are individually true and R is the correct",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 88,
    "text": "Match List-I (Minerals) with List-II (Location) and select explanation of A the correct answer using the codes given below: (b) Both A and R are individually true but R is not the List-I List-II correct explanation of A A. Coal 1. Giridih (c) A is true but R is false B. Copper 2. Jayamkondam (d) A is false but R is true C. Manganese 3. Alwar 95. Assertion (A) : West-flowing rivers of Peninsular In",
    "year": "2004",
    "options": {
      "a": "Both A and R are individually true and R is the correct",
      "b": "A-2; B-3; C-4; D-1 explanation of A",
      "c": "A-1; B-3; C-4; D-2",
      "d": "A-2; B-4; C-3; D-1 correct explanation of A"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 89,
    "text": "Which among the following National Highway routes is the (c) A is true but R is false longest?",
    "year": "2004",
    "options": {
      "a": "Agra-Mumbai",
      "b": "Chennai-Thane",
      "d": "A is false but R is true"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 96,
    "text": "Consider the following statements :",
    "year": "2004",
    "options": {
      "c": "Kolkata-Hajira",
      "d": "Pune-Machilipatnam"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Mahadeo Hills 2. Atomic Minerals Directorate for Research and 2. Sahyadri Parvat Exploration is engaged in heavy water production 3. Satpura Range 3. Indian Rare Earths Limited is engaged in manufacture What is the correct sequence of the above from the north to of Zircon for India's Nuclear Programme beside other the south ? rare earth products (a) 1, 2, 3 (b) 2, 1, 3 Which of the statements give",
    "year": "2004",
    "options": {
      "b": "A-3; B-5; C-2; D-1 List-I List-II",
      "c": "A-2; B-5; C-4; D-1 A. Gopinath Beach"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 1,
    "text": "Sikkim 3. Kerala is the first state in India to achieve replacement B. Dehong Deband 2. Uttaranchal level of fertility. C. Nokrek 3. Arunachal Pradesh Which of the statements given above is/are correct? D. Kanchenjunga 4. Orissa (a) 1 only (b) 1 and 2 5. Meghalaya (c) 2 and 3 (d) 1, 2 and 3 Codes: 105. Which one of the following statements is true on the basis (a) A-1; B-3; C-5; D-4 of Census - 20",
    "year": "2005",
    "options": {
      "a": "Bihar has the highest percentage of the scheduled",
      "b": "A-4; B-5; C -2; D-1",
      "c": "A-1; B-5; C-2; D-4 castes of its population.",
      "d": "A-4; B-3; C-5; D-1"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 99,
    "text": "Amongst the following Indian States which one has the has been below 20%. minimum total forest cover?",
    "year": "2004",
    "options": {
      "a": "Sikkim",
      "b": "Goa",
      "c": "Mizoram is the India state with the least population.",
      "d": "Pondicherry has the highest sex ratio among the Union"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 106,
    "text": "According to the census 2001, which one of the following 1. The forest cover in India constitutes around 20% of Indian States has the maximum population in India after its geographical area. Out of the total forest cover, Uttar Pradesh?",
    "year": "2005",
    "options": {
      "a": "West Bengal",
      "b": "Maharashtra"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "The National Forestry Action Programme aims at (c) Bihar (d) Tamil Nadu bringing one third of the area of India under tree forest 107. Which one of the following statements is not correct?",
    "year": "2005",
    "options": {
      "a": "The Western Ghats are relatively lower in their northern Which of the statements given above is/are correct? region.",
      "b": "2 only",
      "c": "both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "c",
    "explanation": "Coffee cultivation in Sri Lanka was abandoned because agricultural practices was possible in the Nile river and the leaf rust disease which affects the fruit and leaf of coffee. islands of Java. So, in this regions high density of The causative fungus is Hemileia Vastarix. population is found."
  },
  {
    "number": 1,
    "text": "Area-wise, Chhattisgarh is larger than West Bengal. rift valleys. 2. According to the population Census 2001, population 108. Gandhi Sagar Dam is a part of which one of the following? of West Bengal is larger than that of Chhattisgarh.",
    "year": "2005",
    "options": {
      "a": "Chambal Project",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 109,
    "text": "Which one of the following is the correct sequence of hills List-I List-II starting from the north and going towards the south?",
    "year": "2005",
    "options": {
      "a": "Nallamalai Hills–Nilgiri Hills–Javadi Hills–Anamalai Hills /Heavy Water Plants)",
      "b": "Anamalai Hills–Javadi Hills–Nilgiri Hills–Nallamalai A. Thal"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 117,
    "text": "Consider the following statements concerning the Indian (a) Agasthyamali (b) Nallamalai Railways.",
    "year": "2006",
    "options": {
      "c": "Nilgiri",
      "d": "Panchmarhi"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The Head Quarters of the North Western Railway are 111. Which one of the following is the correct sequence of Indian located at Jodhpur. cities in the decreasing order, of their normal annual rainfall? 2. \"Indrail Pass\" –a travel as you please ticket has been",
    "year": "2005",
    "options": {
      "a": "Kochi–Kolkata–Delhi–Patna sportspersons who have represented India in any",
      "b": "Kolkata–Kochi–Patna–Delhi games/sport.",
      "c": "Kochi–Kolkata–Patna–Delhi"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 3,
    "text": "Chhattisgarh 4. Jharkhand (a) 2 only (b) 3 only Select the correct answer using the codes given below: (c) 1 and 2 (d) None (a) 1, 2, 3 and 4 (b) 2, 3 and 4 118. Consider the following statements:",
    "year": "2006",
    "options": {
      "c": "1 and 4",
      "d": "1 and 3"
    },
    "answer": "a",
    "explanation": "Wheat is a temperate region crop thus require moderate"
  },
  {
    "number": 1,
    "text": "Silent Valley National Park in the Nallamalai range. 2. Pathrakkadavu Hydroelectric project is proposed to List-I List-II be built near the Silent Valley National Park. (Centre of Handicrafts) (State) 3. The Kunthi river originates in Silent Valley's rainforests. A. Mon 1. Arunachal Pradesh Which of the statements given above is/are correct? B. Nalbari 2. Assam (a) 1 and 3 (b) 2 only C. Naisghat 3",
    "year": "2005",
    "options": {
      "b": "A-1; B-3; C-4; D-2 /Wildlife Sanctuary)",
      "c": "A-4; B-3; C-1; D-2 A. Bondla Wildlife Sanctuary"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 3,
    "text": "Chhattisgarh D. Ushkothi Wildlife 4. Goa 1. Petronet LNG Ltd. is setting up another LNG terminal Sanctuary at Mangalore. 5. Tripura 2. The Head Office of the Dredging Corporation of India Codes : is at Vishakhapatnam. (a) A-2; B-1; C-5; D-3 3. The Narwapahar Mine is operated by the Uranium (b) A-4; B-3; C-2; D-1 Corporation of India Limited. (c) A-2; B-3; C-5; D-1 Which of the statements given abo",
    "year": "2005",
    "options": {
      "c": "2 and 3 only",
      "d": "1 and 3 only"
    },
    "answer": "a",
    "explanation": "Wheat is a temperate region crop thus require moderate"
  },
  {
    "number": 123,
    "text": "Which one of the following statements is not correct ? (a) Both A and R are true and R is the correct explanation (a) Mahanadi River rises in Chhattisgarh",
    "year": "2006",
    "options": {
      "b": "Godavari River rises in Maharashtra",
      "c": "Cauvery River rises in Andhra Pradesh of A",
      "d": "Tapti River rises in Madhya Pradesh"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 124,
    "text": "Match List-I (National Park/Wildlife Sanctuary) with List-I) 132. Which one of the following National Highways passes (Nearby Town) and select the correct answer using the through Maharashtra, Chhattisgarh and Orissa?",
    "year": "2007",
    "options": {
      "a": "NH 4",
      "b": "NH 5 List-I List-II",
      "c": "NH 6"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Balaghat is known for its diamond mines. A. Chandra Prabha 1. Jaipur 2. Majhgawan is known for its manganese deposits. B. Karera 2. Jhansi Which of the statements given above is/are correct? C. Jaisamand 3. Agra (a) 1 only (b) 2 only D. Nahargarh 4. Varanasi (c) Both 1 and 2 (d) Neither 1 nor 2 5. Udaipur 134. Which one of the following rivers originates in Amarkantak? Codes :",
    "year": "2007",
    "options": {
      "a": "A-4; B-4; C-1; D-1",
      "b": "Mahanadi",
      "c": "Narmada",
      "d": "Tapi"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 136,
    "text": "Out of the four southern States: Andhra Pradesh, Karnataka, (b) Shyok-Zaskar-Spiti-Sutlej Kerala and Tamil Nadu, which shares boundaries with the (c) Zaskar-Shyok-Sutlej- Spiti maximum number of Indian States?",
    "year": "2007",
    "options": {
      "a": "Andhra Pradesh only",
      "b": "Karnataka only",
      "d": "Zaskar-Sutlej-Shyok-Spiti"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 137,
    "text": "Match List I with List II and select the correct answer using (a) Hoshangabad (b) Raipur the code given below the lists:",
    "year": "2007",
    "options": {
      "c": "Sambalpur",
      "d": "Warangal List-I List-II"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Hirakud 1. Vizag Steel Plant (RINL) has been declared a Mini Ratna. B. HINDALCO 2. Korba 2. Merger of IISCO with SAIL has been completed. C. Indian Aluminium 3. Koraput Which of the statements given above is/are correct? Company (a) 1 only (b) 2 only D. NALCO 4. Renukoot (c) Both 1 and 2 (d) Neither 1 nor 2 Codes: 128. The Stilwell Road, built in 1940s, which was recently in news, (a) A-3; B-1; C-",
    "year": "2007",
    "options": {
      "a": "Agartala in India and Yangon in Myanmar via",
      "b": "A-2; B-4; C-1; D-3",
      "c": "A-3; B-4; C-1; D-2 Bangladesh",
      "d": "A-2; B-1; C-4; D-3 B 36 Topicwise Solved Papers"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 138,
    "text": "Which one of the following is located in the Bastar region? 148. Out of all the biosphere reserves in India, four have been",
    "year": "2007",
    "options": {
      "a": "Bandhavgarh National Park of the following is not one of them?",
      "b": "Dandeli Sanctuary",
      "c": "Rajaji National Park",
      "d": "Sunderbans"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 149,
    "text": "With which one of the following rivers is the Omkareshwar 139. In which State is the Guru Shikhar Peak located?",
    "year": "2007",
    "options": {
      "a": "Rajasthan",
      "b": "Gujarat",
      "c": "Madhya Pradesh",
      "d": "Maharashtra"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 140,
    "text": "Match List I with List II and select the correct answer using 150. In India, how many states share the coastline?",
    "year": "2008",
    "options": {
      "a": "7",
      "b": "8 List-I List-II",
      "c": "9"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Salt-water crocodile is found in the Andaman and Which of the statements given above is/are correct? Nicobar Islands. (a) 1 only (b) 2 only 2. Shrew and Tapir are found in the Western Ghats of the (c) Both 1 and 2 (d) Neither 1 nor 2 Malabar region. 142. Which one among the following States of India has the Which of the statements given above is/are correct? lowest density of population?",
    "year": "2007",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 154,
    "text": "In which one of the following states are Namchik Namphuk (c) Arunachal Pradesh coalfields located?",
    "year": "2008",
    "options": {
      "a": "Arunachal Pradesh",
      "b": "Meghalaya",
      "d": "Sikkim"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 143,
    "text": "As per India’s National Population Policy, 2000, by which (c) Manipur (d) Mizoram one of the following years is it our long-term objective to 155. Which of the following minerals found in a natural way in achieve population stabilization?",
    "year": "2008",
    "options": {
      "a": "2025",
      "b": "2035"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Bauxite 2. Dolomite (c) 2045 (d) 2055 3. Iron ore 4. Tin 144. What is the approximate percentage of persons above 65 Select the correct answer using the code given below: years of age in India’s current population?",
    "year": "2008",
    "options": {
      "a": "14-15%",
      "b": "11-12%",
      "c": "8-9%",
      "d": "5-6%"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 145,
    "text": "Amongst the following States, which one has the highest 156. On which one of the following rivers is the Tehri hydropower percentage of rural population to its total population (on complex located?",
    "year": "2008",
    "options": {
      "a": "Alaknanda",
      "b": "Bhagirathi",
      "c": "Dhauliganga",
      "d": "Mandakini"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Jog Falls : Sharavathi (a) Chandigarh (b) Mizoram 3. Shivasamudram Falls : Cauvery (c) Pondicherry (d) Sikkim Select the correct answer using the code given below: 147. Which one of the following is not essentially a species of Codes: the Himalayan vegetation?",
    "year": "2008",
    "options": {
      "a": "1 and 2 only",
      "b": "2 and 3 only",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "Coffee cultivation in Sri Lanka was abandoned because agricultural practices was possible in the Nile river and the leaf rust disease which affects the fruit and leaf of coffee. islands of Java. So, in this regions high density of The causative fungus is Hemileia Vastarix. population is found."
  },
  {
    "number": 1,
    "text": "Infant mortality rate takes into account the death of 1. Damanganga : Gujarat infants within a month after birth. 2. Girna : Maharashtra 2. Infant mortality rate is the number of infant deaths in a 3. Pamba : Kerala particular year per 100 live births during that year. Select the correct answer using the code given below: Which of the above statements is/are correct? (a) 1 only (b) 2 only Codes: (",
    "year": "2009",
    "options": {
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 1,
    "text": "Between Census 1951 and Census 2001, the density of 159. Where are Tapovan and Vishnugarh hydroelectric project the population of India has increased more than three located?",
    "year": "2008",
    "options": {
      "a": "Madhya Pradesh",
      "b": "Uttar Pradesh"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 1,
    "text": "Ludhiana 2. Kochi (a) 1 only (b) 2 only 3. Surat 4. Nagpur (c) Both 1 and 2 (d) Neither 1 nor 2 Select the correct answer using the code given below: 170. Which one of the following rivers does not originate in Codes: India?",
    "year": "2009",
    "options": {
      "a": "1, 2 and 3 only",
      "b": "2, 3 and 4 only",
      "c": "1 and 4 only",
      "d": "1, 2, 3 and 4"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 161,
    "text": "Which one among the following has the maximum number 171. At which one of the following places do two important rivers of National Parks?",
    "year": "2008",
    "options": {
      "a": "Andaman and Nicobar Islands and merges with another important rivers flowing towards",
      "b": "Arunachal Pradesh Bay of Bengal, the other one flows towards Arabian Sea?",
      "c": "Assam",
      "d": "Meghalaya"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 162,
    "text": "Consider the following regions:",
    "year": "2009",
    "options": {
      "c": "Mahabaleshwar",
      "d": "Nasik"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "In a Wildlife Sanctuary, limited biotic interference is (a) Nilgiri Hills (b) Nicobar Islands permitted. (c) Spiti Valley (d) Lakshadweep Islands Which of the statements given above is/are correct? 166. The Dul Hasti Power Station is based on which one of the (a) 1 only (b) 2 and 3 only following rivers?",
    "year": "2009",
    "options": {
      "a": "Beas",
      "b": "Chenab",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "a",
    "explanation": "Wheat is a temperate region crop thus require moderate"
  },
  {
    "number": 175,
    "text": "Following are the characteristics of an area in India:",
    "year": "2010",
    "options": {
      "c": "Ravi",
      "d": "Sutlej"
    },
    "answer": "c",
    "explanation": "The above climate conditions are found in India in"
  },
  {
    "number": 1,
    "text": "Copper …… Jharkhand (b) Kolleru Lake : Krishna 2. Nickel …… Orissa (c) Ukai Reservoir : Tapi 3. Tungsten …… Kerala (d) Wular Lake : Jhelum Which of the pairs given above is/are correctly matched? 184. If there were no Himalayan ranges, what would have been (a) 1 and 2 only (b) 2 only the most likely geographical impact on India?",
    "year": "2010",
    "options": {
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 1,
    "text": "Much of the country would experience the cold waves 177. Consider the following pairs: from Siberia. 2. Indo-gangetic plain would be devoid of such extensive Protected area Well-known for alluvial soils. 1. Bhiterkanika, Odisha …… Salt Water 3. The pattern of monsoon would be different from what Crocodile it is at present. Which of the statements given above 2. Desert National Park, …… Great India",
    "year": "2010",
    "options": {
      "a": "Rajasthan",
      "b": "Punjab",
      "c": "Himachal Pradesh",
      "d": "Jammu and Kashmir"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 186,
    "text": "The approximate representation of land use classification 178. In India, which type of forest among the following occupies in India is :",
    "year": "2010",
    "options": {
      "a": "Net area sown 25%, forests 33%, other areas 42%",
      "b": "Net area sown 58%, forests 17%, other areas 25%",
      "c": "Net area sown 43%; forests 29%, other areas 28%",
      "d": "Net area sown 47%, forests 23%, other areas 30%"
    },
    "answer": "d",
    "explanation": "The approximate representation of land use is classified value. It has low sulphur and low phosphorous content but as net area sown 46%, forests 23%, other areas 30%. high ash fusion temperature."
  },
  {
    "number": 1,
    "text": "Deepening the Malacca straits between Malaysia and (a) It flows into Gulf of Khambhat Indonesia. (b) It flows into Gulf of Kutch 2. Opening a new canal across the Kra Isthmus between (c) It flows into Pakistan and merges with a tributary of Indus the Gulf of Siam and Andaman Sea. (d) It is lost in the marshy land of the Rann of Kutch Which of the statements given above is/are correct ? 180. Rivers",
    "year": "2010",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 188,
    "text": "The lower Gangetic plain is characterised by humid climate (b) Beas and Ravi only with high temperature throughout the year. Which one (c) Chenab, Ravi and Satlej only among the following pairs of crops is most suitable for this (d) Beas, Chenab, Ravi, Satlej and Yamuna region ? [2011 - I] 181. When you travel in certain parts of India, you will notice (a) Paddy and Cotton (b) Wheat and Jute red s",
    "year": "2010",
    "options": {
      "a": "Abundance of magnesium",
      "c": "Paddy and Jute",
      "d": "Wheat and Cotton"
    },
    "answer": "c",
    "explanation": "The low and deltaic plains of the Ganges is government. A biosphere reserve conserves an ecosystem characterised by swamps and Sundarbans. So, the people and not just few specific species of plants and animals. out there grow Paddy and Jute."
  },
  {
    "number": 189,
    "text": "Which one of the following pairs of islands is separated (b) Accumulated humus from each other by the ‘Ten Degree Channel’? [2014 - I] (c) Presence of ferric oxides (a) Andaman and Nicobar (b) Nicobar and Sumatra (d) Abundance of phosphates (c) Maldives and Lakshadweep 182. Which one of the following is the appropriate reason to (d) Sumatra and Java considering the Gondwana rocks as most important",
    "year": "2010",
    "options": {
      "a": "More than 90% of limestone reserves of India are found in their upper reaches. Of these rivers, Brahmaputra makes in them a “U” turn in its course to flow into India. This “U” turn is",
      "b": "More than 90% of India’s coal reserves are found in due to",
      "c": "More than 90% of fertile black cotton soils are spread",
      "d": "None of the reasons given above is appropriate in this mountain chains context"
    },
    "answer": "a",
    "explanation": "The Ten Degree Channel is a channel that separates Western coastal area from Maharastra, Goa, Kerala, Coastal the Andaman Islands from the Nicobar Islands in the Bay Karnataka including the Western Ghats, and hilly area of of Bengal. north east except some parts of Meghalaya and Arunachal"
  },
  {
    "number": 1,
    "text": "Vamsadhara 2. Indravati 1. Harike Wetlands : Confluence of Beas and 3. Pranahita 4. Pennar Satluj/Sutlej Which of the above are tributaries of Godavari? 2. Keoladeo Ghana : Confluence of (a) 1, 2 and 3 (b) 2, 3 and 4 National Park Banas and Chambal (c) 1, 2 and4 (d) 2 and 3 only 3. Kolleru Lake : Confluence of Musi and 213. Which one of the following regions of India has a Krishna combination of m",
    "year": "2015-I",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 1,
    "text": "Oak 1. Cambay Basin 2. Rhododendron 2. Cauvery Basin 3. Sandalwood 3. Krishna-Godavari Basin Select the correct answer using the code given below. (a) 1 and 2 only (b) 3 only Select the correct answer using the code given below. (c) 1 and 3 only (d) 1, 2 and 3 (a) 1 and 2 only (b) 3 only 208. With reference to ‘Changpa’ community of India, consider (c) 2 and 3 only (d) 1, 2 and 3 the following sta",
    "year": "2017-I",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only",
      "c": "3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 209,
    "text": "In a particular region in India, the local people train the (c) Chandipur (d) Nagapattinam roots of living trees into robust bridges across the streams. 217. Which one of the following is an artificial lake ? As the time passes, these bridges become stronger. These",
    "year": "2018-I",
    "options": {
      "a": "Meghalaya",
      "b": "Himachal Pradesh",
      "c": "Jharkhand",
      "d": "Tamil Nadu"
    },
    "answer": "a",
    "explanation": "In the present-day Meghalaya state of northeast India • Delhi is at 28°40?N (Longitude) and 77°20?E is a form of tree shaping, which creates these suspension (Latitude) bridges, they are handmade from the aerial roots of living A. Bangalore: 12° 58' N, 77° 38' E. banyan fig trees. B. Hyderabad: 17° 20' N, 78° 30' E"
  },
  {
    "number": 2,
    "text": "Himachal Pradesh (a) Bengaluru (b) Hyderabad 3. Mizoram (c) Nagpur (d) Pune In which of the above States do 'Tropical Wet Evergreen 219. Which one of the following national parks lies completely Forests' occur? in the Temperate alpine zone?",
    "year": "2019-I",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "Coffee cultivation in Sri Lanka was abandoned because agricultural practices was possible in the Nile river and the leaf rust disease which affects the fruit and leaf of coffee. islands of Java. So, in this regions high density of The causative fungus is Hemileia Vastarix. population is found."
  },
  {
    "number": 211,
    "text": "Which one of the following pairs of States of India indicates (c) Neora valley national park the eastern most and western most State?",
    "year": "2015-I",
    "options": {
      "a": "Assam and Rajasthan",
      "d": "Valley of flower national park"
    },
    "answer": "d",
    "explanation": "Arunachal Pradesh and Gujarat are the easternmost completely in the temperate zone. and westernmost States."
  },
  {
    "number": 220,
    "text": "Consider the following pairs :",
    "year": "2019-I",
    "options": {
      "b": "Arunachal Pradesh and Rajasthan Famous place: River",
      "c": "Assam and Gujarat"
    },
    "answer": "a",
    "explanation": "• The Chandrabhaga (Bhima) river flows through"
  },
  {
    "number": 1,
    "text": "Pandharpur : Chandrabhaga (d) Arunachal Pradesh and Gujarat 2. Tiruchirapalli : Cauvery 3. Hampi : Malaprabha 5337_DBE Geography of India B 41 Which of the pair given above are correctly matched 224. With reference to the management of minor minerals in (a) 1 and 2 only (b) 2 and 3 only India, consider the following statements :",
    "year": "2019-I",
    "options": {
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 1,
    "text": "Chattisgarh 2. Madhya Pradesh 2. State Governments have the power to grant mining 3. Maharashtra 4. Odisha leases of minor minerals, but the powers regarding With reference to the states mentioned above, in terms of the formation of rules related to the grant of minor percentage of forest cover to the total area of State, which minerals lie with the Centre Government. one of the following is the c",
    "year": "2019-I",
    "options": {
      "a": "Recently discovered uranium deposits",
      "c": "3 only",
      "d": "1, 2 and 3 only"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  },
  {
    "number": 1,
    "text": "As per recent amendment to the India Forest Act, as major minerals? 1927, forest dwellers have the right to fell the bamboos (a) 1 and 2 only (b) 4 only grown on the forest areas. (c) 1 and 3 only (d) 2, 3 and 4 only 2. As per the Scheduled Tribes and Other Traditional 226. Consider the following statements :",
    "year": "2020-I",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only Which of the following statements given above is/are",
      "c": "3 only",
      "d": "1, 2 and 3 correct?"
    },
    "answer": "d",
    "explanation": "Cotton grows there"
  }
]