[
  {
    "number": 52,
    "text": "Which one of the following antimicrobial drugs, is suitable 62. Which of the following are associated with Diabetes for treatment of both tuberculosis and leprosy?",
    "year": "1995",
    "options": {
      "a": "Isoniazid",
      "b": "P-aminosalicylic acid"
    },
    "answer": "a",
    "explanation": "A food chain illustrates the order in which a chain of communities, households and businesses to turn off their organisms feed upon each other. non-essential lights for one hour, from 8:30 to 9:30 p.m. to A food chain is the sequence of who eats whom in a raise the awareness about the climate change and the need biological community to obtain nutrition. to save the planet. Sample:- Grassland Biome"
  },
  {
    "number": 3,
    "text": "Lower insulin level in blood (a) 280 (b) 290 4. Higher insulin level in blood (c) 300 (d) 310 Select the correct answer by using the codes given below: 54. Which of the following elements are present in all proteins? Codes:",
    "year": "1995",
    "options": {
      "a": "2 and 4",
      "b": "1 and 2"
    },
    "answer": "a",
    "explanation": "Only crocodile is kept in the Red book or endangered protect the Nilgiri tahir (wild goat) species. species list."
  },
  {
    "number": 1,
    "text": "Carbon 2. Hydrogen (c) 2 and 3 (d) 1 and 3 3. Oxygen 4. Nitrogen 63. Consider the following statements.",
    "year": "1996",
    "options": {
      "a": "2 and 3",
      "b": "1, 2 and 4"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 1,
    "text": "Overnutrition 2. Undernutrition properties of Vitamin C, first as a cure of common cold and 3. Imbalanced nutrition later as preventing agent against cancer.” One of science’s Select the correct answer by using the codes given below major figures of all time referred to above is Codes:",
    "year": "1995",
    "options": {
      "a": "2 alone",
      "b": "2 and 3",
      "c": "1 and 3",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 65,
    "text": "People drinking water from a shallow hand pump, are likely 57. “It begins as a single cell and grows into a merciless disease to suffer from all of the following diseases except",
    "year": "1996",
    "options": {
      "a": "Cholera",
      "b": "Typhoid are steadily unlocking its mysteries and the fight against it,",
      "c": "Jaundice",
      "d": "Fluorosis may now have reached a dramatic turning point. New"
    },
    "answer": "a",
    "explanation": "The Montreux Record is a register of wetland sites on organism or population responds to the distribution of the List of Wetlands of International Importance where resources and competitors. A niche is the sum of the habitat changes in ecological character have occurred, are occurring, requirements that allow a species to persist and produce offspring. or are likely to occur as a result of technological"
  },
  {
    "number": 66,
    "text": "Besides proteins and carbohydrates, other elements of discoveries promise better therapies and hope in the war nutritional value found in milk, include",
    "year": "1996",
    "options": {
      "a": "calcium, potassium and iron is",
      "b": "calcium and potassium",
      "c": "potassium and iron",
      "d": "Alzheimer’s disease"
    },
    "answer": "c",
    "explanation": "The Bombay Natural History Society is one of the Assam. Only 150 animals are left. Monitor Lizard is found in largest non-governmental organizations in India engaged India, Sri Lanka and Pakistan. Spider Monkey is the in conservation and biodiversity research. It strives to inhabitant of tropical forests of Central and South America. conserve nature through action-based research, education"
  },
  {
    "number": 58,
    "text": "Of the four landmarks in medical history given below, which 67. Fat present below the skin surface in our body, acts as a one was the first to take place ?",
    "year": "1996",
    "options": {
      "a": "Organ transplant",
      "b": "Bypass surgery",
      "c": "Test tube baby",
      "d": "Plastic surgery"
    },
    "answer": "c",
    "explanation": "The trees cannot replace the grasses as a part of an Ramsar convention. The organization was formed in 1954 ecological succession because of water limits and fire. and Ramsar convention was signed in 1971. “Wetlands"
  },
  {
    "number": 68,
    "text": "The major chemical compound found in kidney stones is : (a) AIDS (b) Tuberculosis",
    "year": "1996",
    "options": {
      "a": "urea",
      "b": "calcium carbonate",
      "c": "Malaria",
      "d": "Ebola"
    },
    "answer": "c",
    "explanation": "Dampa Tiger Reserve, the largest wildlife sanctuary in"
  },
  {
    "number": 69,
    "text": "The pituitary gland by virtue of its tropic hormones controls (a) Scurvy (b) Rickets the secretaoy activity of other endocrine glands. Which (c) Xerophthalmia (d) Pellagra one of the following endocrine gland can function 61. Match List-I with List-II and select the correct answer by independent of the pituitary gland?",
    "year": "1997",
    "options": {
      "a": "Thyroid",
      "b": "Gonads List- I List-II",
      "c": "Adrenals",
      "d": "Parathyroid A. Vitamin"
    },
    "answer": "b",
    "explanation": "This organization is in partnership but not formed by"
  },
  {
    "number": 3,
    "text": "Keratin 1. Blood 2. Lungs 3. Tissue D. Protein 4. Progesterone The correct sequence of transportation is Codes: (a) 1, 2, 3 (b) 3, 1, 2 (a) A – 1; B – 2; C – 3; D – 4 (c) 2, 1, 3 (d) 1, 3, 2 (b) A – 2; B – 1; C – 4; D – 3 71. Corpus luteum is a mass of cells found in",
    "year": "1997",
    "options": {
      "a": "Brain",
      "b": "Ovary",
      "c": "A – 2; B – 1; C – 3; D – 4",
      "d": "A – 1; B – 2; C – 4; D – 3"
    },
    "answer": "a",
    "explanation": "Only crocodile is kept in the Red book or endangered protect the Nilgiri tahir (wild goat) species. species list."
  },
  {
    "number": 73,
    "text": "What is the average fat content of buffalo milk?",
    "year": "1997",
    "options": {
      "a": "Dove",
      "b": "Dodo",
      "c": "Condor",
      "d": "Skua"
    },
    "answer": "d",
    "explanation": "Eco-sensitive zones are ecological important area countries (activities commonly referred to as REDD+). under environment protection Act 1986 around national"
  },
  {
    "number": 83,
    "text": "The complete conversion of glucose, in the presence of 74. The major component of honey is",
    "year": "1997",
    "options": {
      "a": "glucose",
      "b": "sucrose is called",
      "c": "maltose",
      "d": "fructose"
    },
    "answer": "a",
    "explanation": "Oak and Rhododendron are found in Himalayan zone. for ozone depletion. While sandalwood is found in South India."
  },
  {
    "number": 75,
    "text": "Arteries supplying blood to the heart are called",
    "year": "1997",
    "options": {
      "a": "Carotid arteries",
      "b": "Hepatic arteries",
      "c": "glycolysis",
      "d": "hydrolysis"
    },
    "answer": "a",
    "explanation": "Coral reefs are diverse underwater ecosystems held"
  },
  {
    "number": 84,
    "text": "Consumption of fish is considered to be healthy when (c) Coronary arteries (d) Pulmonary arteries compared to flesh of other animals because fish contains 76. Daily intake of proteins, recommended for a moderately (a) polyunsaturated fatty acids",
    "year": "1998",
    "options": {
      "a": "30 g",
      "b": "saturated fatty acids",
      "c": "essential vitamins",
      "d": "46 g"
    },
    "answer": "d",
    "explanation": "Namdapha National Park is located in Arunachal Development (UNCED), also known as the Rio Summit or Pradesh. The climate of this area varies from tropical to Earth Summit. It was a major United Nations conference subtropical, temperate and arctic. It is tropical and held in Rio de Janeiro from 3 to 14 June 1992. In 2012, the subtropical in southern regions and arctic type in northern United Nations Conference on Sustainable Development part of the park. was also held in Rio, and is also commonly"
  },
  {
    "number": 1,
    "text": "Bone marrow (Disease) (Organism) B. Filaria 2. Brain A. Malaria 1. Fungi C. Encephalitis 3. Muscle D. Leukaemia 4. Lymph node B. Poliomyelitis 2. Bacteria 5. Blood cells C. Tuberculosis 3. Virus (a) A – 5; B – 3; C – 2; D – 1 D. Ringworm 4. Protozoan (b) A – 5; B – 4; C – 2; D – 1 (a) A-4; B-3; C-2; D-1 (c) A – 4; B – 3; C – 5; D – 1 (b) A-4; B-3; C-1; D-2 (d) A – 5; B – 4; C – 1; D – 2 (c) A-3; B",
    "year": "1997",
    "options": {
      "a": "lowers body temperatures",
      "d": "A-3; B-4; C-2; D-1"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 86,
    "text": "Haemophilia is a genetic disorder which leads to",
    "year": "1998",
    "options": {
      "a": "decrease in haemoglobin level",
      "b": "destroys harmful bacteria",
      "c": "triggers the immune system",
      "d": "is used as an antidote to poison"
    },
    "answer": "c",
    "explanation": "The Forest Carbon Partnership Facility is a global"
  },
  {
    "number": 79,
    "text": "The sequencing of the entire genome (the totality of all (d) non-clotting of blood genes) of an organism was completed in 1996. The organism 87. Endoscopy, a technique used to explore the stomach or was:",
    "year": "1997",
    "options": {
      "a": "albino mouse",
      "b": "yeast",
      "c": "human being",
      "d": "plasmodium vivax"
    },
    "answer": "b",
    "explanation": "In organisms called lichens, a chlorophy II-containing"
  },
  {
    "number": 1,
    "text": "Processed meat is a perishable food (c) diffraction 2. All perishable foods are packed in sealed tins (d) polarization 3. Sealed tins sometimes do not contain processed meat 88. When ants bite, they inject",
    "year": "1999",
    "options": {
      "a": "glacial acetic acid",
      "b": "methanol the above statements?",
      "c": "formic acid",
      "d": "stearic acid"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 89,
    "text": "In eye donation, which one of the following parts of donor’s (b) Processed meat is sometimes not packed in sealed tins eye is utilized?",
    "year": "1999",
    "options": {
      "a": "Iris",
      "b": "Lens",
      "c": "Processed meat is always packed in sealed tins",
      "d": "Non-perishable foods are never packed in sealed tins"
    },
    "answer": "c",
    "explanation": "An ecosystem includes all of the living things (plants,"
  },
  {
    "number": 1,
    "text": "Beadle and Tatum List- I List-II B. Theory of evolution 2. Jacob and Monad A. Adrenaline 1. Anger, fear, danger C. One gene one enzyme 3. Darwin B. Estrogen 2. Attracting partners hypothesis through sense of smell D. Operon concept 4. de Vries C. Insulin 3. Females Codes : D. Pheromones 4. Glucose (a) A – 3; B – 4; C – 1; D – 2 (a) A – 3; B – 1; C – 4; D – 2 (b) A – 4; B – 3; C – 1; D – 2 (c) A – ",
    "year": "1999",
    "options": {
      "c": "A – 2; B – 3; C – 1; D – 4 List-I List-II",
      "d": "A – 3; B – 2; C – 1; D – 4 A. Atropine"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 3,
    "text": "Dilation of pupil (a) a decrease in the supply of oxygen D. Pyrethrin 4. Mosquito control (b) minor wear and tear of muscle fibres Codes : (c) the depletion of glucose (a) A – 1; B – 3; C – 2; D – 4 (d) the accumulation of lactic acid (b) A – 1; B – 3; C – 4; D – 2 100. A small pouch containing silica gel is often found in bottles of (c) A – 3; B – 1; C – 4; D – 2 medicine in tablet or powder form",
    "year": "2000",
    "options": {
      "a": "kills bacteria",
      "b": "kills germs and spores",
      "d": "A – 3; B – 1; C – 2; D – 4"
    },
    "answer": "a",
    "explanation": "Only crocodile is kept in the Red book or endangered protect the Nilgiri tahir (wild goat) species. species list."
  },
  {
    "number": 92,
    "text": "Which one of the following genetic diseases is sex-linked? (c) absorbs moisture",
    "year": "1999",
    "options": {
      "a": "Royal haemophilia",
      "b": "Tay-Sachs disease",
      "d": "absorbs all gases present inside the bottle"
    },
    "answer": "c",
    "explanation": "The dugong is a medium-sized marine mammal. Dugong partner, which is an alga, and a fungus live together. Fungus is listed under schedule 1 of India Wildlife Protection Act, provides shelter, water and minerals to the alga and, in 1972. In 2008, a MoU was signed between the Ministry of return, the alga provides food which it prepares by Environment and Forests and the Government of India, in photosynthesis. order to conserve dugongs. In fact the highest level of legal"
  },
  {
    "number": 93,
    "text": "Lathyrism is caused by excessive consumption of",
    "year": "1999",
    "options": {
      "a": "Cornea",
      "b": "Lens",
      "c": "Retina",
      "d": "The whole eye"
    },
    "answer": "c",
    "explanation": "The Gangetic dolphins have been declared as the monoxide and Carbon dioxide. National Aquatic Animal of India .River Dolphin is the"
  },
  {
    "number": 102,
    "text": "A man whose blood group is not known meets with a serious 94. Assertion (A) : In human being, the females play a major accident and needs blood transfusion immediately. Which role in determining the sex of the offspring. one of the blood groups mentioned below and readily Reason (R) : Women have two ‘X’ chromosomes.",
    "year": "2000",
    "options": {
      "a": "O, Rh–",
      "b": "O, Rh+",
      "c": "AB, Rh–",
      "d": "AB, Rh+"
    },
    "answer": "a",
    "explanation": "Agenda 21 is a non-binding, voluntarily implemented UNCCCD focuses on Africa, Asia, Latin America and the action plan of the United Nations with regards to Caribbean, Northern Mediterranean and Central and Eastern sustainable development. It is a product of the Earth Europe. Hence statement 2 is wrong. Therefore, answer (c). Summit held in Rio de Janeiro, Brazil, in 1992. Therefore, Ref:http://www.unccd.int/en/regional-access/Pages/ only first statement right. default.aspx/ 5337_DBE Issues on En"
  },
  {
    "number": 97,
    "text": "The blood glucose level is commonly expressed as",
    "year": "2000",
    "options": {
      "a": "Complementary of the two strands",
      "b": "milligram per decilitre",
      "c": "parts per million",
      "d": "gram per litre"
    },
    "answer": "d",
    "explanation": "The bio-toilets are fitted underneath the lavatories and"
  },
  {
    "number": 98,
    "text": "Match List-I (Endocrine glands) with List-II (Hormones (d) Sugar-phosphate backbone secreted) and select the correct answer using the codes 105. “Metastasis” is the process by which",
    "year": "2001",
    "options": {
      "a": "cells divide rapidly under the influence of drugs List-I List-II",
      "b": "cancer cells spread through the blood or lymphatic A. Gonads"
    },
    "answer": "c",
    "explanation": "(i) The Kyoto Protocol separates countries into two preindustrial levels and pursuing efforts to limit the groups. Annex I includes developed nations, while Non- temperature increase to 1.5°C above preindustrial levels. Annex I refers to developing countries. (ii) Paris Summit - not all nations have signed the A CER is a certificate which is issued every time the agreement and there is no deadline to ratify it. hence, United Nations prevents one tonne of CO equivalent statement 1 is wrong. This "
  },
  {
    "number": 1,
    "text": "Insulin system to other sites or organs B. Pituitary 2. Progesterone (c) the chromosomes in cells nuclei are attached to the C. Pancreas 3. Growth hormones spindle before moving to the anaphase poles D. Adrenal 4. Cortisone (d) cancer cells are successfully inhibited to divide any further E 36 Topicwise Solved Papers 106. Match List-I with List-II and select the correct answer using 114. When one ",
    "year": "2001",
    "options": {
      "a": "apomixis",
      "c": "polyploidy",
      "d": "polyteny A. Ptyalin"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 116,
    "text": "Foot and Mouth disease in animals, a current epidemic in (a) destroys harmful bacteria some parts of the world, is caused by",
    "year": "2002",
    "options": {
      "a": "bacterium",
      "b": "is used to treat poisoning",
      "c": "lowers body temperature",
      "d": "virus"
    },
    "answer": "a",
    "explanation": "The amount of BOD in the water is a measure of the (i) Pterocarpus santalinus, with the common names Red amount of organic material in the water, in terms of how Sanders, Red Sandalwood, and saunderswood, is a species much oxygen will be required to break it down biologically. of Pterocarpus endemic to the southern Eastern Ghats Clean water would have BOD value of less than 5 ppm mountain range of South India. This tree is valued for the whereas highly polluted water could have a BOD value of ri"
  },
  {
    "number": 117,
    "text": "Match List-I (Indian wild life species) with List-II (Scientific 108. Which organelle in the cell, other than nucleus, contains names) and select the correct answer using the codes given DNA?",
    "year": "2001",
    "options": {
      "a": "Centriole",
      "b": "Golgi apparatus List-I List-II",
      "c": "Lysosome"
    },
    "answer": "b",
    "explanation": "National Tiger Conservation Authority (NTCA) is approaches to bioremediation. Hence 3 is also right. But planning to implement a new computerized tiger not all compounds are susceptible to rapid and complete monitoring protocol in all tiger reserves of the country biodegradation, and bioremediation often takes longer known as Monitoring System for Tiger, Intensive time than other treatment processes. So, second statement Patrolling and Ecological Status (MSTrIPES). unlikely to be correct. Hence,"
  },
  {
    "number": 2,
    "text": "Cervus duvauceli (a) Lysosome and Centrosome C. Chinkara 3. Equus hemionus (b) Endoplasmic reticulum and Ribosome D. Nilgai 4. Gazella gazella (c) Golgi apparatus and Mitochondria (d) Lysosome and Mitochondria (a) A – 2; B – 3; C – 1; D – 4 110. The cellular and molecular control of programmed cell death (b) A – 3; B – 2; C – 4; D – 1 is known as",
    "year": "2001",
    "options": {
      "a": "apoptosis",
      "b": "ageing",
      "c": "A – 2; B – 3; C – 4; D – 1",
      "d": "A – 3; B – 2; C – 1; D – 4"
    },
    "answer": "a",
    "explanation": "A keystone species is a species that play a critical role protected area. in maintaining the structure of an ecological community • Great Indian Bustard is protected in desert area of and whose impact in the community is greater than would Rajasthan. be expected based on its relative abundance or total biomass. • The Eravikulam National Park was established to"
  },
  {
    "number": 1,
    "text": "Tapeworm is a hermaphrodite. T-DNA 2. Round-worm has separate sexes. B. Feldman 2. Discovered 3. Filaria is caused by a nematode. endonucleases 4. Guinea-worm is an annelid. C. Mullis 3. Discovered reverse Which of these are correct? transcriptase (a) 1 and 2 (b)1, 2 and 3 (c) 3 and 4 (d) 2, 3 and 4 D. Temin and 4. Discovered polymerase 113. In the context of organic evolution, the loss of limbs i",
    "year": "2002",
    "options": {
      "a": "A – 2; B – 1; C – 4; D – 3",
      "b": "A – 1; B – 2; C – 4; D – 3",
      "c": "A – 2; B – 1; C – 3; D – 4",
      "d": "A – 1; B – 2; C – 3; D – 4"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 130,
    "text": "Which one of the following statements is not correct? (a) Prions are the smallest free-living cells.",
    "year": "2003",
    "options": {
      "a": "Milk contains none of the B-vitamins.",
      "b": "The cell wall of Mycoplasma is made up of amino sugars",
      "c": "Viroids consist of single-stranded RNA molecule",
      "d": "Rickettsias lack cell wall"
    },
    "answer": "b",
    "explanation": "As per the timeline given on their official \"About us\" the sake of reference- NCERT Class 12 biology page 30! page: CCAC was formed in 2012 by UNEP and Ghana, This eliminates \"B\". Second statement should be wrong Bangladesh etc. countries. So first statement is because of the extreme word \"drastic\". This eliminates wrong.Second statement is right- they focus on Short Lived \"D\". Besides I'm unable to find any specific reference that Climate Pollutants such as methane, black carbon and mentions li"
  },
  {
    "number": 1,
    "text": "Non-functioning of lachrymal gland is an important (a) Both A and R are true and R is the correct explanation symptom of deficiency of Vitamin A. of A 2. Deficiency of Vitamin B can lead to indigestion and 1 (b) Both A and R are true but R is not a correct explanation heart enlargement. of A 3. Vitamin C deficiency can lead to pain in the muscles. ‘ (c) A is true both R is false 4. Deficiency of V",
    "year": "2002",
    "options": {
      "a": "Isolation",
      "b": "Mutation",
      "c": "1, 3 and 4",
      "d": "1, 2, 3 and 4"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 125,
    "text": "Ticks and mites are actually",
    "year": "2002",
    "options": {
      "a": "glycolipid",
      "b": "fatty acid",
      "c": "peptide",
      "d": "sterol"
    },
    "answer": "c",
    "explanation": "NCERT Class 11 Chemistry: Ch. 14-Environmental reduce biodiversity in the area, Hence Option (B) Chemistry, page 407"
  },
  {
    "number": 127,
    "text": "Octopus is",
    "year": "2003",
    "options": {
      "a": "an arthropod",
      "b": "an echinoderm",
      "c": "Pancreas",
      "d": "Spleen"
    },
    "answer": "d",
    "explanation": "Carbon sequestration may be carried out by pumping Mudumalai (Tamil Nadu) for climatic reasons for Lion carbon into carbon sinks of two types: relocation, still you're left with Sariska (Rajasthan). Sariska A. Natural sinks- ocean, forest, soil etc. being a tiger reserve, would sound unfit for lion B. Artificial sink- depleted oil reserve, unminable mines. immigration. So by elimination answer would be \"B\". and So statement 1 and 2 are correct. Indianexpress report confirm it. And deep Saline Fo"
  },
  {
    "number": 1,
    "text": "ELISA test is employed as the first and most basic test (a) 1, 2 and 3 (b) 2, 3 and 4 for an individual to detect cancer. (c) 1 and 4 (d) 1, 2, 3 and 4 2. Almost 50% of human beings have Rh+ blood while 140. Assertion (A) : All the proteins in our food are digested in the remaining have Rh– blood. small intestine only. Which of the statement(s) given above is/are correct? Reason (R) : The protein-",
    "year": "2005",
    "options": {
      "a": "Both A and R are individually true and R is the correct",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 148,
    "text": "What is the name of the vessel that delivers the nutrient/ explanation of A rich blood from the stomach and small intestine to the liver? (b) Both A and Rare individually true but R is not the",
    "year": "2006",
    "options": {
      "a": "Left hepatic artery",
      "b": "Hepatic vein",
      "c": "A is true but R is false",
      "d": "Hepatic portal vein"
    },
    "answer": "d",
    "explanation": "growth trajectories. [Ref: Organization's About US Page] • Source of benzene pollution is the automobile and"
  },
  {
    "number": 149,
    "text": "Which one of the following pairs is not correctly matched? 141. Assertion (A) : Amoeba reproduces by fission.",
    "year": "2006",
    "options": {
      "a": "Creating the world first U. K methods.",
      "b": "Cloning a human embryo Germany",
      "c": "Guiding a spacecraft for U.S.A.",
      "d": "Ais false but R is true"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Vomiting and neck pain are two of the symptoms of explanation of A Meningococcal Meningitis. . (b) Both A and Rare individually true but R is not the Which of the statement(s) given above is/are correct? correct explanation of A (a) 1 only (b) 2 only (c) A is true but R is false (c) Both 1 and 2 (d) Neither 1 nor 2 (d) Ais false but R is true 151. Robert Webster is known for his work associated wi",
    "year": "2007",
    "options": {
      "a": "Cardiology",
      "b": "Influenza virus",
      "c": "HIV/AIDS",
      "d": "Alzheimer"
    },
    "answer": "a",
    "explanation": "A keystone species is a species that play a critical role protected area. in maintaining the structure of an ecological community • Great Indian Bustard is protected in desert area of and whose impact in the community is greater than would Rajasthan. be expected based on its relative abundance or total biomass. • The Eravikulam National Park was established to"
  },
  {
    "number": 152,
    "text": "In the human body, which structure is the appendix attached (c) Distillerie to?",
    "year": "2007",
    "options": {
      "a": "The large intestine",
      "b": "The small intestine",
      "d": "Glass industry"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 153,
    "text": "In human body, which one of the following hormones 1. The common bile duct releases its contents into regulates blood calcium and phosphate?",
    "year": "2007",
    "options": {
      "a": "Glucagon",
      "b": "Growth hormone"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "The pancreatic duct releases its contents into (c) Parathyroid hormone (d) Thyroxine duodenum. 154. How do most insects respire?",
    "year": "2007",
    "options": {
      "a": "Through skin",
      "b": "Through gills",
      "c": "By lungs",
      "d": "By tracheal system"
    },
    "answer": "a",
    "explanation": "A keystone species is a species that play a critical role protected area. in maintaining the structure of an ecological community • Great Indian Bustard is protected in desert area of and whose impact in the community is greater than would Rajasthan. be expected based on its relative abundance or total biomass. • The Eravikulam National Park was established to"
  },
  {
    "number": 155,
    "text": "In human beings, normally in which one of the following 167. In the context of genetic disorders, consider the following: parts, does the sperm fertilize the ovum?",
    "year": "2007",
    "options": {
      "a": "Cervix",
      "b": "Fallopian tube does not suffer from it. They have a son and a daughter. In",
      "c": "Lower part of uterus",
      "d": "Upper part of uterus this context, which one of the following statements is most"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 156,
    "text": "Which one of the following parts of the human brain is the probably correct?",
    "year": "2009",
    "options": {
      "a": "Both children suffer from colour blindness.",
      "b": "Daughter suffers from colour blindness while son does",
      "c": "Medulla oblongata",
      "d": "Pons"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 157,
    "text": "Production of which one of the following is a function of (d) Son suffers from colour blindness while daughter does the liver?",
    "year": "2007",
    "options": {
      "a": "Lipase",
      "b": "Urea"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 168,
    "text": "In the context of Indian wild life, the flying fox is a",
    "year": "2009",
    "options": {
      "a": "Bat",
      "b": "Kite",
      "c": "Mucus",
      "d": "Hydrochloric acid"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 159,
    "text": "Which one of the following is the correct sequence in the (a) Octopus-Dolphin-Shark order of decreasing length of the three structural parts given (b) Pangolin-Tortoise-Hawk below of small intestine in the human body?",
    "year": "2007",
    "options": {
      "a": "Jejunum - Duodenum - Ileum",
      "b": "Ileum - Duodenum - Jejunum",
      "c": "Salamander-Python-Kangaroo",
      "d": "Frog-Crab-Prawn"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 170,
    "text": "The Panda belongs to the same family as that of",
    "year": "2009",
    "options": {
      "a": "Bear",
      "b": "Cat",
      "c": "Jejunum - Ileum - Duodenum",
      "d": "Ileum - Jejunum - Duodenum"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 160,
    "text": "In which of the following kinds of organisms is the 171. The marine animal called Dugong which is vulnerable to phenomenon found wherein the female kills the male after extinction is",
    "year": "2009",
    "options": {
      "a": "Amphibian",
      "b": "Bony fish",
      "c": "Shark",
      "d": "Mammal"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 172,
    "text": "Widespread resistance of malarial parasite to drugs like chloroquine has prompted attempts to develop a malarial 161. For which one of the following snakes is the diet mainly vaccine to combat malaria. Why is it difficult to develop an composed of other snakes?",
    "year": "2008",
    "options": {
      "a": "Krait",
      "b": "Russell’s viper",
      "c": "Rattlesnake",
      "d": "King cobra"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 162,
    "text": "What is the pH level of blood of a normal person?",
    "year": "2008",
    "options": {
      "a": "4.5–4.6",
      "b": "6.45–6.55",
      "c": "Vaccines can be developed only against bacteria",
      "d": "Man is only an intermediate host and not the definitive"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Hepatitis B can cause liver cancer enzymes. Which of the statements given above is/ are correct? (a) Both A and R are individually true and R is the correct (a) 1 only explanation of A (b) 2 only (b) Both A and Rare individually true but R is not the (c) Both 1 and 2 correct explanation of A (d) Neither 1 nor 2 (c) A is true but R is false 174. Aspartame is an artificial sweetener sold in the mark",
    "year": "2008",
    "options": {
      "a": "Aspartame is as sweet as table sugar, but unlike table",
      "b": "Kangaroo sugar, it is not readily oxidized in human body due to",
      "c": "Porcupine",
      "d": "Whale lack of requisite enzymes."
    },
    "answer": "a",
    "explanation": "A keystone species is a species that play a critical role protected area. in maintaining the structure of an ecological community • Great Indian Bustard is protected in desert area of and whose impact in the community is greater than would Rajasthan. be expected based on its relative abundance or total biomass. • The Eravikulam National Park was established to"
  },
  {
    "number": 165,
    "text": "The release of which one of the following into ponds and (b) When aspartame is used in food processing, the sweet wells helps in controlling the mosquitoes?",
    "year": "2008",
    "options": {
      "a": "Crab",
      "b": "Dogfish",
      "c": "Aspartame is as sweet as sugar, but after ingestion",
      "d": "Snail into the body, it is converted into metabolites that yield no calories."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 166,
    "text": "Among the following, which one is not an ape?",
    "year": "2008",
    "options": {
      "a": "Gibbon",
      "b": "Gorilla hence food items made with small quantities of",
      "c": "Langur",
      "d": "Aspartame is several times sweeter than table sugar,"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 198,
    "text": "Which of the following statements is not correct? (a) AIDS (b) Bird flu",
    "year": "2019-I",
    "options": {
      "a": "Hepatitis B virus is transmitted much like HIV.",
      "c": "Dengue",
      "d": "Swine flu"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "In tropical regions, Zika virus disease is transmitted 1. Genetic changes can be introduced in the cells that by the same mosquito that transmits dengue. produce eggs or sperms of a prospective parent. 2. Sexual transmission of Zika virus disease is possible. 2. A person’s genome can be edited before birth at the Which of the statements given above is/are correct? early embryonic stage. (a) 1 only",
    "year": "2018-I",
    "options": {
      "a": "1 and 3 only",
      "b": "3 and 4 only"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 1,
    "text": "The anaerobic conditions associated with rice The National Forest Policy of 1988 includes: cultivation cause the emission of methane. (a) 1, 2, 3 and 4 (b) 2 and 4 2. When nitrogen based fertilizers are used, nitrous oxide (c) 1, 3 and 4 (d) 1, 2 and 3 is emitted from the cultivated soil. 2. Within biological communities, some species are important Which of the statements given above is / are corr",
    "year": "2000",
    "options": {
      "a": "Keystone species",
      "b": "Allopatric species",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 10,
    "text": "Consider the following pairs :",
    "year": "2010",
    "options": {
      "c": "Sympatric species",
      "d": "Threatened species Protected area Well-known for"
    },
    "answer": "b",
    "explanation": "of forest and development of forest. It does not describe • Bhiterkanika, Orissa is a protected area for salt water the use of insecticide and pesticide in forest areas. crocodile, where breeding is the main purpose of that"
  },
  {
    "number": 1,
    "text": "Bhiterkanika, Orissa — Salt Water Crocodile 1. Crocodile 2. Elephant 2. Desert National Park, — Great Indian Bustard Which of these is/are endangered species? Rajasthan (a) Only 1 (b) Only 2 3. Eravikulam, Kerala — Hoolak Gibbon (c) Both 1 and 2 (d) Neither 1 nor 2 Which of the pairs given above is / are correctly matched ? 4. Consider the following statements:",
    "year": "2005",
    "options": {
      "a": "1 only",
      "b": "1 and 2 only"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 1,
    "text": "Biodiversity hotspots are located only in tropical 3. Methane as a green house gas is more harmful than regions. carbon dioxide. 2. India has four biodiversity hotspots i.e., Eastern Which of the statements given above is/are correct? Himalayas, Western Himalayas, Western Ghats and (a) 1 and 2 (b) 1 and 3 Andaman and Nicobar Islands. (c) 1 only (d) 3 only Which of the statements given above is / a",
    "year": "2008",
    "options": {
      "a": "1 only",
      "b": "2 only"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 1,
    "text": "The boundaries of a National Park are defined by 2. Under the CDM, the projects handled pertain only to legislation. the Annex-I countries. 2. A Biosphere Reserve is declared to conserve a few Which of the statements given above is/are correct? specific species of flora and fauna. (a) 1 only (b) 2 only 3. In a Wildlife Sanctuary, limited biotic interference is (c) Both 1 and 2 (d) Neither 1 nor 2 ",
    "year": "2008",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 1,
    "text": "Salt-water crocodile is found in the Andaman and – Hawk. In this food chain, the highest concentration of the Nicobar Islands. pesticide would accumulate in which one of the following ? 2. Shrew and tapir are found in the Western Ghats of the",
    "year": "2010",
    "options": {
      "a": "Food crop",
      "b": "Rat Which of the statements given above is/are correct?",
      "c": "Snake",
      "d": "Hawk"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  },
  {
    "number": 1,
    "text": "Soot 2. Sulphur hexafluoride (a) Bhitarkanika (b) Chandipur-on-sea 3. Water vapour (c) Gopalpur-on-sea (d) Simlipal Which of the above contribute to the warming up of the 24. Three of the following criteria have contributed to the atmosphere? recognition of Western Ghats, Sri Lanka and Indo Burma (a) 1 and 2 only (b) 3 only regions as hotspots of biodiversity : [2011 - I] (c) 2 and 3 only (d) 1, 2",
    "year": "2010",
    "options": {
      "a": "United Nations Conference on the Human 6. Adaption of flora and fauna to warm and humid Environment, Stockholm, 1972 conditions",
      "b": "UN ‘Conference on Environment and Development, Which three of the above are correct criteria in this context? Rio de Janeiro, 1992",
      "c": "World Summit on Sustainable Development,",
      "d": "3, 4 and 6 Johannesburg, 2002 25. The Himalayan range is very rich in species diversity. Which"
    },
    "answer": "d",
    "explanation": "National Forest Policy, 1988 describes the protection"
  }
]