[
  {
    "number": 1,
    "text": "Oak 2. Rhododendron 3. Sandalwood (a) Bhitarkanika National Park Select the correct answer using the code given below. (b) Keibul Lamjao National Park (a) 1 and 2 only (b) 3 only (c) Keoladeo Ghana National Park (c) 1 and 3 only (d) 1, 2 and 3 (d) Sultanpur National Park 84. Which one of the following National Parks has a climate 91. With reference to the International Union for Conservation that ",
    "year": "2015-I",
    "options": {
      "b": "Nandadevi National Park correct?",
      "c": "Neora Valley National Park"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 2,
    "text": "It provides financial aid to universities, individual 1. It is a herbivorous marine animal. scientists and institutions involved in scientific forestry 2. It is found along the entire coast of India. research to develop eco-friendly and climate adaptation 3. It is given legal protection under Schedule I of the technologies for sustainable forest management. Wildlife (Protection) Act, 1972. 3. It a",
    "year": "2015-I",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 1,
    "text": "It is a Global Partnership of Conservation Organizations. (a) Bretton Woods Conference 2. The concept of 'biodiversity hotspots' originated from (b) Montreal Protocol this organization. (c) Kyoto Protocol 3. It identifies the sites known/referred to as 'Important (d) Nagoya Protocol Bird and Biodiversity Areas'. 95. What is Rio+20 Conference, often mentioned in the news? Select the correct answer ",
    "year": "2015-I",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only",
      "c": "1 and 3 only",
      "d": "1, 2 and 3 Development"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 88,
    "text": "In India, in which one of the following types of forests is (b) It is a Ministerial Meeting of the World Trade Organization teak a dominant tree species?",
    "year": "2015-I",
    "options": {
      "a": "Tropical moist deciduous forest Climate Change",
      "b": "Tropical rain forest",
      "c": "It is a Conference of the Inter-governmental Panel on",
      "d": "It is a Conference of the Member Countries of the"
    },
    "answer": "d",
    "explanation": "Biometrics identification is used in computer science contained in the collection. as a form of identification and access control. Biometric"
  },
  {
    "number": 1,
    "text": "The Sustainable Development Goals were first 3. It presents an approach that can help decision-makers proposed in 1972 by a global think tank called the recognize, demonstrate and capture the value of ‘Club of Rome’. ecosystems and biodiversity. 2. The Sustainable Development Goals have to be Select the correct answer using the code given below. achieved by 2030. (a) 1 and 2 only (b) 3 only Which ",
    "year": "2016-I",
    "options": {
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2 Proper design and effective implementation of UN-REDD+"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 1,
    "text": "protection of biodiversity (a) pledges made by the European countries to 2. resilience of forest ecosystems rehabilitate refugees from the war-affected Middle East 3. poverty reduction (b) plan of action outlined by the countries of the world to Select the correct answer using the code given below. combat climate change (a) 1 and 2 only (b) 3 only (c) capital contributed by the member countries in",
    "year": "2016-I",
    "options": {
      "a": "It is an international accounting tool for government regarding Sustainable Development Goals and business leaders to understand, quantify and",
      "d": "plan of action outlined by the countries of the world"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 1,
    "text": "It aims to promote effective action through innovative financial incentives to developing countries to reduce national programs and supportive inter-national greenhouse gas emissions and to adopt eco-friendly partnerships. technologies 2. It has a special/particular focus on South Asia and (c) It is an inter-governmental agreement ratified by all North Africa regions, and its Secretariat facilitat",
    "year": "2016-I",
    "options": {
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 1,
    "text": "It is a tree species found in a part of South India. (a) 1 only (b) 2 and 3 only 2. It is one of the most important trees in the tropical rain (c) 3 only (d) 1, 2 and 3 forest areas of South India. 109. ‘Net metering’ is sometimes seen in the news in the context Which of the statements given above is/are correct? of promoting the",
    "year": "2016-I",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2 households/consumers"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 117,
    "text": "The term M-STRIPES' is sometimes seen in the news in (b) use of piped natural gas in the kitchens of households the context of",
    "year": "2017-I",
    "options": {
      "a": "Captive breeding of Wild Fauna",
      "b": "Maintenance of Tiger Reserves",
      "c": "installation of CNG kits in motor-cars",
      "d": "installation of water meters in urban households"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Ceiling fans (c) Mudumalai Wildlife Sanctuary 2. Electric geysers (d) Sariska National Park 3. Tubular fluorescent lamps 119. In India, if a species of tortoise is declared protected Select the correct answer using the code given below. under Schedule I of the Wildlife (Protection) Act, 1972, (a) 1 and 2 only (b) 3 only what does it imply ?",
    "year": "2017-I",
    "options": {
      "a": "It enjoys the same level of protection as the tiger.",
      "c": "2 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 1,
    "text": "River basin is the unit of planning and management. 1. Gharial 2. Indian wild ass 2. It spearheads the river conservation efforts at the 3. Wild buffalo national level. Select the correct answer using the code given below: 3. One of the Chief Ministers of the States through (a) 1 only (b) 2 and 3 only which the Ganga flows becomes the Chairman of (c) 1 and 3 only (d) 1, 2 and 3 NGRBA on rotation b",
    "year": "2017-I",
    "options": {
      "b": "Chambal River",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 1,
    "text": "It is capable of swimming up to three kilometers in 122. From the ecological point of view, which one of the seawater. following assumes importance in being a good link between 2. It survives by grazing on mangroves. the Eastern Ghats and the Western Ghats? 3. It lives in the wild and cannot be domesticated. (a) Sathyamangalam Tiger Reserve",
    "year": "2017-I",
    "options": {
      "a": "1 and 2 only",
      "b": "Nallamala Forest",
      "c": "Nagarhole National Park",
      "d": "1, 2 and 3"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 2,
    "text": "The mission of TRAFFIC is to ensure that trade in 1. It is an initiative of the European Union. wild plants and animals is not a threat to the 2. It provides technical and financial support to targeted conservation of nature. developing countries to integrate climate change into Which of the above statements is/are correct? their development policies and budgets. (a) 1 only (b) 2 only 3. It is coo",
    "year": "2017-I",
    "options": {
      "a": "1 and 2 only",
      "b": "3 only"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 1,
    "text": "Climate and Clean Air Coalition (CCAC) to reduce 3. It could lead to a fall in the population of some Short Lived Climate Pollutants is a unique initiative species of wasps, spiders and birds. of G20 group of countries. Select the correct answer using the code given below: 2. The CCAC focuses on methane, black carbon and (a) 1 only (b) 2 and 3 only hydrofluorocarbons. (c) 1 and 3 only (d) 1, 2 and",
    "year": "2017-I",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 1,
    "text": "The NGT has been established by an Act whereas injection of sulphate aerosol into stratosphere?",
    "year": "2019-I",
    "options": {
      "a": "Creating the artificial rains in some regions the Government.",
      "b": "Reducing the frequency and intensity of tropical cyclones"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 2,
    "text": "The NGT provides environmental justice and helps reduce the burden of litigation in the higher courts (c) Reducing the adverse effects of the solar wind on the whereas the CPCB promotes cleanliness of streams earth and wells, and aims to improve the quality of air in (d) Reducing the global warming 142. Which one of the following are Agasthyamala biosphere the country. reserve?",
    "year": "2019-I",
    "options": {
      "a": "Neyyar, peppara and shendurney wildlife sanctuaries",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2 and kalakad mundanthurai tiger reserve"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 1,
    "text": "Blue finned mahseer : Cauvery river part of Indi(a) 2. Irrawaddy dolphin : Chambal river Which of the statements given above is/are correct ? 3. Rusty spotted cats : Eastern ghats (a) 1 and 2 only (b) 2 and 3 only (c) 3 only (d) 1, 2 and 3 Which one of the pair given above are correctly matched? 136. In which one of the following States is Pakhui Wildlife (a) 1 and 2 only (b) 2 and 3 only Sanctuar",
    "year": "2018-I",
    "options": {
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 144,
    "text": "Why is there a great concern about the microbeads that (a) Arunachal Pradesh are released into environment?",
    "year": "2019-I",
    "options": {
      "a": "They are considered harmful to marine ecosystem",
      "b": "Manipur",
      "c": "Meghalaya",
      "d": "Nagaland"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Global warming might trigger the release of methane Johannesburg (b) The United Nations Conference on Sustainable gas from these deposits Development 2012, Rio de Janeiro 2. Large deposits of ‘methane hydrate’ are found in Arctic (c) The United Nations Framework Convention on Tundra and under the seafloor. 3. Methane in atmosphere oxidizes to carbon dioxide after Climate Change 2015, Paris a decad",
    "year": "2018-I",
    "options": {
      "a": "The Intergovernmentai Panel on Climate Change",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 1,
    "text": "Carbon monoxide (b) The UNEP Secretariat 2. Methane (c) The UNFCCC Secretariat 3. Ozone (d) The World Meteorological Organisation 139. Which one of the following national parks lies 4. Sulphur dioxide completely in the Temperate alpine zone?",
    "year": "2019-I",
    "options": {
      "a": "Manas national park to the burning of crop/biomass residue?",
      "b": "2, 3 and 4 only",
      "c": "1 and 4 only",
      "d": "1,2,3 and 4"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 4,
    "text": "Among the States in India, the highest elephant population is in Kerala. 1. It is spread over two districts. Which of the statements given above is/ are correct ? 2. There is no human habitation inside the Park. (a) 1 and 2 only (b) 2 and 4 only 3. It is one of the natural habitats of the Great Indian (c) 3 only (d) 1, 3 and 4 only Bustard. 156. Which of the following Protected Areas are located i",
    "year": "2020-I",
    "options": {
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Deep Impact was a NASA space probe launched from scanning the exotic depths of the universe after the Cape Canaveral Air Force Station on January 12, 2005. It ASTROSAT, the Indian Space Research Organisation’s was designed to study the interior composition of the comet multi-wavelength space observatory, was successfully Tempel 1. placed in orbit."
  },
  {
    "number": 2,
    "text": "Papikonda National park 3. Sathyamangalam Tiger Reserve 1. 36% of India’s districts are classified as 4. Wayanad Wildlife sanctuary “overexploited” or “critical” by the Central Ground Select the correct answer using the code given below : Water Authority (CGWA). (a) 1 and 2 only (b) 3 and 4 only 2. CGWA was formed under the Environment (c) 1, 3 and 4 only (d) 1,2,3 and 4 (Protection) Act. 157. Wit",
    "year": "2020-I",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only",
      "c": "2 only",
      "d": "1 and 3 only"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 151,
    "text": "Among the following Tiger Reserves, which one has the 158. Which one of the following protected areas is well- largest area under “Critical Tiger Habitat”?",
    "year": "2020-I",
    "options": {
      "a": "Corbett",
      "b": "Ranthambore ground and is exclusively graminivorous?",
      "c": "Nagarjunsagar-Srisailam",
      "d": "Sunderbans"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Legume intensification E 62 Topicwise Solved Papers HINTS & SOLUTIONS 1. (d) National Forest Policy, 1988 describes the protection 10. (b) of forest and development of forest. It does not describe • Bhiterkanika, Orissa is a protected area for salt water the use of insecticide and pesticide in forest areas. crocodile, where breeding is the main purpose of that 2. (a) A keystone species is a specie",
    "year": "2008",
    "options": {
      "a": "Apophis",
      "b": "Cassini"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 2,
    "text": "PSLVs were used to launch IRS-series of satellites. (b) To study the satellites of Saturn 3. India used the indigenously built cryogenic engines (c) To study the colourful of display of high latitude skies foer the first time for powering the third stage of GSLV. (d) To build a space laboratory to study the stellar 4. GSAT, launched in the year 2001, has payloads to explosions demonstrate digital ",
    "year": "2010",
    "options": {
      "a": "1, 2, 3 and 4",
      "b": "2, 3 and 4",
      "c": "1, 2 and 4",
      "d": "1 and 3 distance education in India"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 2,
    "text": "Assertion (A) : Artificial satellites are always launched from (b) The name given to the next Moon Impact Probe, for the earth in the eastward direction. Chandrayan-II Reason (R) : The earth rotates from west to east and so the (c) A geoportal of ISRO with 3 D imaging capabilities of satellite attains the escape velocity.",
    "year": "2002",
    "options": {
      "a": "Both A and R are true and R is the correct explanation",
      "d": "A space telescope developed by India of A"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 2,
    "text": "Photovoltaics generates Alternating Current (AC), (a) Halley’s Comet (b) Hale-Bopp while Solar Thermal generates Direct Current (DC). (c) Hyakutake (d) Tempel 1 3. India has manufacturing base for Solar Thermal 5. Which one of the following pairs is not correctly matched? technology, but not for Photovoltaics.",
    "year": "2007",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only",
      "c": "1, 2 and 3",
      "d": "None"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 1,
    "text": "Cassini-Huygens : Orbiting the Venus and (a) China (b) European Union transmitting data to the Earth (c) Japan (d) USA 2. Messenger : Mapping and investigating 7. ISRO successfully conducted a rocket test using cryogenic the Mercury engines in the year 2007. Where is the teststand used for 3. Voyager 1 and 2 : Exploring the outer solar the purpose, located?",
    "year": "2008",
    "options": {
      "a": "Balasore",
      "b": "Thiruvananthapuram Select the correct answer using the code given below.",
      "c": "Mahendragiri",
      "d": "Karwar"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 2,
    "text": "made India the second country to have a spacecraft orbit the Mars after USA (a) Voyager-2 (b) New Horizons 3. made India the only country to be successful in (c) LISA Pathfinder (d) Evolved LISA making its spacecraft orbit the Mars in its very first attempt B. Defence Which of the statements given above is/are correct? (a) 1 only (b) 2 and 3 only 22. Consider the following statements:",
    "year": "2007",
    "options": {
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 2,
    "text": "Prithivi-II is a surface-to-surface missile and can be (b) wireless communication technology deployed to guard the metros against air attacks. (c) solar power production technology Which of the statements given above is/are correct? (d) water conservation technology (a) 1 only (b)2 only 17. The terms 'Event Horizon', 'Singularity', `String Theory' (c) Both 1 and 2 (d)Neither 1 nor 2 and 'Standard ",
    "year": "2017-I",
    "options": {
      "a": "Observation and understanding of the Universe",
      "b": "Study of the solar and the lunar eclipses developed by the United States of America",
      "c": "Placing satellites in the orbit of the Earth",
      "d": "Origin and evolution of living organisms on the Earth Canada"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 1,
    "text": "IRNSS has three satellites in geostationary and four by the European Union satellites in geosynchronous orbits. 24. From which one of the following did India buy the Barak 2. IRNSS covers entire India and about 5500 sq. km anti-missile defence systems?",
    "year": "2008",
    "options": {
      "a": "Israel",
      "b": "France"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 3,
    "text": "India will have its own satellite navigation system (c) Russia (d) USA with full global coverage by the middle of 2019. 25. In the context of the Indian defence, what is ‘Dhruv’? Which of the statements given above is/are correct? (a) Aircraft-carrying warship",
    "year": "2008",
    "options": {
      "a": "1 only",
      "b": "1 and 2 only",
      "c": "2 and 3 only",
      "d": "None"
    },
    "answer": "c",
    "explanation": "METSAT was the first Indian (ISRO), Meterological spacecraft orbiting the planet Mercury. Voyager 1 geostationary satellite designed to simultaneously obtain (September 1977) and voyager 2 (Aug 1977) were launched atmospheric cloud cover, water vapour and temperature data. to study the outer Solar System. PSLV–C4 carried a payload of 1060 kg in to a"
  },
  {
    "number": 1,
    "text": "The Shourya missile flies with a speed of more than 8 launch communication satellites. Mach. 2. Satellites launched by PSLV appear to remain 2. The range of Shourya missile is more than permanently fixed in the same position in the sky, as 1600 km. Which of the statements given above is/are viewed from a particular location on Earth. correct? 3. GSLV Mk III is a four-staged launch l vehicle with (",
    "year": "2009",
    "options": {
      "a": "1 only",
      "b": "2 and 3"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 1,
    "text": "INS Sindhughosh is an aircraft carrier. (c) 1 and 2 (d) 3 only 2. INS Viraat is a submarine. 20. For the measurement/estimation of which of the Which of the statements given above is/are correct? following are satellite images/remote sensing data used? (a) 1 only (b) 2 only",
    "year": "2019-I",
    "options": {
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2 5337_DBE Science & Technology E 73"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 28,
    "text": "With reference to Agni-IV Missile, which of the following 36. To meet its rapidly growing energy demand, some opine that statements is/are correct? [2014 - I] India should pursue research and development on thorium 1. It is a surface-to-surface missile. as the future fuel of nuclear energy. In this context, what 2. It is fuelled by liquid propellant only advantage does thorium hold over uranium? [",
    "year": "2015-I",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only",
      "c": "1 and 3 only",
      "d": "1, 2 and 3 Indian Defence"
    },
    "answer": "a",
    "explanation": "Agni IV is a surface-to-surface missile. It is fuelled by • GSLV is a 3-stage launch vehicle, where first 2 stages solid propellant. It can deliver one-tonne nuclear warheads are similar to PSLV with same solid and liquid nature of about 4000 km away. fuel but the third stage is completely different, i.e.,"
  },
  {
    "number": 37,
    "text": "India is an important member of the ‘International (b) India's satellite to provide services to the countries of Thermonuclear Experimental Reactor’. If this experiment Indian Ocean Rim succeeds, what is the immediate advantage for India? (c) a scientific establishment set up by India in Antarctic",
    "year": "2016-I",
    "options": {
      "a": "It can use thorium in place of uranium for power",
      "b": "It can attain a global role in satellite navigation",
      "d": "India's underwater observatory to scientifically study generation the Arctic region"
    },
    "answer": "d",
    "explanation": "(i) The ITER (International Thermonuclear single immune cell. Experimental Reactor) project aims to make the long-"
  },
  {
    "number": 30,
    "text": "Which one of the following is the best description of ‘INS (c) It can drastically improve the efficiency of its fission Astradharini’, that was in the news recently? reactors in power generation (a) Amphibious warfare ship",
    "year": "2016-I",
    "options": {
      "b": "Nuclear-powered submarine",
      "d": "It can build fusion reactors for power generation"
    },
    "answer": "c",
    "explanation": "INS Astradharini is an indigenously designed and Evolved LISA fitting the question statement. So, (d) built torpedo launch and recovery vessel built by Shoft answer. Shipyard for Indian Navy. It was commissioned by Indian B. Defence Navy on 6 October 2015 at Naval Base in Visakhapatanam."
  },
  {
    "number": 38,
    "text": "In India, why are some nuclear reactors kept under (c) Torpedo launch and recovery vessel “IAEA Safeguards” while others are not ?",
    "year": "2020-I",
    "options": {
      "a": "Some use uranium and others use thorium",
      "d": "Nuclear-powered aircraft carrier"
    },
    "answer": "b",
    "explanation": "4"
  },
  {
    "number": 1,
    "text": "Researchers using Carbon 14 isotope (c) Development of stem cells into functional embryos 2. X-ray technician (d) Prevention of mitochondrial diseases in offspring 3. Coal miner 4. Dyer and painter C. Nuclear Technology Select the correct answer by using the codes given below 33. In which one of the following areas did the Indira Gandhi Codes: Centre for Atomic Research make significant progress i",
    "year": "2006",
    "options": {
      "a": "Reprocessing the uranium-plutonium mixed carbide",
      "c": "1, 2 and 4",
      "d": "1, 3 and 4"
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 40,
    "text": "Which one of the following techniques can be used to fuel of the Fast Breeder Test Reactor. establish the paternity of a child?",
    "year": "1997",
    "options": {
      "a": "Protein analysis",
      "b": "New applications of radioisotopes in metallurgy.",
      "c": "A new technology for production of heavy water.",
      "d": "A new technology for high level nuclear waste"
    },
    "answer": "d",
    "explanation": "DNA finger printing technology is the process of of the indigenous plutonium-uranium mixed carbide nuclear establishing the biological paternal relationship between fuel for the fast breeder test reactor. The fuel has performed individual and his alleged child on the analysis of sample satisfactorily and produced for the first time in our country, cells taken from each of them. nuclear electricity from a fast reactor. DNA finger printing can solve cases of rape murder etc."
  },
  {
    "number": 34,
    "text": "In which one of the following locations is the International 41. Assertion (A) : Insect resistant transgenic cotton has been Thermonuclear Experimental Reactor (ITER) project to be produced by inserting Bt gene. built?",
    "year": "2008",
    "options": {
      "a": "Northern Spain",
      "b": "Southern France",
      "c": "Eastern Germany",
      "d": "Southern Italy"
    },
    "answer": "b",
    "explanation": "ITER (International Thermonuclear Experimental"
  },
  {
    "number": 35,
    "text": "In the year 2008, which one of the following conducted a (b) Both A and R are true but R is not a correct explanation of A complex scientific experiment in which sub-atomic particles (c) A is true but R is false were accelerated to nearly the speed of light?",
    "year": "2009",
    "options": {
      "a": "European Space Agency",
      "b": "European Organization for Nuclear Research",
      "d": "A is false but R is true"
    },
    "answer": "b",
    "explanation": "European organisation for Nuclear Research conducted laboratory ( in vitro). Dolly was a clonned animal, but not a complex scientific experiment in year 2008, in which sub. the first cloned mammal. A mice was cloned first. atomic particles were accelerated to nearly the speed of light."
  },
  {
    "number": 2,
    "text": "Almost 50 per cent of human beings have Rh+ blood (b) Both A and R are true but R is not a correct explanation of A while the remaining have Rh– blood. (c) A is true but R is false Which of the statements given above is / are correct ? (d) A is false but R is true (a) 1 only (b) 2 only (c) Both 1 and 2 (d) Neither 1 nor 2 43. Assertion (A) : “DNA finger printing” has become a 50. Which one of the ",
    "year": "2008",
    "options": {
      "a": "Ministry of Agriculture semen are adequate for DNA analysis.",
      "b": "Ministry of Science and Technology Codes:",
      "c": "Ministry of New and Renewable Energy",
      "d": "Ministry of Rural Development of A"
    },
    "answer": "c",
    "explanation": "The surface velocity of rotation varies from point to The main objectives of oceansat-2 are to study surface winds point on the Earth. It is about 1600 km per hour or about 460 and ocean surface strata, observation of chlorophyll meters in a second near the equator. The velocity gradually concentration, monitoring of phytoplanktion blooms, study reduces as we move to the poles and it is practically zero of atmospheric aerosol and suspended sediments in wath. there. A satellite launched from the "
  },
  {
    "number": 51,
    "text": "In the context of alternative sources of energy, ethanol as a (b) Both A and R are true but R is not a correct explanation viable bio-fuel can be obtained from",
    "year": "2009",
    "options": {
      "a": "Potato",
      "b": "Rice",
      "c": "A is true but R is false",
      "d": "Wheat"
    },
    "answer": "c",
    "explanation": "Sugarcane ethanol is an alcohol-based fuel produced transgenic plants. by the fermentation of sugarcane juice and molasses."
  },
  {
    "number": 52,
    "text": "In the context of CO emission and Global Warming, what is 44. Insect-resistant cotton plants have been genetically 2 the name of a market driven device under the UNFCC that engineered by inserting a gene from a/an",
    "year": "2000",
    "options": {
      "a": "virus",
      "b": "bacterium the developed countries to adopt better technologies that",
      "c": "insect",
      "d": "plant reduce greenhouse gas emissions?"
    },
    "answer": "c",
    "explanation": "The Clean Development Mechanism (CDM), defined can be easily treated if approached at the genetic level. So in Article 12 of the Protocol, allows a country with an instead of treating diseases based on the symptoms, emission-reduction or emission-limitation commitment under nanotechnology will help medical practitioners treat the the Kyoto Protocol (Annex B Party) to implement an problem by looking at the root cause. emission-reduction project in developing countries."
  },
  {
    "number": 45,
    "text": "Hybridoma technology is a new biotechnological approach (a) Carbon Footprint for commercial production of",
    "year": "2000",
    "options": {
      "a": "monoclonal antibodies",
      "b": "Carbon Credit Rating",
      "c": "Clean Development Mechanism",
      "d": "alcohol"
    },
    "answer": "a",
    "explanation": "Hybridoma technology is used to commercially and is widely distributed throughout the Earth's crust. All production of monoclonal antibodies. The monoclonal statements in this question are correct. antibodies are protective protein produced by the clone of"
  },
  {
    "number": 46,
    "text": "The American multinational company, Monsanto, has 53. With reference to the treatment of cancerous tumours, a produced an insect-resistant cotton variety that is tool called cyberknife has been making the news. In this undergoing field trials in India. A toxic gene from which one context, which one of the following statements is not correct ? of the following bacteria has been transferred to this ",
    "year": "2010",
    "options": {
      "a": "Bacillus subtilis",
      "b": "It delivers an extremely precise dose of radiation.",
      "c": "It has the capability of achieving sub-millimetre",
      "d": "It can map the spread of tumour in the body"
    },
    "answer": "b",
    "explanation": "Bacillus thuringiensis (Bt) is an insecticide with awaited transition from experimental studies of plasma unusual properties that make it useful for pest control in physics to full-scale electricity-producing fusion power certain situation. Bt is a naturally occurring bacterium stations. common in soils throughout the world. Several strains can (ii) As such project started in 2006, to find whether infect and kill insects. Nuclear fusion can be a source of energy and electricity in"
  },
  {
    "number": 1,
    "text": "The only source of human stem cells are the embryos (a) The grains have been fortified with genes to provide at blastocyst stage. three times higher grain yield per acre than other high 2. The stem cells can be derived without caisining yielding varieties destruction to blastocysts. (b) Its grains contain pro-vitamin A which upon ingestion 3. The stem cells can regenerate themselves in vitro is co",
    "year": "2005",
    "options": {
      "a": "Research on human stem cell which is likely to",
      "b": "Successful open heart procedure called arterial switch",
      "c": "It is a genetically engineered high biofuel yielding maize revolutionise treatment of deadly disease like cancer. variety",
      "d": "It is the latest technology to control the accidentally performed on an infant. caused flames from oil wells."
    },
    "answer": "a",
    "explanation": "All the statements about the Indian satellite given in with spatial resolutions ranging up to 1 metre. the question are correct."
  },
  {
    "number": 56,
    "text": "A genetically engineered form of brinjal, known as the Bt- treatment of deadly disease like AIDS. brinjal, has been developed. The objective of this is (d) Successful brain surgery to revive the function of nearly [2011 - I] dead brain of a premature born infant. (a) to make it pest-resistant. 49. Consider the following statements :",
    "year": "2006",
    "options": {
      "b": "to improve its taste and nutritive qualities. 1. ELISA test is employed as the first and most basic test",
      "c": "to make it drought-resistant. for an individual to detect cancer.",
      "d": "to make its shelf-life longer. 5337_DBE"
    },
    "answer": "a",
    "explanation": "Bt Brinjal is a transgenic brinjal created by inserting a Therefore Delhi University's then VC Dr. Deepak Pental gene cry1Ac from the soil bacterium Bacillus thuringiensis created GM mustard so that he could cross-pollinate Indian into Brinjal. This is said to give the Brinjal plant resistance variety with European variety to make new hybrid called against lepidopteran insects like the Brinjal Fruit and Shoot DMH-11. Hence #2 is right and #3 is wrong. And by Borer Leucinodes orbonalis and Fruit "
  }
]