[
  {
    "number": 1,
    "text": "He is appointed by the President of India of A 2. He must have the same qualifications as are required (b) Both A and R are true but R is not a correct explanation for a judge of the Supreme Court (c) A is true but R is false 3. He must be a member of either House of Parliament (d) A is false but R is true 4. He can be removed by impeachment by Parliament 14. If the Prime Minister of India belonge",
    "year": "1997",
    "options": {
      "a": "1 and 2",
      "b": "1 and 3",
      "c": "2, 3 and 4",
      "d": "3 and 4 a no-confidence motion"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 21,
    "text": "The primary function of the Finance Commission in India is (b) he will not be able to speak on the budget in the Lower to:",
    "year": "2000",
    "options": {
      "a": "distribution of revenue between the Centre and the",
      "b": "prepare the Annual Budget six months after being sworn in",
      "c": "he can make statements only in the Upper House States",
      "d": "he was to become a member of the Lower House within"
    },
    "answer": "b",
    "explanation": "The Indian Constitution provides for the establishment its affairs in accordance with tradiations and customs; and of a Consolidated Fund and a Public Account under Article shall have a separate Gram Sabha. 266 and a Contingency Fund for each State under Article 5337_DBE Panchayati Raj & Public Policy C 35 267. Disbursements from Public Accounts of India are not 1. To examine the annual audit reports of the comptroller subject to a Vote of Parliament. and auditor general of India (CAG), which ar"
  },
  {
    "number": 15,
    "text": "In the Presidential election in India, every elected member (d) allocate funds to various ministries of the Union and of the Legislative Assembly of a State shall have as many State Governments votes as there are multiples of one thousands in the quotient 22. The Parliament can make any law for the whole or any part obtained by dividing the population of the State by the India for implementing int",
    "year": "2000",
    "options": {
      "a": "1991 Census",
      "b": "with the consent of the majority of States population as ascertained by the:",
      "c": "with the consent of the States concerned",
      "d": "without the consent of any State"
    },
    "answer": "a",
    "explanation": "The objective of the price policy underlying MSP is to divisional level bring a balanced and integrated price structure for agricultural commodities and not to ensure maximum price Mandal Praja Parishad Andhra Pradesh for the farmers. Tribal Councils Meghalaya"
  },
  {
    "number": 23,
    "text": "The state which has the largest number of seats reserved 16. Match List I with List II and select the correct answer:",
    "year": "1997",
    "options": {
      "a": "Bihar",
      "c": "Uttar Pradesh",
      "d": "Madhya Pradesh A. President of India"
    },
    "answer": "c",
    "explanation": "Rural sanitation is not a subject in the Concurrent List. rehabilitation of manual scavengers in India. Ashif Public Health and Sanitation comes under the State List. Shaikh is well known for his role in the campaign Personal and food hygiene have been major cause of many (Rashatriya Garima Abhiyan) through various campaigns of diseases in developing countries. It was in this context that Jan Sahas. the central Rural Sanitation Programmer (CRSP) was (ii) Rashtriya Garima Abhiyaan is an NGO-led m"
  },
  {
    "number": 2,
    "text": "Faithful Discharge of 1. Cabinet Secretary Court duties 2. Chief Election Commissioner C. Members of 3. Faith and Allegiance 3. Union Cabinet Minister Parliament to the Constitution of 4. Chief Justice of India India Their correct sequence in the Order of Precedence is: D. Minister for the 4. Upholding the (a) 3, 4, 2, 1 (b) 4, 3, 1, 2 Union Constitution and the (c) 4, 3, 2, 1 (d) 3, 4, 1, 2 law 2",
    "year": "2001",
    "options": {
      "a": "A-3, B-4- C-1 D-2",
      "b": "A-4, B-3, C-2, D-1",
      "c": "A-3, B-4, C-2, D-1",
      "d": "A-4, B-3, C-1, D-2 Consolidated Fund of India"
    },
    "answer": "c",
    "explanation": "According to 73rd Amendment Act, three-tier system revenue. of Panchayats exists: Village level, District Panchayat at the Political accountability refers to the responsibility or district level, the intermediate Panchayat which stands obligation of government officials (both politicians and civil between the village and District Panchayats in the States servants) to act in the best interests of society or face where the population is above 20 Lakhs. consequences."
  },
  {
    "number": 17,
    "text": "Which one of the following is not a principle of (b) To audit and report on all expenditure from the \"Panchsheel\"?",
    "year": "1997",
    "options": {
      "a": "Non-alignment",
      "b": "Peaceful Co-existence and loss accounts",
      "c": "To audit and report on all trading, manufacturing, profit",
      "d": "To control the receipt and issue of public money, and to ensure that the public revenue is lodged in the exchequer sovereignty"
    },
    "answer": "c",
    "explanation": "The water (cess) Act, 1977 provides for the levy and its term; or in case of dissolution fresh election is to be collection of a cess on water consumed by persons conducted before the expiry of a period of 6 months from the carrying on certain industries and by local authorities, with date of its dissolution. a view to augment the resources of the Central Board and"
  },
  {
    "number": 18,
    "text": "Which one of the following statements about a Money Bill (a) Through Parliamentary Committees is not correct?",
    "year": "2000",
    "options": {
      "a": "A Money Bill can be tabled in either House of",
      "b": "Through Consultative Committees in various ministries",
      "c": "By making the administrators send periodic reports Parliament",
      "d": "By compelling the executive to issue writs"
    },
    "answer": "b",
    "explanation": "1"
  },
  {
    "number": 27,
    "text": "In which one of the following areas does the State whether a Bill is a Money Bill or not Government not have control over its local bodies?",
    "year": "2001",
    "options": {
      "a": "Citizens’ grievances",
      "b": "Financial matters the Lok Sabha and send it for consideration within 14",
      "c": "The Rajya Sabha must return a Money Bill passed by",
      "d": "Personnel matters days"
    },
    "answer": "a",
    "explanation": "Article 243ZE – Committee on Metropolitan Planning lapsable, i.e., the entitlement of funds not released in a does not have a sole responsibility for implementing particular year is carried forward to the subsequent Government sponsored schemes in metropolitan area. years, subject to eligibility. So, #3 is wrong. Upon Metropolitan planning committee is constituted under the reading the official guidelines page 34: District Authority provisions of the constitution of India. would inspect at least"
  },
  {
    "number": 1,
    "text": "The Representation of the People Act, 1951 provides 19. The Speaker can ask a member of the House to stop speaking for the registration of political parties and let another member speak. This phenomenon is known 2. Registration of political parties is carried out by the as:",
    "year": "2000",
    "options": {
      "a": "decorum",
      "b": "crossing the floor"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 1,
    "text": "The joint sitting of the two houses of the Parliament in Election commission India is sanctioned under Article 108 of the Constitution Which of these statement are correct? 2. The first joint sitting of Lok Sabha and Rajya Sabha (a) 1, 2 and 4 (b) 1 and 3 was held in the year 1961 (c) 2 and 4 (d) 1, 2, 3 and 4 3. The second joint sitting of the two Houses of Indian 29. With reference to Indian pol",
    "year": "2002",
    "options": {
      "a": "Planning Commission is accountable to the Parliament Which of these statements is correct?",
      "b": "President can make ordinance only when either of the",
      "c": "1 and 3",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 36,
    "text": "Which one of the following Bills must be passed by each Judge of the Supreme Court is 40 years House of the Indian Parliamentary separately by special (d) National Development Council is constituted of Union majority?",
    "year": "2003",
    "options": {
      "a": "Ordinary Bill States",
      "b": "Money Bill"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 4,
    "text": "The term of office of the Election Commissioner is five 1. to allow the withdrawal of the money out of the years from the date he assumes his office or till the day Consolidated Fund of India he attains the age of 62 years, whichever is earlier 2. to allocate between the States the shares of proceeds Which of these statements are correct? of taxes (a) 1 and 2 (b) 2 and 3 3. to consider application",
    "year": "2002",
    "options": {
      "a": "` 5,000 and ` 2,500",
      "b": "2 and 3",
      "c": "3 and 4",
      "d": "1, 2 and 4"
    },
    "answer": "d",
    "explanation": "Provision given in option (d) is not included under years. 73rd Amendment Act 1993."
  },
  {
    "number": 1,
    "text": "the value of the vote of an elected Member of (a) cannot be extended under any circumstances Legislative Assembly equals (b) can be extended by six months at a time State Population (c) can be extended by one year at a time during the = ×100 Number of Elected MLAs of the State proclamation of emergency (d) can be extended for two years at a time during the 2. the value of the vote of an elected Me",
    "year": "2002",
    "options": {
      "a": "Finance Commission",
      "b": "Only 2",
      "c": "1 and 3",
      "d": "Only 3"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 1,
    "text": "While members of the Rajya Sabha are associated with 34. Which one of the following statements is correct?",
    "year": "2003",
    "options": {
      "a": "Only the Rajya Sabha and not the Lok Sabha can have Undertakings, members of Committee on Estimates are nominated members drawn entirely from the Lok Sabha",
      "b": "There is a constitutional provision for nominating"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 2,
    "text": "The Ministry of Parliamentary Affairs works under the two members belonging to the Anglo-Indian overall direction of Cabinet Committee on Parliamentary community to the Rajya Sabha Affairs (c) There is no constitutional bar for a nominated member 3. The Ministry of Parliamentary Affairs nominates to be appointed as a Union minister Members of Parliament on Committees, Councils, Board (d) A nominat",
    "year": "2003",
    "options": {
      "a": "Defence",
      "d": "Rajya Sabha alone"
    },
    "answer": "c",
    "explanation": "According to 73rd Amendment Act, three-tier system revenue. of Panchayats exists: Village level, District Panchayat at the Political accountability refers to the responsibility or district level, the intermediate Panchayat which stands obligation of government officials (both politicians and civil between the village and District Panchayats in the States servants) to act in the best interests of society or face where the population is above 20 Lakhs. consequences."
  },
  {
    "number": 47,
    "text": "With reference to the Constitution of India, which one of (b) Environment and Forests the following pairs is not correctly matched?",
    "year": "2004",
    "options": {
      "a": "Forests : Concurrent List",
      "b": "Stock Exchange : Concurrent List",
      "c": "Home Affairs",
      "d": "Science and Technology"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 42,
    "text": "With reference to Indian Parliament, which one of the (c) Post Office Savings Bank : Union List following is not correct?",
    "year": "2004",
    "options": {
      "a": "The Appropriation Bill must be passed by both the",
      "d": "Public Health : State List"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The highest deciding body for planning in India is the (b) No money shall be withdrawn from the Consolidated Planning Commission of India Fund of India except under the appropriation made by 2. The Secretary of the Planning Commission of India is the Appropriation Act also the Secretary of National Development Council (c) Finance Bill is required for proposing new taxes but no 3. The Constitution ",
    "year": "2004",
    "options": {
      "c": "2 only",
      "d": "3 only"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 1,
    "text": "Fourth general elections in India 2. Preparation of electoral rolls for all elections to the 2. Formation of Haryana state Parliament, state Legislatures and the Office of the 3. Mysore named as Karnataka state President and the Vice-President 4. Meghalaya and Tripura become full states 3. Giving recognition to political, parties and allotting Which one of the following is the correct chronologica",
    "year": "2005",
    "options": {
      "a": "1, 2 and 3",
      "b": "2, 3 and 4",
      "c": "1 and 3",
      "d": "1, 2 and 4"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 1,
    "text": "The Rajya Sabha alone has the power to declare that it 2. Unless sooner dissolved or there is an extension of would be in national interest for the Parliament to the term, there is an automatic dissolution of the Lok legislate with respect to a matter in the State List. Sabha by efflux of time, at the end of the period of five 2. Resolutions approving the proclamation of Emergency years, even if n",
    "year": "2004",
    "options": {
      "a": "In the Lok Sabha, a no-confidence motion has to set",
      "b": "Both A and R are true but R is not a correct explanation of A",
      "c": "A is true but R is false no conditions of admissibility have been laid down in",
      "d": "A is false but R is true the Rules"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 60,
    "text": "With reference to the Union Government, consider the (a) Hukum Singh (b) G.V. Mavalankar following statements:",
    "year": "2009",
    "options": {
      "c": "K. M. Munshi",
      "d": "U.N. Dhebar"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Number of Ministries at the Centre on 15th August List-I (Person) List-II (Position) 1947 was 18. A. Nagendra Singh 1. Chief Election 2. Number of Ministries at the Centre at present is 36. Commissioner of India Which of the statements given above is/are correct? B. A. N. Ray 2. President, International (a) 1 only (b) 2 only Court of Justice (c) Both 1 and 2 (d) Neither 1 nor 2 C. R. K. Trivedi 3.",
    "year": "2010",
    "options": {
      "a": "A-1; B-4; C-2; D-3",
      "b": "A-2; B-3; C-1; D-4",
      "c": "A-1; B-3; C-2; D-4",
      "d": "A-2; B-4; C-1; D-3 District Forum in a district if it deems fit."
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 59,
    "text": "Consider the following statements:",
    "year": "2008",
    "options": {
      "b": "One of the members of the District Forum shall be a woman The Constitution of India provides that:",
      "c": "The District Forum entertains the complaints where"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 82,
    "text": "Consider the following statements : [2014 - I] 1 The Legislative Council of a State in India can be larger 1. The President shall make rules for the more convenient in size than half of the Legislative Assembly of that transaction of the business of the Government of India, particular State and for the allocation among Ministers of the said 2. The Governor of a State nominates the Chairman of busi",
    "year": "2015-I",
    "options": {
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The Department of Revenue is responsible for the 83. The power to increase the number of judges in the Supreme preparation of Union Budget that is presented to the Court of India is vested in [2014 - I] Parliament. (a) the President of India 2. No amount can be withdrawn from the Consolidated (b) the Parliament Fund of India without the authorization from the (c) the Chief Justice of India Parliam",
    "year": "2015-I",
    "options": {
      "a": "Lok Sabha is elected directly by the people",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 1,
    "text": "The Rajya Sabha has no power either to reject or to (d) the head of the government cannot be changed amend a Money Bill. without election. 2. The Rajya Sabha cannot vote on the Demands for 101. Out of the following statements, choose the one that Grants. brings out the principle underlying the Cabinet form of 3. The Rajya Sabha cannot discuss the Annual Financial Government:",
    "year": "2017-I",
    "options": {
      "a": "An arrangement for minimizing the criticism against Which of the statements given above is / are correct? the Government whose responsibilities are complex",
      "b": "1 and 2 only and hard to carry out to the satisfaction of all.",
      "c": "2 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 93,
    "text": "When a bill is referred to a joint sitting of both the Houses Government whose responsibilities are increasing day of the Parliament, it has to be passed by",
    "year": "2015-I",
    "options": {
      "a": "a simple majority of members present and voting",
      "b": "three-fourths majority of members present and voting ensuring collective responsibility of the Government",
      "c": "A mechanism of parliamentary democracy for",
      "d": "absolute majority of the Houses"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "A private member's bill is a bill presented by a (b) the methods for strengthening executive leadership. Member of Parliament who is not elected but only (c) a superior individual with dynamism and vision. nominated by the President of India. (d) a band of dedicated party workers. 2. Recently, a private member's bill has been passed in 96. One of the implications of equality in society is the the ",
    "year": "2017-I",
    "options": {
      "a": "Privileges",
      "b": "Restraints",
      "c": "Competition",
      "d": "Ideology"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 98,
    "text": "Which one of the following is not a feature of Indian 1. In the election for Lok Sabha or State Assembly, the federalism?",
    "year": "2017-I",
    "options": {
      "a": "There is an independent judiciary in India. the votes polled, to be declared elected.",
      "b": "Powers have been clearly divided between the Centre"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 106,
    "text": "Right to vote and to be elected in India is a",
    "year": "2017-I",
    "options": {
      "a": "Federalism",
      "b": "Natural Right",
      "c": "Constitutional Right",
      "d": "Legal Right"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Union Ministry of Home Affairs decides the election (a) the executive and legislature work independently. schedule for the conduct of both general elections (b) it provides continuity of policy and is more efficient. and by-elections. C 22 Topicwise Solved Papers 3. Election Commission resolves the disputes relating 2. The emoluments and allowances of the Governor of to splits/mergers of recognize",
    "year": "2018-I",
    "options": {
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "c",
    "explanation": "According to 73rd Amendment Act, three-tier system revenue. of Panchayats exists: Village level, District Panchayat at the Political accountability refers to the responsibility or district level, the intermediate Panchayat which stands obligation of government officials (both politicians and civil between the village and District Panchayats in the States servants) to act in the best interests of society or face where the population is above 20 Lakhs. consequences."
  },
  {
    "number": 2,
    "text": "The above-mentioned Act was amended five times. (a) Committee on Government Assurances (b) Committee on Subordinate Legislation 3. The term 'Office of Profit' is well-defined in the (c) Rules Committee Constitution of India. (d) Business Advisory Committee Which of the following statements given above is/are 110. Regarding Money Bill, which of the following statements correct? is not correct?",
    "year": "2018-I",
    "options": {
      "a": "1 and 2 only",
      "b": "3 only",
      "c": "2 and 3 only",
      "d": "1,2 and 3 only provisions relating to imposition, abolition,"
    },
    "answer": "c",
    "explanation": "According to 73rd Amendment Act, three-tier system revenue. of Panchayats exists: Village level, District Panchayat at the Political accountability refers to the responsibility or district level, the intermediate Panchayat which stands obligation of government officials (both politicians and civil between the village and District Panchayats in the States servants) to act in the best interests of society or face where the population is above 20 Lakhs. consequences."
  },
  {
    "number": 1,
    "text": "The value of the vote of each MLA varies from State should be a detached figure without intense political links to State. or should not have taken part in politics in the recent 2. The value of the vote of MPs of the Lok Sabha is past?",
    "year": "2019-I",
    "options": {
      "a": "",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "National Commission to Review the Working of the"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 2,
    "text": "The Constitution of India provides for three sessions (b) Absence of restraint of the Parliament in a year, but it is not mandatory to (c) Opportunity to do whatever one likes (d) Opportunity to develop oneself fully conduct all three sessions 121. In the context of India, which one of the following is the 3. There is no minimum number of days that the Parliament is required to meet in a year. cha",
    "year": "2020-I",
    "options": {
      "a": "An agency widening the scope of parliamentary",
      "b": "2 only democracy",
      "c": "1 and 3 only",
      "d": "2 and 3 only"
    },
    "answer": "c",
    "explanation": "According to 73rd Amendment Act, three-tier system revenue. of Panchayats exists: Village level, District Panchayat at the Political accountability refers to the responsibility or district level, the intermediate Panchayat which stands obligation of government officials (both politicians and civil between the village and District Panchayats in the States servants) to act in the best interests of society or face where the population is above 20 Lakhs. consequences."
  },
  {
    "number": 124,
    "text": "Rajyasabha has equal powers with Loksabha in",
    "year": "2020-I",
    "options": {
      "a": "The matter of creating new all India services economic growth",
      "b": "Amending the Constitution",
      "c": "An agency for facilitating political stability and",
      "d": "An agency for the implementation of public policy"
    },
    "answer": "b",
    "explanation": "This is known as the negative concept of liberty. Early • Article 312: With regards to the creation of All India liberalism championed negative liberty. John Stuart Mill, Services, Rajya Sabha has special powers such that if Rajya the nineteenth century English political philosopher, Sabha is passing a resolution by a majority of 2/3rd of the described, “Restraint as an evil”. So, (d) is appropriate. members present and voting, Parliament may, by law, create · However, after the examination, man"
  },
  {
    "number": 1,
    "text": "According to the Constitution of India, a person who is 125. A constitutional government by definition is a",
    "year": "2020-I",
    "options": {
      "a": "government by legislature months even if he/she is not a member of that state.",
      "b": "popular government"
    },
    "answer": "d",
    "explanation": "Section C of the Forest Dwellerwws Act provides a transparent three step procedure for deciding on who gets rights. Publisher Publication Firstly, the Gram Sabha makes a recommendation- i.e, who Ministry of Industry Wholesale Price India has been cultivating land for how long, which minor forest produce is collected; etc. The Gram Sabha plays this role Central statistical National Accounts Statistics because it is a public body where all people participate and organization hence is fully democra"
  },
  {
    "number": 2,
    "text": "According to the Representation of People Act,1951, (c) Multi party government a person convicted of a criminal offence and sentenced (d) Limited government to imprisonment for five years is permanently 126. If the RBI decides to adopt an expansionist monetary policy, disqualified from contesting an election even after his which of the following would it not do ?",
    "year": "2020-I",
    "options": {
      "a": "1 only",
      "b": "2 only 3. Cut the Bank Rate and Repo Rate",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2 Select the correct answer using the code given below :"
    },
    "answer": "c",
    "explanation": "According to 73rd Amendment Act, three-tier system revenue. of Panchayats exists: Village level, District Panchayat at the Political accountability refers to the responsibility or district level, the intermediate Panchayat which stands obligation of government officials (both politicians and civil between the village and District Panchayats in the States servants) to act in the best interests of society or face where the population is above 20 Lakhs. consequences."
  }
]