[
  {
    "number": 2,
    "text": "age of consent 1. The Rights of Development 3. restitution of conjugal rights 2. The Right to Expression Select the correct answer using the code given below: 3. The Right to Recreation (a) 1 and 2 only (b) 2 and 3 only Which of the above is/are the Rights of the child ? (a) 1 only (b) 1 and 3 (c) 1 and 3 only (d) 1,2 and 3 (c) 2 and 3 (d) 1, 2 and 3 28. In India, separation of judiciary from the ",
    "year": "2010",
    "options": {
      "a": "The Preamble of the Constitution of India on matters of law or fact:",
      "b": "A Directive Principle of state policy"
    },
    "answer": "a",
    "explanation": "Article – 226 of the constitution empowers a high court own which was established in the year 1966. As if 2018. to issue writs. There are 24 High courts in India. Also when the chief justice of a High court acts in an"
  },
  {
    "number": 1,
    "text": "It can establish and administer exclusive educational (b) the Right against Exploitation institutions. (c) the Cultural and Educational Rights 2. The President of India automatically nominates a (d) the Right to Equality representative of the community to Lok Sabha. 5337_DBE Judiciary & Legal Rights, Issues etc. C 39 3. It can derive benefits from the Prime Minister’s 44. \"Rule of Law Index\" is re",
    "year": "2018-I",
    "options": {
      "a": "Amnesty International",
      "b": "2 and 3",
      "c": "1 and 3",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "According to Article 131, The SC has original a common HC at Chandigarh. jurisdiction in any dispute - (a) between the Government of In the year 2013, three new High Courts in the northeast - India & one or more States; or (b) between the Government Meghalaya, Manipur and Tripura were created taking the of India and any State or States on one side and one or more total number of High Courts in the country from 21 to 24. other States on the other; or (c) between two or more States National Capita"
  },
  {
    "number": 40,
    "text": "With reference to consumers’ rights/privileges under the 1. As per recent amendment to the India Forest Act, provisions of law in India, which of the following statements 1927, forest dwellers have the right to fell the bamboos is/are correct? [2012 - I] grown on the forest areas. 1. Consumers are empowered to take samples for food 2. As per the Scheduled Tribes and Other Traditional testing. Fore",
    "year": "2019-I",
    "options": {
      "a": "advisory jurisdiction",
      "b": "appellate jurisdiction",
      "c": "original jurisdiction",
      "d": "writ jurisdiction"
    },
    "answer": "c",
    "explanation": "Consumers are empowered to take samples for food or business to all citizens subject to caution restrictions. testing. In case of death of a consumer his/her legal heir can"
  },
  {
    "number": 43,
    "text": "In India, Judicial Review implies",
    "year": "2017-I",
    "options": {
      "a": "the power of the Judiciary to pronounce upon the Rs. 1,00,000 constitutionality of laws and executive orders. 2. Transgender with an annual income of less than",
      "b": "3 and 4 only judgements given earlier in similar or different cases.",
      "c": "the power of the Judiciary to review all the legislative annual income of less than Rs. 3,00,000 enactments before they are assented to by the 4. All Senior Citizens President. Select the correct answ",
      "d": "the power of the Judiciary to review its own"
    },
    "answer": "a",
    "explanation": "New NCERT, Std. 11, Indian Constitution at Work, Chapter-6 Judiciary, Page 139 • Article 16 ® Equality of opportunity in matters of public employment • Judicial review means the power of SC or HC to • Article 17 ® Abolition of untouchability examine the constitutionality of any law. So, \"A\" is the most fitting option. • Article 18 ® Abolition of titles"
  }
]