[
  {
    "number": 2,
    "text": "Assam is not an independent tier in the federal system C. Tribal Councils 3. Mizoram (b) 30% of the seats in local bodies are reserved for women D. Absence of Village 4. Meghalaya (c) Local government finances are to be provided by a Panchayats Commission Codes : (d) Elections to local bodies are to be determined by a (a) A-2, B-1, C-4, D-3 (b) A-1, B-2, C-4, D-3 Commission (c) A-3, B-2, C-1, D-4 ",
    "year": "1996",
    "options": {
      "a": "Single tier structure of local self government at the",
      "b": "3 months village level .",
      "c": "6 months",
      "d": "1 year"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 8,
    "text": "In India, the first Municipal Corporation was set up in which (b) Two tier system of local self government at the village one among the following?",
    "year": "2009",
    "options": {
      "a": "Calcutta",
      "b": "Madras",
      "c": "Three tier structure of local self government at the",
      "d": "Delhi village, block and district levels"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "State Election Commissions to conduct all panchayat (a) Rajasthan (b) Tamil Nadu elections. (c) Kerala (d) Karnataka 3. Establishment of State Finance Commission. 4. In the new Panchayati Raj Bill enacted in 1993, there are Select the correct answer using the codes given below: several fresh provisions deviating from the past. Which (a) 1 only (b) 1 and 2 only one of the following is not one such ",
    "year": "1999",
    "options": {
      "a": "A number of added responsibilities in the area of",
      "c": "2 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 10,
    "text": "In the areas covered under the Panchayat (Extension to the agriculture, rural development, primary education and Scheduled Areas) Act, 1996, what is the role/power of Gram social forestry among other Sabha? [2012 - I] (b) Elections being made mandatory for all posts at the 1. Gram Sabha has the power to prevent alienation of time they are due land in the Scheduled Areas. (c) A statutory representa",
    "year": "2000",
    "options": {
      "a": "he obtains permission from the principal of his college be the authority to initiate the process for determining the",
      "b": "he is a member of a political party nature and extent of individual or community forest rights or",
      "c": "his name figures in the voters’ list both?",
      "d": "he files a declaration owing allegiance to the"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 20,
    "text": "Which one of the following statements is NOT correct? Select the correct answer using the code given below.",
    "year": "2003",
    "options": {
      "a": "1, 2 and 3 only",
      "b": "2 and 4 only",
      "c": "1 and 3 only",
      "d": "1, 2, 3 and 4 judicial body established under an Act of the Parliament."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "To stabilize agricultural prices 3. Appropriations and disbursements under the Railway 2. To ensure meaningful real income level to the farmers Budget are subject to the same form of parliamentary 3. To protect the interest of the consumers by providing control as other appropriations and disbursements essential agricultural commodities at reasonable rates Which of the statements given above are c",
    "year": "2004",
    "options": {
      "a": "Culture",
      "c": "1, 3 and 4",
      "d": "2, 3 and 4"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 16,
    "text": "Consider the following statements regarding the National (b) Tourism Human Rights Commission of India: (c) Science and Technology 1. Its Chairman must be a retired Chief Justice of India (d) Human Resource Development 2. It exists in each state as State Human Rights 23. Assertion (A) : The Central Rural Sanitation Programme Commission was launched in 1986 to improve the quality of life of rural 3.",
    "year": "1999",
    "options": {
      "a": "1, 2, 3 and 4",
      "b": "2 and 4 following is correct?",
      "c": "2 and 3",
      "d": "1, 3 and 4"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 17,
    "text": "Which one of the following legislations does not deal with explanation of A. the protection of environment?",
    "year": "1999",
    "options": {
      "b": "Both A and R are individually true but R is not the",
      "c": "A is true but R is false.",
      "d": "A is false but R is true"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The nation-wide scheme of the National Child Labour 3. A highlight of the United Nations Convention against Projects (NCLP) is run by the Union Ministry of Social Transnational organized Crime (UNTOC) is the Justice and Empowerment. inclusion of a specific chapter aimed at returning 2. Gurupadswamy Committee dealt with the issues of child assets to their rightful owners from whom they had labour. ",
    "year": "2016-I",
    "options": {
      "a": "rehabilitate the homeless and destitute persons and",
      "b": "2 only provide them with suitable sources of livelihood",
      "c": "Bth 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 34,
    "text": "With reference to the funds under Members of Parliament them with alternative sources of livelihood Local Area Development Scheme(MPLADS), which of (c) eradicate the practice of manual scavenging and rehabilitate the manual scavengers the following statements are correct?",
    "year": "2020-I",
    "options": {
      "a": "1,2 and 3",
      "b": "2,3 and 4",
      "c": "1, 2 and 4",
      "d": "1,3 and 4"
    },
    "answer": "d",
    "explanation": "• 15 percent of MPLADS funds are to be utilized for occupied in hazardous occupations or processes. areas inhabited by SC population and 7.5 per cent for • Families of such children mentioned in the above points. areas inhabited by ST population. So, #2 is correct. b Gurupadaswamy Committee dealt with the issues of child eliminated. labour. • The funds released under the Scheme are non-"
  }
]