[
  {
    "number": 1,
    "text": "The word ‘Hindu’ as reference to the people of Hind (India) 10. According to ancient Indian cosmogonic ideas the was first used by:",
    "year": "1995",
    "options": {
      "a": "the Greeks",
      "b": "the Romans",
      "c": "the Chinese",
      "d": "the Arabs"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Who among the following was a Brahmavadini who (b) Krita, Dvapara, Treta and Kali composed some hymns of the Vedas?",
    "year": "1995",
    "options": {
      "a": "Lopamudra",
      "b": "Gargi",
      "c": "Krita, Treta, Dvapara and Kali",
      "d": "Treta, Dvapara, Kali and Krita"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 5,
    "text": "248 A.D. (a) Sindhu (b) Sutudri Codes: (c) Sarasvati (d) Ganga (a) A – 2; B – 4; C – 5; D – 1 13. Which one of the following is not a part of early Jains (b) A – 1; B – 3; C – 2; D – 4 literature?",
    "year": "1996",
    "options": {
      "a": "Therigatha",
      "b": "Acarangasutra",
      "c": "A – 4; B – 5; C – 2; D – 3",
      "d": "A – 4; B – 3; C – 2; D – 1"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 14,
    "text": "Which of the following were common to both Buddhism (a) Sanskrit (b) Prakrit and Jainism?",
    "year": "1996",
    "options": {
      "c": "Pali",
      "d": "Sauraseni"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Denial of efficacy of rituals (a) Chakravarti (b) Dharmadeva 4. Non-injury to animal life (c) Dharmakirti (d) Priyadarsi Select the answer using the codes given below: 6. The term 'Yavanapriya' mentioned in ancient Sanskrit texts Codes: denoted:",
    "year": "1995",
    "options": {
      "a": "1, 2, 3 and 4",
      "b": "2, 3 and 4",
      "c": "1, 3, and 4",
      "d": "1 and 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 15,
    "text": "In the context of ancient Indian society which one of the (c) damsels sent to the Greek court for dance following terms does not belong to the category of the other performance three?",
    "year": "1996",
    "options": {
      "a": "Kula",
      "b": "Vamsa",
      "d": "pepper"
    },
    "answer": "c",
    "explanation": "Kosa was used for treasury and the rest of the three"
  },
  {
    "number": 7,
    "text": "The concept of Anuvrata was advocated by:",
    "year": "1995",
    "options": {
      "a": "Mahayana Buddhism",
      "c": "Kosa",
      "d": "Gotra"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 16,
    "text": "Who among the following is known for his work on medicine (b) Hinayana Buddhism during the Gupta period?",
    "year": "1996",
    "options": {
      "a": "Saumilla",
      "b": "Sudraka",
      "c": "Jainism",
      "d": "The Lokayata school"
    },
    "answer": "d",
    "explanation": "Susrutha Samhita was written by Susrutha. He was"
  },
  {
    "number": 8,
    "text": "According to Mimamsa system of philosophy, liberation is 17. Which one of the following sculptures was invariably used possible by means by:",
    "year": "1995",
    "options": {
      "a": "jnana",
      "b": "bhakti",
      "c": "yoga",
      "d": "karma"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 9,
    "text": "Bronze icons of Nataraja cast during the Chola period (c) Bharhut sculptures invariably show the deity with:",
    "year": "1995",
    "options": {
      "a": "eight hands",
      "b": "six hands",
      "c": "four hands",
      "d": "Gandhara sculptures"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 18,
    "text": "Match List-I with List-II and select the correct answer: The places marked A, B, C and D respectively are:",
    "year": "1996",
    "options": {
      "a": "Matsya, Cedi, Kosala, Anga List-I List-II",
      "b": "Surasena, Avanti, Vatsa, Magadha A. Vishakhadatta"
    },
    "answer": "c",
    "explanation": "Vishakhadatta wrote a drama named “Mudra It was the Indo Greeks who ruled a large part of North- Rakshasa”. Western India around 200 BC (2218 years ago) that first"
  },
  {
    "number": 1,
    "text": "Medicine (c) Matsya, Avanti, Vatsa, Anga B. Varahamihira 2. Drama (d) Surasena, Cedi, Kosala, Magadha C. Charaka 3. Astronomy 27. In the Mahayana Buddhism, the Bodhisatva Avalokitesvara D. Brahmagupta 4. Mathematics was also known as:",
    "year": "1997",
    "options": {
      "a": "Vajrapani",
      "b": "Manjusri",
      "c": "Padmapani",
      "d": "Maitreya"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 28,
    "text": "The silver coins issued by the Guptas were called: (c) A – 2; B – 3; C – 1; D – 4",
    "year": "1997",
    "options": {
      "a": "Rupaka",
      "b": "Karshapana",
      "d": "A – 3; B – 4; C – 1; D – 2"
    },
    "answer": "a",
    "explanation": "Mapping Question (cid:127) Statement 2- Incorrect because Amarsimha 1. Bhilsa- Madhya Pradesh- Correct- Known as belonged to the Court of Chandra Gupta- II (he was one Vidisha, main centre of the Sunga dynasty &Udaigiri of the navratna). Thus, by elimination we are left with caves in Madhya Pradesh (not to be confused with correct answer C. Udaigiri-Odisha) (cid:127) Statement 3- Correct because Kalidasa belonged to 2. Girinagar- Gujarat- Correct the Court of Chandra Gupta- II ( he was one of th"
  },
  {
    "number": 19,
    "text": "Which one of the following texts of ancient India allows divorce to a wife deserted by her husband?",
    "year": "1996",
    "options": {
      "a": "Kamasutra",
      "b": "Manava Dharma Shastra",
      "c": "Dinara",
      "d": "Pana"
    },
    "answer": "d",
    "explanation": "Arthashastra was written by Kautilya. In this book introduced coins made of Pure Gold in India before Kushans. 'Moksha' has been used for divorce. Therefore, according to the question the correct"
  },
  {
    "number": 1,
    "text": "Prabandha Chintamani List-I List-II B. Vishakhadatta 2. Mrichchha-Katikam A. Gupta 1. Badami C. Sudraka 3. Brihat-Samhita B. Chandella 2. Panamalai D. Bilhana 4. Devi-Chandraguptam C. Chalukya 3. Khajuraho 5. Vikramankadeva-Charita D. Pallava 4. Deogarh Codes: Codes: (a) A – 3; B – 4; C – 5; D – 2 (a) A – 4; B – 3; C – 1; D – 2 (b) A – 3; B – 4; C – 2; D – 5 (b) A – 4; B – 2; C – 3; D – 1 (c) A – ",
    "year": "1997",
    "options": {
      "a": "These are highly polished",
      "b": "These are monolithic",
      "c": "The shaft of pillars is tapering in shape",
      "d": "These are parts of architectural structures"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 465,
    "text": "If the same were to be dated in Vikrama Samvat, (a) Brahmi (b) Nandnagari the year would be:",
    "year": "1997",
    "options": {
      "c": "Sharada",
      "d": "Kharosthi"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 23,
    "text": "The famous dialogue between Nachiketa and Yama is (a) 601 (b) 300 mentioned in the:",
    "year": "1997",
    "options": {
      "a": "Chhandogyopanishad",
      "b": "Mundakopanishad",
      "c": "330",
      "d": "407"
    },
    "answer": "c",
    "explanation": "Kathopanishad is the conversation between Nachiketa"
  },
  {
    "number": 24,
    "text": "Milindapanho is in the form of a dialogue between the king (a) Buddhism was in the ascendant at that time Menander and Buddhist monk:",
    "year": "1997",
    "options": {
      "a": "Nagasena",
      "b": "they had renounced the policy of war and violence",
      "c": "caste-ridden Hinduism did not attract them",
      "d": "Kumarilabhatta"
    },
    "answer": "a",
    "explanation": "Milindapanho wasn’t written by one person. It is the fold Path is often represented by means of the Dharma wheel collected dialogue between the Indo-Greek king Milinda (or (Dharmachakra), whose eight spokes represent the eight Meander) and the Buddhist sage Nagasena. elements of the path. Eight fold path includes right"
  },
  {
    "number": 25,
    "text": "Which one of the following edicts mentions the personal 33. The Ashoka major rock edicts which tell us about the name of Ashoka?",
    "year": "1997",
    "options": {
      "a": "Kalsi",
      "b": "Rummindei",
      "c": "Special Kalinga Edict",
      "d": "Maski"
    },
    "answer": "d",
    "explanation": "Maski, Gurjara, Nettur and Udegolam inscriptions understanding, right speech, right livelihood; right mention the personal name of Ashoka. mindfulness, right thought, right action, right effort and"
  },
  {
    "number": 36,
    "text": "Assertion (A): According to Ashoka's edicts social harmony (c) 1, 3, 2, 4 (d) 1, 3, 4, 2 among the people was more important than religious 43. Which one of the following was initially the most powerful devotion. city state of India in the 6th century B.C. ?",
    "year": "1999",
    "options": {
      "a": "Gandhar",
      "b": "Kamboj of religion.",
      "c": "Kashi",
      "d": "Magadh"
    },
    "answer": "a",
    "explanation": "Ashoka’s edicts put stress on social harmony among"
  },
  {
    "number": 44,
    "text": "The Indo-Laws Kingdom set up in north Afghanistan in the (b) Both A and R are true but R is not a correct explanation of A beginning of the second century B.C. was:",
    "year": "1999",
    "options": {
      "a": "Bactria",
      "b": "Scythia",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "a",
    "explanation": "Bactria was the ancient civilizations of Iranian peoples."
  },
  {
    "number": 1,
    "text": "Lothal : Ancient dockyard (a) an ethnic group (b) a nomadic people 2. Sarnath : First Sermon of Buddha (c) a speech group (d) a superior race 3. Rajgir : Lion capital of Ashoka 46. Which one of the following ports handled the North Indian 4. Nalanda : Great seat of Buddhist learning trade during the Gupta period?",
    "year": "1999",
    "options": {
      "a": "Tamralipti",
      "b": "Broach Codes:",
      "c": "Kalyan",
      "d": "Cambray"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 47,
    "text": "Assertion (A): The Aham and Puram poems of the Padinen (c) 1, 2 and 4 (d) 1 and 2 Kilukanakku group formed a continuation of the Sangam 38. Which one of the following ancient Indian records is the composition. earliest royal order to preserve food-grains to be utilised Reason (R): They were included under the post-Sangam during the crises in the country?",
    "year": "1998",
    "options": {
      "a": "Sohgaura Copper-plate",
      "b": "Rummindei Pillar-edict of Ashoka of A",
      "c": "Prayaga-prasasti",
      "d": "Mehrauli Pillar inscription of Chandra"
    },
    "answer": "a",
    "explanation": "The didactic works of Sangam period are called conquests. In the Battle of Venni he defeated the mighty Kilukanakku (18 minor groups) consisting of Tirukurral and confederacy consisting of the Cheras, Pandyas and eleven Naladiyar. The Aham and Puram poems of the Kilukanakku minor chieftains. group were composed in post-Sangam period. That’s why The Chola emperor launched a successful naval expedition R explains A. against the sailendra kingdom."
  },
  {
    "number": 39,
    "text": "The concept of Eight fold path forms the theme of:",
    "year": "1998",
    "options": {
      "a": "Dipavamsa",
      "d": "A is false but R is true"
    },
    "answer": "d",
    "explanation": "The Noble Eight fold Path, is one of the principal and Yamraj (God of death). Nachiketa was a seeker, and teachings of the Buddha, who described it as the way leading Yamraj was a Guru (knower of secrets). to the cessation of suffering (Dukkha) and attainment of self-awakening. In Buddhist symbolism, the Noble Eight"
  },
  {
    "number": 40,
    "text": "The given map relates to :",
    "year": "1998",
    "options": {
      "a": "Both A and R are true but R is the correct explanation of A",
      "b": "Both A and R are true but R is not a correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "c",
    "explanation": "The given map is related to the reign of Ashoka towards of the most important ones and its core area comprises the end of his rule. Ashoka (304–232 BC), popularly known as present-day Ujjain district of Madhya Pradesh. Vatsa with Ashoka the Great, was an Indian emperor of the Maurya its capital at Kausambi was another powerful Mahajanapada, Dynasty who ruled over the Indian subcontinent from 269 annexed by Magadha. Anga Mahajanapada was in Gangetic BC to 232 BC. His empire stretched from present"
  },
  {
    "number": 49,
    "text": "Assertion (A): The origin of feudal system in ancient India can be traced to military campaigns. Reason (R): There was considerable expansion of the feudal system during the Gupta period.",
    "year": "2000",
    "options": {
      "a": "Both A and R are true but R is the correct explanation of A",
      "b": "Both A and R are true but R is not a correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "b",
    "explanation": "Both the statements are true but do not explain each other. named Charudatta, and his love for Vasantasena, a rich"
  },
  {
    "number": 50,
    "text": "Assertion (A): Ashoka annexed Kalinga to the Mauryan (b) Samudragupta after the close of his South Indian Empire. campaign. Reason (R): Kalinga controlled the land and sea routes to (c) Ashoka towards close of his reign. South India.",
    "year": "2000",
    "options": {
      "a": "Both A and R are true but R is the correct explanation of A",
      "d": "Empire of Thaneswar on the eve of Harsha's accession."
    },
    "answer": "a",
    "explanation": "Ashoka annexed Kalinga to the Mauryan empire in courtesan. 261 BC. Though Ashoka abandoned the policy of physical"
  },
  {
    "number": 51,
    "text": "The practice of military governorship was first introduced (b) India's largest Buddhist monastery is in Arunachal in India by the:",
    "year": "2000",
    "options": {
      "a": "Greeks",
      "b": "Shakas",
      "c": "Khajuraho temples were built under Chandela kings.",
      "d": "Mughals"
    },
    "answer": "a",
    "explanation": "Greeks first introduced military governorship in India. Pushyamitra Sunga in 185 BC. The last ruler of Kanva They appointed their Governors called strategos. dynasty, Susharma was deposed by the Andhras and"
  },
  {
    "number": 52,
    "text": "Which one of the following dynasties was ruling over North 61. In ancient Indian Buddhist monasteries, a ceremony called India at the time of Alexander's invasion?",
    "year": "2000",
    "options": {
      "a": "Nanda",
      "b": "Maurya",
      "c": "Sunga",
      "d": "Kanva speakers one on Dhamma and the other on Vinaya"
    },
    "answer": "a",
    "explanation": "Alexander invaded India in 326 BC. Nandas were ruling Satavahana dynasty came into being. over India at that time. The chronological order of these 4"
  },
  {
    "number": 53,
    "text": "Hoysala monuments are found in:",
    "year": "2001",
    "options": {
      "a": "Hampi and Hosper during their stay in the monasteries during the rainy",
      "b": "confession by monks of their offences committed",
      "c": "Mysore and Bangalore",
      "d": "Sringeri and Dharwar Sangha in which the head is shaved and when yellow"
    },
    "answer": "b",
    "explanation": "The capital of the Hoysalas was initially located at presidentship of Vasumitra and Ashvaghosh. Fa-Hien visited Belur but was later moved to Halebid. India during the reign of Chandra Gupta-II and not during"
  },
  {
    "number": 54,
    "text": "Which one of the following pairs is correctly matched? robes are offered",
    "year": "2001",
    "options": {
      "a": "The Harappan civilization – Painted Greyware full-moon day of Ashadha when they take up a fixed",
      "b": "The Kushans – Gandhra School of Art abode for the next four months of the rainy season",
      "c": "The Mughals – Ajanta Paintings",
      "d": "gathering of Buddhist monks on the next day to the"
    },
    "answer": "b",
    "explanation": "Painted Greyware belonged to later Vedic period (1000– Kanishka's reign. Statement 2 is incorrect as Harsha was 600BC). Ajanta paintings belong to the Gupta period. Pahari not antagonistic to Buddhism when Hiuen -Tsang met him. School came into existence during the Mughal period."
  },
  {
    "number": 55,
    "text": "Assertion (A): Harshavardhana convened the Prayag (a) a conflict between Gods and Demons of ancient Hindu Assembly. lore Reason (R): He wanted to popularize only the Mahayana (b) a romantic story of an Aryan prince and a tribal woman form of Buddhism.",
    "year": "2001",
    "options": {
      "a": "Both A and R are true but R is the correct explanation",
      "c": "the story of the power struggle between two Aryan .",
      "d": "the court intrigues at the time of Chandragupta of A"
    },
    "answer": "b",
    "explanation": "To popularize the Mahayana form of Buddhism. Bhadrabahu (not Sthalabahu). The Jainas who remained Harshavardhana convened an assembly at Kannauj. The under the leadership of Bhadrabahu were called Digambaras Prayag assembly was convened to popularize himself. (not Shvetambaras) after the first council held at Pataliputra"
  },
  {
    "number": 63,
    "text": "Emperor Harsha's southward march was stopped on the (b) Both A and R are true but R is not a correct explanation Narmada river by:",
    "year": "2003",
    "options": {
      "a": "Pulakesin-I",
      "b": "Pulakesin-II",
      "c": "A is true but R is false",
      "d": "Vikramaditya-II"
    },
    "answer": "b",
    "explanation": "Emperor Harsha's southward march was stopped on city on the Bay of Bengal corresponding with Tamluk in the Narmada river by Pulakesin II, the Chalukya king of modern-day India. Tamralipta may have been one of the Vatapi in northern Mysore. most important urban centres of trade and commerce of early"
  },
  {
    "number": 1,
    "text": "The Cholas defeated Pandya and Chera rulers and (a) Aditya-I (b) Rajaraja-I established their domination over peninsular India in (c) Rajendra (d) Vijayalaya the early medieval times. 57. Who among the following presided over the Buddhist 2. The Cholas sent an expedition against Sailendra empire Council held during the reign of Kanishka at of South-East Asia and conquered some of the areas. Kashmi",
    "year": "2001",
    "options": {
      "a": "Parsva",
      "b": "Nagarjuna",
      "c": "Sudraka",
      "d": "Vasumitra"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 58,
    "text": "Which one of the following animals was not represented 65. Mrichchhakatika' an ancient Indian book written by seals and terracotta art of the Harappan culture?",
    "year": "2001",
    "options": {
      "a": "Cow",
      "b": "Elephant",
      "c": "Rhinoceros",
      "d": "Tiger a courtesan"
    },
    "answer": "a",
    "explanation": "Cow, camel, horse and lion were not depicted on seals. contemporary of the Buddha. He strengthened his position by Unicorn (bull) was the animal most commonly represented marriage alliances. His first wife was the sister of Prasenjit (son on the seals. of king of Koshala) who was also contemporary of the Buddha."
  },
  {
    "number": 1,
    "text": "The last Mauryan ruler, Brihadratha was assassinated represents the last Tirthankara of Jains. by his commander-in-chief, Pushyamitra Sunga. 5337_DBE Ancient History A 5 2. The last Sunga king, Devabhuti was assassinated by 76. The Allahabad Pillar inscription is associated with which his Brahmana Minister Vasudeva Kanva who usurped one of the following?",
    "year": "2006",
    "options": {
      "a": "Mahapadma Nanda",
      "b": "Chandragupta Maurya"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "The last ruler of the Kanva dynasty was deposed by (c) Ashoka (d) Samudragupta the Andhras. 77. What does Baudhayan theorem (Baudhayan Sulva Sutras) Which of these statements is/are correct? relate to?",
    "year": "2008",
    "options": {
      "a": "1 and 2",
      "b": "Only 2",
      "c": "Only 3",
      "d": "1, 2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 68,
    "text": "Consider the following statements: (c) Logarithmic calculations 1. The Chinese pilgrim Fa-Hien attended the fourth Great (d) Normal distribution curve Buddhist Council held by Kanishka. 78. Anekantavada is a core theory and philosophy of which 2. The Chinese pilgrim Hiuen-Tsang met Harsha and one of the following?",
    "year": "2009",
    "options": {
      "a": "Buddhism",
      "b": "Jainism Which of the statements given above is/are correct?",
      "c": "Sikkhism",
      "d": "Vaishnavism"
    },
    "answer": "d",
    "explanation": "Statement 1 is incorrect as fourth Buddhist Council dynasties was: Nanda, Maurya, Sunga and Kanvas. was held in Kashmir during the reign of Kanishka under the"
  },
  {
    "number": 79,
    "text": "There are only two known examples of cave paintings of (a) 1 only (b) 2 only the Gupta period in ancient India. One of these is paintings (c) Both 1 and 2 (d) Neither 1 nor 2 of Ajanta caves. Where is the other surviving example of 69. With reference to ancient Jainism, which one of the following Gupta paintings?",
    "year": "2010",
    "options": {
      "a": "Bagh caves",
      "b": "Ellora caves",
      "c": "Lomas Rishi cave",
      "d": "Nasik caves of Sthalabahu."
    },
    "answer": "a",
    "explanation": "A copper plate inscription of Maharaja Subandhu, He is free from the thirst of becoming and the illusion of recording his donation for the repair of the vihara was found self. Buddism explain Nivrana as a state of bliss or peace. at the site of Cave 2. Though, the date of the Bagh inscription"
  },
  {
    "number": 80,
    "text": "India maintained its early cultural contacts and trade links (b) The Jainas who remained under the leadership of with Southeast Asia across the Bay of Bengal. For this pre- Bhadrabahu were called Shvetambaras after the council eminence of early maritime history of Bay of Bengal, which held at Pataliputra. of the following could be the most convincing explanation/ (c) Jainism enjoyed the patronage ",
    "year": "2004",
    "options": {
      "a": "Rigveda",
      "b": "Yajurveda sea voyages",
      "c": "Monsoon winds across the Bay of Bengal facilitated",
      "d": "Samaveda"
    },
    "answer": "d",
    "explanation": "Option (d) is the correct answer. Indus valley people were peace loving. They were never engaged in any war. However speculations have been"
  },
  {
    "number": 2,
    "text": "Amarakantak (a) Kanganahalli (b) Sanchi 3. Omkareshwar (c) Shahbazgarhi (d) Sohgaura Select the correct answer using the code given below: 118. Consider the following :",
    "year": "2019-I",
    "options": {
      "a": "1 only",
      "b": "2 and 3 only"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Rigvedic Aryans had domesticated the horse whereas a sort of tax paid by the people. there is no evidence of Indus Valley people having (b) It was totally absent in the Madhya Pradesh and been aware of this animal. Kathiawar regions of the Gupta Empire. Select the correct answer using the code given below: (c) The forced labourer as entitled to weekly wages. (a) 1 only (b) 2 and 3 only (d) The eld",
    "year": "2017-I",
    "options": {
      "a": "Kakinada",
      "b": "Chandela",
      "c": "Rashtrakuta",
      "d": "Vijayanagara"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 121,
    "text": "With reference to the cultural history of India, which one (d) Nelluru of the following is the correct description of the term 112. With reference to the religious practices in India, the ‘paramitas’?",
    "year": "2020-I",
    "options": {
      "a": "The earliest Dharmashastra texts written in",
      "b": "Philosophical schools that did not accept the",
      "c": "Vaishnavism",
      "d": "Shaivism"
    },
    "answer": "c",
    "explanation": "(cid:127) Nivartana And Hhumi from central India, and to (cid:127) Bodhisattava are part of the Mahayana/Vajrayana (cid:127) Nivartana And Padavarta from western India Tradition. They are mentioned in the Mahayana literature (cid:127) Very tough to attend, not given in standard books called as the Vaipulya Sutra- written in Sanskrit like NCERT or Tamilanadu (cid:127) Inside the Vaipulya Sutra- Prajna Paramita are"
  },
  {
    "number": 3,
    "text": "Thang-Ta dance: Sikkim Which of the pairs given above is/are correct ? 1. Sthaviravadins belong to Mahayana Buddhism. (a) 1 only (b) 1 and 2 2. Lokottaravadin sect was an offshoot of (c) 3 only (d) 2 and 3 Mahasanghika sect of Buddhism. 116. Which one of the following is not a Harappan Site? 3. The deification of Buddha by Mahasanghikas",
    "year": "2019-I",
    "options": {
      "a": "Chanhudaro",
      "b": "Kot Diji Which of the statements given above are correct?",
      "c": "Sohagaura",
      "d": "Desalpur"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 124,
    "text": "Consider the following events in the history of India: (a) Ashoka (b) Samudragupta",
    "year": "2020-I",
    "options": {
      "c": "Harshavardhana",
      "d": "Krishna Deva Raya"
    },
    "answer": "c",
    "explanation": "Upinder Singh, page 508: (cid:127) Mahendra Varman- I (590- 630 CE) Forced labour (Vishti) became more common than before (cid:127) Gopala (750 CE) in this Gupta period. The fact that it is mentioned along (cid:127) King Bhoja- Pratihara( 836-885 CE) with the taxes in the land grant inscriptions suggest that (cid:127) Prantaka-1 Chola ( 907-953 CE) Vishti was considered as source of income for the state,"
  },
  {
    "number": 3,
    "text": "Establishment of Chola Parantaka – I 1. Bhilsa Madhya Pradesh 4. Pala dynasty founded by Gopala 2. Dwarasamudra Maharashtra What is the correct chronological order of the above 3. Girinagar Gujarat events, starting from the earliest time ? 4. Sthaneshwara Uttar Pradesh (a) 2-1-4-3 (b) 3-1-4-2 Which of the pairs given above are correctly matched? (c) 2-4-1-3 (d) 3-4-1-2 (a) 1 and 3 only (b) 1 and 4",
    "year": "2020-I",
    "options": {
      "a": "An advisory issued by the king to his subordinates known as",
      "b": "A diary to be maintained for daily accounts",
      "c": "A bill of exchange",
      "d": "An order from the feudal lord to his subordinates"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Parivrajaka – Renunciant and Wanderer (c) classification of urban land 2. Shramana – Priest with a high status (d) religious rituals 3. Upasaka – Lay follower of buddhism 127. Who among the following rulers advised his subjects Which of the pairs given above are correctly matched ? (a) 1 and 2 only (b) 1 and 3 only through this inscription?: “Whosoever praises his (c) 2 and 3 only (d) 1, 2 and 3 r",
    "year": "2020-I",
    "options": {
      "a": "Other Brahmavadini are Vishwawara, Sikta, Nivavari, \"virtue\", \"morality\" or \"duty\". Dharma is the essentially Ghosha and Maitreyi. ritualism, and there is a great significance of the Karma or 3.",
      "b": "In Sanskrit plays of Gupta period women and Sudras 9.",
      "c": "Four handed Bronze icon of Nataraja is the finest speak prakrit and Elite class speak Sanskrit. example of Chola sculpture. 5.",
      "d": "The name of India is a corruption of the word Sindhu. 8."
    },
    "answer": null,
    "explanation": ""
  }
]