[
  {
    "number": 1,
    "text": "The Mughal school of painting formed the spinal column of (c) a cess levied by the Mughal rulers different schools of Indian miniature art. Which one of the (d) a manual of code of conduct for the Ulemas following painting styles was not affected by Mughal 8. The sufi saint who maintained that devotional music was painting?",
    "year": "1995",
    "options": {
      "a": "Pahari",
      "b": "Rajasthani",
      "c": "Kangra",
      "d": "Kalighata"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Who among the following were famous jurists of medieval (c) Saiyid Muhammad Gesudaraz India?",
    "year": "1995",
    "options": {
      "a": "Vijnanesvara",
      "b": "Hemadri",
      "d": "Shah Alam Bukhari"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 9,
    "text": "Mughal painting reached its zenith under:",
    "year": "1996",
    "options": {
      "a": "Humayun",
      "b": "Akbar Select the correct answer using the codes given below:",
      "c": "Rajasekhara",
      "d": "Jimutavahana"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Which one of the following monuments has a dome which (b) facilitating revenue collection is said to be one of the largest in the world?",
    "year": "1995",
    "options": {
      "a": "Tomb of Sher Shah, Sasaram",
      "b": "Jama Masjid, Delhi",
      "c": "ensuring religious harmony",
      "d": "effecting clean administration"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 11,
    "text": "Which of the following pairs is correctly matched? (c) Tomb of Ghiyas-ud-din Tughlaq, Delhi (a) Guru Amar Das–Miri and Piri",
    "year": "1996",
    "options": {
      "b": "Guru Arjun Dev–Adi Granth",
      "d": "Gol Gumbaz, Bijapur"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 4,
    "text": "Ashtapradhan was a council of ministers:",
    "year": "1995",
    "options": {
      "a": "in the Gupta administration",
      "b": "in the Chola administration",
      "c": "Guru Ram Das–Dal Khalsa",
      "d": "Guru Gobind Singh– Manji"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 12,
    "text": "Prem Vatika, poems on the life of Krishna, were composed by : (c) in the Vijayanagar administration (a) Bihari (b) Surdas",
    "year": "1996",
    "options": {
      "c": "Raskhan",
      "d": "in the Maratha administration"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 13,
    "text": "After consolidating his power, Balban assumed the grand title of :",
    "year": "1997",
    "options": {
      "a": "Tute-Hind",
      "b": "Kaisr-I-Hind",
      "c": "Zil-I-Ilahi",
      "d": "Din-I-Ilahi"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 14,
    "text": "Head of the military department under the recognised central machinery of administration during Akbar's reign was: (a) Diwan (b) Mir Bakshi",
    "year": "1997",
    "options": {
      "c": "Mir Saman",
      "d": "Bakshi"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 15,
    "text": "Assertion (A): The sponsor and the most prominent figure of the Chisti order of Sufis in India is Khwaja Moinuddin Chisti. Reason (R): The Chisti order takes its name from a village Chisti in Ajmer. The route indicated in the map was followed, during the In the context of the above two statements, which one of course of his military exploits, by: the following is correct?",
    "year": "1997",
    "options": {
      "a": "Chandragupta II",
      "b": "Harshavardhana",
      "c": "Rajendra Chola",
      "d": "Malik Kafur of A"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 6,
    "text": "The term 'Apabhramsa' was used in medieval Sanskrit texts (b) Both A and R are true but R is not the correct explanation to denote:",
    "year": "1996",
    "options": {
      "a": "outcastes among the Rajputs",
      "b": "deviations from Vedic rituals",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 16,
    "text": "Which one of the following pairs of composers in different (d) non-Sanskrit verse metres languages and their works on the Mahabharata theme is 7. Nastaliq was:",
    "year": "1996",
    "options": {
      "a": "a persian script used in medieval India",
      "b": "Kasirama–Oriya",
      "c": "Tikkana–Marathi",
      "d": "Pampa–Kannada A 16 Topicwise Solved Papers"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 5,
    "text": "Accession of Akbar (a) Peshwa (b) Sachiv Codes: (c) Pandit Rao (d) Sumant (a) A – 3; B – 4; C – 2; D – 1 19. The loss of Qandhar was a big blow to the Mughal empire (b) A – 5; B – 4; C – 3; D – 2 from the view point of :",
    "year": "1998",
    "options": {
      "a": "natural resources",
      "b": "buffer territory",
      "c": "A – 5; B – 2; C – 1; D – 4",
      "d": "A – 1; B – 5; C – 3; D – 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 27,
    "text": "In the given map, the shaded part represents Akbar's empire 20. Fawazil in the Sultanate period meant:",
    "year": "1998",
    "options": {
      "a": "extra payment to the nobles and 'B' marks the site of city. Which one of the following",
      "b": "revenue assigned in lieu of salary alternative gives all correct information?",
      "c": "excess amount paid to the exchequer by the Iqtadars",
      "d": "illegal exactions extracted from the peasants"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 21,
    "text": "Sultan of Delhi who is reputed to have built the biggest network of canals in India was:",
    "year": "1998",
    "options": {
      "a": "Iltutmish",
      "b": "Ghiyasuddin Tughlaq",
      "c": "Firoz Shah Tughlaq",
      "d": "Sikandar Lodi"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 22,
    "text": "Assertion (A): At first the Turkish administration in India was essentially military. Reason (R): The country was parcelled out as 'Iqtas' among leading military leaders.",
    "year": "1998",
    "options": {
      "a": "Akbar in 1557 :",
      "b": "Lahore",
      "c": "Akbar in 1605:",
      "d": "Akbar in 1605:"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 28,
    "text": "The first writer to use Urdu as the medium of poetic 23. Assertion (A): During the reign of Shahjahan, Dara Sikoh expression was:",
    "year": "1999",
    "options": {
      "a": "Amir Khusrau",
      "b": "Mirza Ghalib Qandahar.",
      "c": "Bahadur Shah Zafar"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 29,
    "text": "To which Lodi Sultan does the given map relate and what Middle-East was a marvellous success.",
    "year": "1998",
    "options": {
      "a": "Both A and R are true but R is the correct explanation of A",
      "b": "Both A and R are true but R is not a correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 38,
    "text": "Consider the following events:",
    "year": "2000",
    "options": {
      "a": "absence of minerals like iron",
      "b": "too many divisions in the social structure"
    },
    "answer": "a",
    "explanation": "Reign of Krishna Deva of Vijaynagara – (1509 – 30);"
  },
  {
    "number": 1,
    "text": "Reign of Krishna Deva of Vijaynagara (c) absence of vast areas of fertile land 2. Construction of Qutab Minar (d) scarcity of manpower 3. Arrival of Portuguese in India 32. 'The king was freed from his people and they from their 4. Death of Firoz Tughlaq king'. On whose death did Badauni comment thus?",
    "year": "1999",
    "options": {
      "a": "Balban",
      "b": "Ala-ud-din Khalji",
      "c": "Muhammad-bin-Tughlaq",
      "d": "4, 2, 3, 1"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Marathas 1. turret B. Jagir 2. Delhi Sultans 2. similarity with Buddhist pagodas C. Amaram 3. Mughals 3. Persian style Which of the above statements is/are correct? D. Mokasa 4. Vijayanagara (a) 1 alone (b) 1, 2 and 3 Codes: (c) 2 and 3 (d) 1 and 3 (a) A – 3; B – 2; C – 1; D – 4 34. Which one of the following pairs is not correctly matched?",
    "year": "1999",
    "options": {
      "a": "Jahangir : William Hawkins",
      "b": "A – 2; B – 3; C – 4; D – 1",
      "c": "A – 2; B – 3; C – 1; D – 4",
      "d": "A – 3; B – 2; C – 4; D – 1"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 40,
    "text": "Which one of the following Muslim rulers was hailed as the (d) Aurangzeb : Manucci 'Jagadguru' by his Muslim subject because of his belief in 35. Match List-I with List-II and select the correct answer using secularism?",
    "year": "2000",
    "options": {
      "a": "Hussain Shah",
      "b": "Zain-ul-Abidin List-I List-II",
      "c": "Ibrahim Adil Shah",
      "d": "Mahmud II A. Land allotted to"
    },
    "answer": "c",
    "explanation": "Ibrahim Adil Shah II (1556 – 1627), of the Adil Shahi"
  },
  {
    "number": 1,
    "text": "Jagirdari System 41. In which one of the following cities is the Lingaraja Temple big feudal landlords B. Land allotted to 2. Ryotwari System located?",
    "year": "2001",
    "options": {
      "a": "Bhubaneswar",
      "b": "Bijapur rent collectors",
      "c": "Kolkata",
      "d": "Shravananbelagola C. Land allotted to each"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Barber D. Revenue settlements 4. Zamindari System made at village level B. Kabir 2. Weaver Codes: C. Ravidas 3. Tailor (a) A – 1; B – 3; C – 2; D – 4 D. Sena 4. Cobbler (b) A – 1; B – 4; C – 2; D – 3 Codes: (c) A – 3; B – 4; C – 1; D – 2 (a) A – 2; B – 3; C – 1; D – 4 (d) A – 2; B – 1; C – 3; D – 4 (b) A – 3; B – 2; C – 4; D – 1 36. Who among the following streamlined the Maratha administration af",
    "year": "2000",
    "options": {
      "a": "Raja Ram",
      "b": "Balaji Vishwanath",
      "c": "A – 3; B – 2; C – 1; D – 4",
      "d": "A – 2; B – 3; C – 4; D – 1"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 43,
    "text": "Mongols under Chengiz Khan invaded India during the 37. The given map refers to the kingdom of :",
    "year": "2000",
    "options": {
      "a": "Balban",
      "b": "Firoz Tughlaq",
      "c": "Iltutmish",
      "d": "Muhammad Bin Tughlaq"
    },
    "answer": "c",
    "explanation": "Mongols under Chengiz Khan (died in 1227) invaded became very powerful in Delhi and not due to foreign India during the reign of Iltutmish (1211-36) but did not enter invasions. deep in India as Iltutmish refused to give shelter to the Persian"
  },
  {
    "number": 44,
    "text": "Which among the following ports was called Babul Makka (Gate of Makka) during the Mughal period?",
    "year": "2001",
    "options": {
      "a": "Calicut",
      "b": "Broach",
      "c": "Cambay",
      "d": "Surat"
    },
    "answer": "d",
    "explanation": "Surat was called Gate of Makka because the pilgrimage"
  },
  {
    "number": 45,
    "text": "Which of the following pairs is correctly matched?",
    "year": "2001",
    "options": {
      "a": "Dewan-i-Bandagani – Tughlaq",
      "b": "Dewan-i-Mustakhraj – Balban",
      "c": "Dewan-i-Kohi – Alauddin Khilji",
      "d": "Dewan-i-Arz – Muhammad Tughlaq"
    },
    "answer": "a",
    "explanation": "Dewan-i-Bandagani (Department of Slaves) was"
  },
  {
    "number": 52,
    "text": "Historian Barani refused to consider the state in India under explanation of A Delhi Sultans as truly Islamic because:",
    "year": "2002",
    "options": {
      "a": "majority of the population did not follow Islam explanation of A",
      "b": "Both A and R are individually true but R is not a correct",
      "c": "A is true but R is false",
      "d": "A is false but R is true own regulations"
    },
    "answer": "c",
    "explanation": "Zia-ud-din-Barani was a contemporary of Muhammad Khandesh sultanate and Burhanpur became the capital of Tughlaq and Firoz Tughlaq. He enjoyed the patronage of Khandesh Subah of the Mughal empire. The shaded portion both the sultans. He composed Tarikh-i-Firoz Shahi and in given map indicates Khandesh during Akbar. Fatwa-i-Jahandari."
  },
  {
    "number": 1,
    "text": "Sheikh Ahmad Sarhandi was a contemporary of Ibrahim Lodi 47. 2. Sheikh Nasiruddin Chirag-I-Dehlavi was a disciple of Sheikh Nizamuddin Auliya 3. Aurangzeb was a contemporary of Sheikh Salim Chisti 4. Qadiri order of Sufis was first introduced in India by Sheikh Niamutullah and Makhdum Muhammad Jilani Which of these statements are correct? (a) 1 and 2 (b) 1 and 3 Bay of Bengal (c) 2 and 3 (d) 2 and",
    "year": "2000",
    "options": {
      "a": "Alauddin Khalji",
      "b": "Mohammad Tughlaq",
      "c": "Shahjahan",
      "d": "Aurangzeb explanation of A"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 48,
    "text": "Who among the following was the first Bhakti saint to use (b) Both A and R are individually true but R is not the correct Hindi for the propagation of his message?",
    "year": "2002",
    "options": {
      "a": "Dadu",
      "b": "Kabir",
      "c": "A is true but R is false",
      "d": "Tulsidas"
    },
    "answer": "c",
    "explanation": "Ramananda (1360-1470) was the first Bhakti saint to use dynasty was founded by Narasimha Saluva by defeating Hindi for the propagation of his message. Dev Rayua-II of Sangama dynasty. Taluva dynasty was"
  },
  {
    "number": 49,
    "text": "With reference to medieval Indian rulers, which one of the 54. Assertion (A): Emperor Akbar marched towards following statement is correct?",
    "year": "2002",
    "options": {
      "b": "Balban introduced the branding of horses in his military. country of Ferghana in Central Asia.",
      "c": "Muhammad Bin Tughlaq was succeeded by his uncle"
    },
    "answer": "d",
    "explanation": "Firoz Tughlaq set up a separate department of slaves founded by Vira Narasimha and was succeeded by KD Raya known as 'Diwan-i-Bandagan'. Mohd Bin Tughlaq was and Achyuta Raya. succeeded by his cousin (not uncle) Firoz Tughlaq."
  },
  {
    "number": 58,
    "text": "Alam Khan, one of those who invited Babur to invade India statements, one labelled as \"Assertion A\" and the other as \"Reason was:",
    "year": "2003",
    "options": {
      "a": "an uncle of Ibrahim Lodi and a pretender to the throne if \"Assertion A\" and \"Reason R\" are individually true and if so, of Delhi whether the \"Reason R\" is the correct explanation for the given",
      "b": "a cousin of Ibrahim Lodi who was ill-treated and expelled Assertion A\". Select your answers to these items using the codes from the country given below and mark your Answer Sheet accordingly.",
      "c": "the father of Dilawar Khan to whom cruel treatment was meted out by Ibrahim Lodi Codes:",
      "d": "a high official in Punjab province who was"
    },
    "answer": "a",
    "explanation": "Alam Khan along with Daulat Khan Lodi invited Babur constituted by Firoz Tughlaq; Dewan-i-Mustakhraj (Dept to India. In the first battle of Panipat in 1526, Ibrahim Lodi of Arrears) – Alauddin Khalji; Dewan-i-Kohi (Dept of was defeated by Babur. Agriculture) – Muhammad Bin Tughlaq; Dewan-i-Arz (Dept"
  },
  {
    "number": 3,
    "text": "Guru Arjun Dev gave to Sikhs their own script Guru (a) He was deposed by his Wazir Mukhi. (b) He died due to a slip while climbing down the steps Which of the statements given above is/are correct? (c) He was defeated by his nephew in a battle (a) 1 only (b) 2 and 3 (d) He died of sickness due to drinking (c) 1 and 3 (d) 1 and 2 61. Consider the following statements: 68. The initial design and con",
    "year": "2006",
    "options": {
      "a": "Sri Mariamman Temple Shah II",
      "b": "Angkor Vat Temple"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 69,
    "text": "When Raja Wodeyar founded the kingdom of Mysore, who (a) Only 1 (b) Only 2 was the ruler of the Vijayanagar Empire?",
    "year": "2006",
    "options": {
      "a": "Sadasiva",
      "b": "Tirumala",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "d",
    "explanation": "Indigenous chieftains from Karnataka rose to become every Thursday to debate on religious issues raised by Akbar. the founders of a dynasty after a series of internal bickerings"
  },
  {
    "number": 62,
    "text": "How did Sultan Qutb-ud-din Aibak die?",
    "year": "2003",
    "options": {
      "a": "He was treacherously stabbed to death by one of his ambitious nobles",
      "c": "Ranga II",
      "d": "Venkata II"
    },
    "answer": "d",
    "explanation": "Qutbud-din Aibak died after a fall from his horse while inherited a vast and rich empire; and at mid-century this was playing chaugan (polo) in 1210. He was succeeded by Aram perhaps the greatest empire in the world, exhibiting a degree Shah. Qutbud-din Aibak was the founder of first independent of centralized control rarely matched before. Shah Jahan Turkish kingdom in Northern India in 1206. expanded his empire in all directions: he annexed the Rajput"
  },
  {
    "number": 70,
    "text": "In the year 1613, where was the English East India Company (b) He was killed in a battle with Taj-u-din Yildiz, the ruler given permission to set up a factory (trading post)?",
    "year": "2006",
    "options": {
      "a": "Bangalore",
      "b": "Madras capture of Punjab",
      "c": "Masulipattam",
      "d": "Surat"
    },
    "answer": "d",
    "explanation": "In 1612 Sir Thomas Roe visited to Mughal Emperor used for military purpose in India and even artillery in its Jahangir to arrange for a commercial treaty that would give rudimentary form was known. The Babur's first real the company exclusive rights to reside and build factories expedition took place in India in 1519 when he captured in Surat and other areas. In return, the company offered to Bhera. The Delhi Sultanate's greatest contribution to Indian provide the Emperor with goods and rarities"
  },
  {
    "number": 71,
    "text": "Assertion (A): Muhammad bin Tughlaq issued a new gold Kalinjar in Bundelkhand and succumbed to them later coin which was called Dinar by Ibn Batutah. (d) He died after a fall from his horse while playing Chaugan Reason (R): Muhammad bin Tughlaq wanted to issue token 63. Which one of the following sequences indicates the correct currency in gold coins to promote trade with West Asian chronological ",
    "year": "2004",
    "options": {
      "a": "Shankaracharya–Ramanuja–Chaitanya",
      "b": "Ramanuja–Shankaracharya–Chaitanya",
      "c": "Ramanuja–Chaitanya–Shankaracharya of A",
      "d": "Shankaracharya–Chaitanya–Ramanuja"
    },
    "answer": "c",
    "explanation": "A is correct but R is wrong as he issued bronze coins culture and had established two well-known empires in as the token currency which was a great fiasco. history, namely the Timurid Empire (1370-1507) in Persia and"
  },
  {
    "number": 2,
    "text": "Vira Narasimha deposed the last Saluva ruler and seized (b) Sikandar Shah-Bahlol Khan Lodi-Ibrahim Lodi the throne for himself. (c) Bahlol Khan Lodi-Sikandar Shah-Ibrahim Lodi 3. Vira Narasimha was succeeded by his younger brother, (d) Bahlol Khan Lodi-Ibrahim Lodi-Sikandar Shah Krishnadeva Raya. 73. Bhakta Tukaram was a contemporary of which Mughal 4. Krishnadeva Raya was succeeded by his half br",
    "year": "2006",
    "options": {
      "a": "Babar",
      "b": "Akbar Which of the statements given above are correct?",
      "c": "Jahangir",
      "d": "Aurangzeb"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 74,
    "text": "In Indian history, who was Abdul Hamid Lahori?",
    "year": "2006",
    "options": {
      "a": "An important military commander during Akbar reign.",
      "c": "1 and 4",
      "d": "1, 2, 3 and 4"
    },
    "answer": "b",
    "explanation": "Abdul Hamid Lahori (d. 1654) was a traveller during the Krishna in the north to the extreme south of the peninsula, period of Shahjahan who later became a court historian of (Krishna-Tungabhadra doab). It was founded by Harihara Shahjahan. He wrote the book Padshah Nama also referred 1 and Bukka, in 1336. as Badshah nama, about the reign of Shahjahan."
  },
  {
    "number": 65,
    "text": "Who was the last ruler of the Tughlaq dynasty of the Delhi (b) An official historian of the reign of Shahjahan. Sultanate?",
    "year": "2004",
    "options": {
      "a": "Firoz Shah Tughlaq",
      "b": "Ghiyas-ud-din Tughlaq Shah II",
      "c": "An important noble and confidant of Aurangzeb.",
      "d": "A chronicler and poet during the reign of Muhammad"
    },
    "answer": "c",
    "explanation": "Ghiyasuddin Tughlaq founded Tughlaq dynasty in Alauddin Khalji introduced the branding system of horses 1320 AD (CE). Nasiruddin Mahmud was the last ruler of in his military. Tughlaq dynasty (1395-1412 AD). A 24 Topicwise Solved Papers"
  },
  {
    "number": 75,
    "text": "Where is the famous Vijaya Vittala temple having its 56 66. How did the dynasty of Nizam Shahis of Ahmadnagar come carved pillars emitting musical notes located? to an end?",
    "year": "2004",
    "options": {
      "a": "Belur",
      "b": "Bhadrachalam",
      "c": "Hampi",
      "d": "Srirangam Hussain Shah was given life imprisonment"
    },
    "answer": "c",
    "explanation": "Vijaya Vittala temple is located at Hampi, the capital of from one place to another and the goods they transported Vijayanagar kingdom during the reign of Krishnadev Raya. included salt, grains, firewood and cattle.Thus, Banjaras"
  },
  {
    "number": 76,
    "text": "During the time of which Mughal Emperor did the English (b) Mughal troops destroyed Daulatabad fort and killed East India Company establish its first factory in India? Nizam-ul Mulk of Ahmadnagar (a) Akbar (b) Jahangir",
    "year": "2008",
    "options": {
      "c": "Fateh Khan usurped the throne from Nizam-ul-Mulk",
      "d": "Aurangzeb"
    },
    "answer": "b",
    "explanation": "William Hawkins visited the court of Jahangir and were trader-nomads. received a farman which allowed East India Company to set Ref: Class 7 NCERT Page 94-95. up their first factory at Surat in 1613."
  },
  {
    "number": 77,
    "text": "Where is the famous Virupaksha temple located?",
    "year": "2009",
    "options": {
      "a": "Bhadrachalam",
      "b": "Chidambaram Mughal troops",
      "c": "Hampi",
      "d": "Srikalahasti A 20 Topicwise Solved Papers"
    },
    "answer": "c",
    "explanation": "Oldest temple in Hampi (Pattadkal) located on southern Prinsep decoded the edicts of emperor Ashoka. Prinsep’s bank of river Tungabhadra. It is now a World Heritage site. inscription proved to be a series of edicts issued by a king It was built by Lokamahadevi, the Queen of Vikaramaditya calling himself “Beloved-of-the-Gods, King Piyadasi.” II (A.D.733-745) in about A.D.740 to commemorate her Ref: Std 12th NCERT, Themes in India History, Part-I, husband’s victory over the Pallavas of Kanchipuram"
  },
  {
    "number": 88,
    "text": "Consider the following:",
    "year": "2015-I",
    "options": {
      "a": "Nagarjuna",
      "b": "Tukaram The arrival of Babur into India led to the",
      "c": "Tyagaraja",
      "d": "Vallabhacharya"
    },
    "answer": "b",
    "explanation": "In the fourteenth and fifteenth century gun powder was"
  },
  {
    "number": 1,
    "text": "Buddha was by that time considered as one of the 3. establishment of Timurid dynasty in the region incarnations of Vishnu and thus became a part of Select the correct answer using the code given below. Vaishnavism. (a) 1 and 2 only (b) 3 only 2. Invading tribes from Central Asia till the time of last (c) 1 and 3 only (d) 1, 2 and 3 Gupta king adopted Hinduism and persecuted 89. Who of the followin",
    "year": "2015-I",
    "options": {
      "a": "Amoghavarsha I",
      "b": "Ballala II",
      "c": "Harihara I",
      "d": "Prataparudra II"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 90,
    "text": "Banjaras during the medieval period of Indian history were 82. With reference to Dhrupad, one of the major traditions of generally",
    "year": "2016-I",
    "options": {
      "a": "agriculturists",
      "b": "warriors following statements are correct?",
      "c": "weavers",
      "d": "traders"
    },
    "answer": "d",
    "explanation": "In India, Banjara people were transporters of goods"
  },
  {
    "number": 2,
    "text": "Dhrupad is primarily a devotional and spiritual music. (a) Georg Buehler (b) James Prinsep 3. Dhrupad Alap uses Sanskrit syllables from Mantras. (c) Max Muller (d) William Jones Select the correct answer using the codes given below: 92. With reference to the religious history of India, consider (a) 1 and 2 only (b) 2 and 3 only the following statements :",
    "year": "2016-I",
    "options": {
      "c": "1, 2 and 3",
      "d": "None of the above is correct"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 84,
    "text": "Consider the following Bhakti Saints: [2013 - I] 1. Both were built in the same period. 1. Dadu Dayal 2. Both belong to the same religious denomination. 2. Guru Nanak 3. Both have rock-cut monuments. 3. Tyagaraja Select the correct answer using the code given below. Who among the above was/were preaching when the Lodi (a) 1 and 2 only dynasty fell and Babur took over? (b) 3 only (a) 1 and 3 (b) 2 ",
    "year": "2016-I",
    "options": {
      "a": "bonded labour",
      "b": "Jaipur school",
      "c": "Kangra school",
      "d": "Kishangarh school"
    },
    "answer": "b",
    "explanation": "Guru Nanak Dev was born in 1469. Babur defeated into the Mughal Empire. Ibrahim Lodi in 1526. When Babur took over and established"
  },
  {
    "number": 2,
    "text": "Land assignments to Jagirdars were hereditary and (c) Agrahaarika (d) Maagadha revenue rights of Zamindars were not hereditary. 96. Consider the following pairs:",
    "year": "2016-I",
    "options": {
      "a": "1 only",
      "b": "2 only Famous place Region",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Saint Kabir was greatly influenced by Shaikh Ahmad 1. Siddhas (Sittars) of Tamil region were monotheistic Sirhindi. and condemned idolatry. Which of the statements given above is/ are correct? 2. Lingayats of Kannada region questioned the theory (a) 1 only (b) 2 only of rebirth and rejected the caste hierarchy. (c) Both 1 and 2 (d) Neither 1 nor 2 Which of the statements given above is/are correct",
    "year": "2019-I",
    "options": {
      "a": "Tansen was the title given to him by Emperor Akbar.",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The tax rate on land was fixed depending on the (c) Tansen composed songs on his patrons. quality of the land. (d) Tansen invented many Ragas. 2. Private owners of workshops paid an industries tax. 105. Who among the following Mughal Emperors Shifted Which of the statements given above is/are correct? emphasis from illustrated manuscripts to album and (a) 1 only (b) 2 only individual portrait?",
    "year": "2019-I",
    "options": {
      "a": "Humayun",
      "b": "Akbar",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 106,
    "text": "With reference to the history of India, consider the 1. White marble was used in making Buland Darwaza and following pairs:",
    "year": "2020-I",
    "options": {
      "a": "1 only",
      "b": "2 only Which of the pairs given above is/are correctly matched?",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "b",
    "explanation": "statement#1 ought to be right. Second statement is wrong. • Aurang- Persian term for Warehouse (given in “Rumi Darwaza, Bara Imambara, Chhatar Manzil are NCERT class 8- Our Past- II, also covered in the Youtube monuments are fragile in terms of structural strength Lecture). So, #1 is wrong, In both of this option (b & c) (because) The common material used for raising most of the pair#3 (Mirasidar) isis common so we have to accept it monuments in Lucknow was brick and plaster, says as correct. Ev"
  }
]