[
  {
    "number": 1,
    "text": "Archibald Percival Wavell, Viscount and Earl Wavell (a) Jawaharlal Nehru (b) Dr. S. Radhakrishnan 2. James Andrew Broun-Ramsay, Earl and Marquess of (c) C. Rajagopalachari (d) Dr. Rajendra Prasad Dalhousie 2. Hooghly was used as a base for piracy in the Bay of Bengal 3. Charles Cornwallis 2nd Earl and first Marquess of by:",
    "year": "1995",
    "options": {
      "a": "the Portuguese",
      "b": "the French"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 4,
    "text": "Gilbert John Elliot-Murray-Kynynmound, Earl of Minto (c) the Danish (d) the British 5. Louis Mountbatten, Earl Mountbatten of Burma 3. The 'Modi script' was employed in the documents of the: (a) A-3; B-2; C-4 ;D-1 (b) A-1; B-2; C-3; D-4",
    "year": "1995",
    "options": {
      "a": "Wodeyars",
      "b": "Zamorins",
      "c": "A-2; B-5; C-3; D-1",
      "d": "A-2; B-4; C-5; D-3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 8,
    "text": "His principal forte was social and religious reform. He relied (c) Hoysalas (d) Marathas upon legislation to do away with social ills and work 4. Examine the map given below:",
    "year": "1995",
    "options": {
      "a": "Ishwar Chandra Vidyasagar",
      "b": "Behramji Merwanji Malabari",
      "c": "Mahadev Govind Ranade",
      "d": "B.R. Ambedkar"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 9,
    "text": "The following advertisement.",
    "year": "1996",
    "options": {
      "a": "Scindias, Holkars, Gaekwads and Bhonsles LIFE-SIZED REPRODUCTIONS",
      "b": "Holkars, Scindias, Gaekwads and Bhonsles BY",
      "c": "Gaekwads, Bhonsles, Scindias and Holkars MESSERS LUMIERE BROTHERS CINEMATOGRAPHIE",
      "d": "Scindias, Holkars, Bhonsles and Gaekwads A FEW EXHIBITIONS WILL BE GIVEN"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 5,
    "text": "Which one of the following pairs is correctly matched? AT",
    "year": "1995",
    "options": {
      "a": "Battle of Buxar—Mir Jafar vs. Clive TONIGHT",
      "b": "Battle of Wandiwash—French vs. East India Company Appeared in the Times of India dated 7th August:",
      "c": "Battle of Chilianwala—Dalhousie vs. Marathas",
      "d": "Battle of Kharda—Nizam vs. East India Company"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 6,
    "text": "The word Adivasi was used for the first time to refer to the 10. Who among the following was the first European to initiate tribal people by:",
    "year": "1995",
    "options": {
      "a": "Mahatma Gandhi",
      "b": "Thakkar Bappa with a view to acquire territories?",
      "c": "Jyotiba Phule",
      "d": "B.R. Ambedkar"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Hindu College, Calcutta Bengal (under Regulating Act, 1773) 2. University of Calcutta (B) Governor-General of India (under Charter Act, 1833) 3. Adam's Report 4. Wood's Despatch (C) Governor-General and Viceroy of India The correct chronological order of these landmarks is: (under Indian Council Act, 1858) (a) 1, 3, 4, 2 (b) 1, 4, 3, 2 (D) Governor-General and Crown Representative (c) 3, 1,4, 2 (d",
    "year": "1996",
    "options": {
      "a": "Rast Goftar",
      "b": "The author of the play 'Ghashiram Kotwal's is Vijay",
      "c": "Maratha",
      "d": "Nibandhamala"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 13,
    "text": "Who among the following was associated with suppression on the famine of Bengal. of thugs?",
    "year": "1997",
    "options": {
      "a": "General Henry Prendergast",
      "d": "Urdu theatre used to depend heavily on Parsi theatre."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Rabindranath Tagore 14. What is the correct chronological sequence of the following? War of Independence 1. Wood's Education Despatch B. Anand Math 2. Sri Aurobindo 2. Macaulay's minute on education C. Life Divine 3. Bankim Chandra 3. The Sargent Education Report Chatterji 4. Indian Education (Hunter Commission) D. Sadhana 4. Vinayak Damodar Select the correct answer using the code given below: Sa",
    "year": "1997",
    "options": {
      "a": "2, 1, 4, 3",
      "b": "2, 1, 3, 4",
      "c": "1, 2, 4, 3",
      "d": "4, 3, 1, 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "First Anglo-Afghan War (a) opposed the revolt of 1857 C. 1824 3. First Anglo-Maratha War (b) supported the revolt of 1857 D. 1838 4. Second Anglo-Mysore War (c) remained neutral to the revolt of 1857 Codes: (d) fought against native rulers (a) A – 4; B – 3; C – 2; D – 1 17. The paintings of Abanindranath Tagore are classified as: (b) A – 4; B – 3; C – 1; D – 2",
    "year": "1999",
    "options": {
      "a": "realistic",
      "b": "socialistic",
      "c": "A – 3; B – 4; C – 1; D – 2",
      "d": "A – 3; B – 4; C – 2; D – 1"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 26,
    "text": "The last major extension of British Indian territory took place 18. There was no independent development of industries in during the time of :",
    "year": "2000",
    "options": {
      "a": "Dufferin",
      "b": "Dalhousie",
      "c": "Lytton",
      "d": "Curzon"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 27,
    "text": "Which one of the following statements is incorrect?",
    "year": "2000",
    "options": {
      "a": "Goa attained full statehood in",
      "c": "scarcity of natural resources"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1987,
    "text": "(d) preference of the rich to invest in land (b) Diu is an island in the Gulf of Khambhat. 19. The first feature film (talkie) to be produced in India was: (c) Daman and Diu were separated from Goa by the 56th",
    "year": "1999",
    "options": {
      "a": "Hatimtai",
      "b": "Alam Ara",
      "c": "Pundalik",
      "d": "Dadra and Nagar Haveli were under French colonial"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1954,
    "text": "20. The Governor-General who followed a spirited \"Forward\" 28. Who among the following Indian rulers established policy towards Afghanistan was:",
    "year": "1999",
    "options": {
      "a": "Minto",
      "b": "Dufferin",
      "c": "Elgin",
      "d": "Lytton"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 21,
    "text": "At a time when empires in Europe were crumbling before 29. Which of the following pairs is not correctly matched? the might of Napoleon, which one of the following",
    "year": "2001",
    "options": {
      "a": "India's first technicolour film –Jhansi ki Rani",
      "b": "India's first 3-D film – My dear Kuttichathan",
      "c": "India's first insured film –Taal",
      "d": "Lord Hastings"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 30,
    "text": "Under the Permanent Settlement, 1793, the Zamindars are 36. Which one of the following Acts of British India required to issue pattas to the farmers which were not issued strengthened the Viceroy's authority over his Executive by many of the Zamindars. The reason was:",
    "year": "2001",
    "options": {
      "a": "the Zamindars were trusted by the farmers. for corporate functioning?",
      "b": "there was no officials check upon the Zamindars.",
      "c": "it was the responsibility of the British government.",
      "d": "the farmers were not interested in getting pattas."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 39,
    "text": "In India, among the following locations, the Dutch (a) The Deccan Association established their earliest factory at:",
    "year": "2003",
    "options": {
      "a": "Surat",
      "b": "The Indian Association",
      "c": "The Madras Mahajan Sabha",
      "d": "Cassimbazar"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 40,
    "text": "The aim of education as stated by the Wood's Despatch of 34. With which one of the following mountain tribes did the 1854 was:",
    "year": "2003",
    "options": {
      "a": "the creation of employment opportunities for native in the year 1765?",
      "b": "Khasis",
      "c": "Kukis",
      "d": "Tipperahs"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 4,
    "text": "The Company's directors (a) The trading activities of the East India Company were were asked to present to the to be abolished. British government all (b) The designation of the supreme authority was to be correspondence and docu- changed as the Governor-General of India in Council. ments pertaining to the (c) All law-making powers to be conferred on Governor- administration of the General in Coun",
    "year": "2003",
    "options": {
      "a": "To bring Indians and Europeans at par as far as the",
      "b": "To impose severe restrictions on the freedom of the",
      "c": "A – 2; B – 3; C – 4; D – 1",
      "d": "A – 1; B – 4; C – 3; D – 2 criminal jurisdiction of courts was concerned. 5337_DBE Modern History A 29"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 51,
    "text": "Which one of the following territories was not affected by native press as it was perceived to be hostile to colonial the Revolt of 1857 ?",
    "year": "2005",
    "options": {
      "a": "Jhansi",
      "b": "Chittor",
      "c": "To encourage the native Indians to appear for civil",
      "d": "Lucknow service examinations by conducting them in India."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Bankim Chandra Chattopadhyay was the first graduate (a) Hindustan Commercial Bank of the Calcutta University. (b) Oudh Commercial Bank 3. Keshav Chandra Sen's campaign against Sati led to (c) Punjab National Bank the enactment of a law to ban Sati by the Governor (d) Punjab and Sind Bank General. 45. Which of the following pairs are correctly matched? Which of the statements given above is/are cor",
    "year": "2005",
    "options": {
      "a": "1 only",
      "b": "1 and 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "AD 1824–26 First Anglo-Burmese War (a) Lord Dufferin (b) Lord Ripon 4. AD 1845–46 Second Sikh War (c) Lord Curzon (d) Lord Hardinge Select the correct answer using the codes given below: 54. Which one of the following is the correct statement?",
    "year": "2004",
    "options": {
      "a": "The modern Kochi was a Dutch colony till India's",
      "b": "3 and 4 independence.",
      "c": "1 and 2",
      "d": "2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 46,
    "text": "Which one of the following pairs is not correctly matched? Williams in the modern Kochi.",
    "year": "2004",
    "options": {
      "a": "Pitt's India Act : Warren Hastings Portuguese took over.",
      "b": "Doctrine of Lapse : Dalhousie",
      "c": "The modern Kochi was first a Dutch colony before the",
      "d": "The modern Kochi never became a part of a British"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Satara (a) Battle of Wandiwash–Battle of Buxar–Battle of The correct chronological order in which they were annexed Ambur–Battle of Plassey by the British is:",
    "year": "2004",
    "options": {
      "a": "1, 2, 3",
      "b": "Battle of Ambur–Battle of Plassey–Battle of",
      "c": "3, 2, 1",
      "d": "3, 1, 2"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 49,
    "text": "Consider the following statements: Ambur–Battle of Buxar 1. In the Third Battle of Panipat, Ahmed Shah Abdali (d) Battle of Ambur–Battle of Buxar–Battle of defeated Ibrahim Lodi. Wandiwash–Battle of Plassey 2. Tipu Sultan was killed in the Third Anglo-Mysore War. 57. Who among the following was a proponent of Fabianism as 3. Mir Jafar entered in a conspiracy with the English for a movement?",
    "year": "2005",
    "options": {
      "a": "Annie Besant Plassey.",
      "b": "A.O. Hume Which of the statements given above is/are correct?",
      "c": "Michael Madhusudan Dutt",
      "d": "R. Palme Dutt"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 58,
    "text": "Consider the following statements: 50. Which one of the following places did Kunwar Singh, a 1. The Charter Act, 1853 abolished East India Company prominent leader of the Revolt of 1857 belong to ?",
    "year": "2005",
    "options": {
      "a": "Bihar",
      "b": "Madhya Pradesh"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 2,
    "text": "Under the Government of India Act, 1858 the British (c) Rajasthan (d) Uttar Pradesh Parliament abolished the rule of East India Company and undertook the responsibility of ruling India directly. A 30 Topicwise Solved Papers Which of the statement(s) given above is/are correct? Codes:",
    "year": "2006",
    "options": {
      "a": "A-2; B-4; C-1",
      "b": "A-3; B-4; C-2",
      "c": "A-2; B-3; C-1",
      "d": "A-3; B-1; C-4"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 70,
    "text": "In collaboration with David Hare and Alexander Duff, who 59. Which one of the following revolts was made famous by of the following established Hindu College at Calcutta? Bankim Chandra Chatterjee in his novel ‘Anand Math’? (a) Henry Louis Vivian Derozio",
    "year": "2009",
    "options": {
      "a": "Bhil uprising",
      "b": "Ishwar Chandra Vidyasagar",
      "c": "Keshab Chandra Sen",
      "d": "Raja Rammohan Roy"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The first telegraph line in India was laid between 60. With reference to the ‘revolt of the year’ who of the following Kolkata (formerly Calcutta) and Diamond Harbour. was betrayed by ‘friend’ captured and put to death by the 2. The first Export Processing Zone in India was set up in British?",
    "year": "2006",
    "options": {
      "a": "Nana Sahib",
      "b": "Kunwar Singh Which of the statements given above is/are correct?",
      "c": "Khan Bahadur Khan",
      "d": "Tatya Tope"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 62,
    "text": "Who among the following started the newspaper Shome (a) Warren Hastings (b) Wellesley Prakash?",
    "year": "2007",
    "options": {
      "a": "Dayanand Saraswati",
      "c": "Cornwallis",
      "d": "William Bentinck"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 73,
    "text": "By a regulation in 1793, the District Collector was deprived (b) Ishwar Chandra Vidyasagar of his judicial powers and made the collecting agent only. (c) Raja Rammohan Roy What was the reason for such a regulation ?",
    "year": "2010",
    "options": {
      "a": "Lord Cornwallis felt that the District Collector's",
      "d": "Surendranath Banerjee"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 63,
    "text": "The ruler of which one of the following States was removed efficiency of revenue collection would enormously from power by the British on the pretext of misgovernance? increase without the burden of additional work. (a) Awadh (b) Jhansi",
    "year": "2007",
    "options": {
      "b": "Lord Cornwallis felt that judicial power should",
      "c": "Nagpur",
      "d": "Satara compulsorily be in the hands of Europeans while"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 64,
    "text": "The First Factory Act restricting the working hours of women Indians can be given the job of revenue collection in the districts. and children and authorizing local government to make (c) Lord Cornwallis was alarmed at the extent of power necessary rules was adopted during whose time?",
    "year": "2007",
    "options": {
      "a": "Lord Lytton",
      "b": "Lord Bentinck absolute power was undesirable in one person.",
      "c": "Lord Ripon",
      "d": "Lord Canning"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 65,
    "text": "Who among the following Europeans were the last to come and a good training in law and Lord Cornwallis felt that to pre-independence India as traders?",
    "year": "2007",
    "options": {
      "a": "Dutch",
      "b": "English"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 66,
    "text": "Consider the following statements: (a) He wanted to avenge the expulsion by Marathas of 1. Robert Clive was the first Governor-General of Bengal. his viceroy Timur Shah from Lahore. 2. William Bentinck was the first Governor-General of India. (b) The frustrated governor of Jalandhar Adina Beg Khan Which of the statements given above is/are correct?",
    "year": "2007",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "He wanted to punish Mughal administration for non-"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 67,
    "text": "Which one of the following was the first fort constructed Aurangabad, Sialkot and Pasrur). by the British in India?",
    "year": "2007",
    "options": {
      "a": "Fort William",
      "b": "Fort St George the borders of Delhi in his kingdom.",
      "c": "Fort St David",
      "d": "He wanted to annex the fertile plains of Punjab up to"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "The first European power to occupy Pondicherry were (b) Ishwar Chandra Vidyasagar the Portuguese. (c) Pandita Rambai 2. The second European power to occupy Pondicherry were the French. (d) Rabindranath Tagore 3. The English never occupied Pondicherry. 69. Match List-I with List-II and select the correct answer using Which of the statements given above is/are correct ? the code given below the List",
    "year": "2008",
    "options": {
      "a": "1 only",
      "c": "3 only",
      "d": "1, 2 and 3 A. Bankimchandra"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Dadabhai Naoroji 2. G. Subramania Iyer 2. Use of mobile cannons in warfare. 3. R. C. Dutt 3. Cultivation of tobacco and red chillies. Select the correct answer using the code given below. Which of the above was/were introduced into India by the (a) 1 only (b) 1 and 2 only English? (c) 2 and 3 only (d) 1, 2 and 3 A 32 Topicwise Solved Papers 91. The Government of India Act of 1919 clearly defined 9",
    "year": "2015-I",
    "options": {
      "a": "the separation of power between the judiciary and the Wellesley?",
      "b": "the jurisdiction of the central and provincial",
      "c": "To secure a fixed income for the Company",
      "d": "To establish British paramountcy over the Indian Viceroy States"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 100,
    "text": "Economically, one of the results of the British rule in India 92. Satya ShodhakSamaj organized",
    "year": "2016-I",
    "options": {
      "a": "a movement for upliftment of tribals in Bihar",
      "b": "a temple-entry movement in Gujarat",
      "c": "an anti-caste movement in Maharashtra",
      "d": "a peasant movement in Punjab"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 93,
    "text": "The Montague-Chelmsford Proposals were related to 101. Which among the following events happened earliest ? (a) social reforms",
    "year": "2016-I",
    "options": {
      "a": "Swami Dayanand established Arya Samaj.",
      "b": "educational reforms",
      "c": "reforms in police administration",
      "d": "constitutional reforms"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Sanskrit College at Benaras: William Jones (a) 1 and 3 only (b) 2 and 3 only 2. Calcutta Madarsa: Warren Hastings (c) 3 only (d) 1, 2 and 3 3. Fort William College: Arthur Wellesley 95. What was the main reason for the split in the Indian Which of the pairs given above is/are correct ? National Congress at Surat in 1907?",
    "year": "2016-I",
    "options": {
      "a": "1 and 2",
      "b": "2 only",
      "c": "1 and 3",
      "d": "3 only Lord Minto"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Grants-in-Aid system was introduce(d) (c) Foundation of Muslim League 2. Establishment of universities was recommende(d) (d) Aurobindo Ghosh’s inability to be elected as the 3. English as a medium of instruction at all levels of President of the Indian National Congress education was recommende(d) 96. The plan of Sir Stafford Cripps envisaged that after the Select the correct answer using the code",
    "year": "2016-I",
    "options": {
      "a": "1 and 2 only",
      "b": "2 and 3 only",
      "c": "1 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Charter Act of 1813 that she will join the Commonwealth 2. General Committee of Public Instruction, 1823 (d) India should be given Dominion status 3. Orientalist and Anglicist Controversy 97. With reference to cultural history of India, consider the Select the correct answer using the code given below following statements :",
    "year": "2018-I",
    "options": {
      "a": "1 and 2 only",
      "b": "2 only"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Annamacharya and Tyagaraja are contemporaries. (a) (B) Krishna Pillai, E.M.S. Namboodiripad and K.(C) 4. Annamacharya kirtanas are devotional songs in George praise of Lord Venkateshwar(a) (b) Jayaprakash Narayan, DeenDayal Upadhyay and Which of the statements given above are correct? M.N. Roy (a) 1 and 3 only (b) 2 and 4 only (c) (C)P. Ramaswamy Iyer, K. Kamaraj and Veeresalingam (c) 1, 2 and 3 (",
    "year": "2018-I",
    "options": {
      "a": "Raw cotton, oil-seeds and opium",
      "b": "Sugar, salt, zinc and lead",
      "c": "Copper, silver, gold, spices and tea",
      "d": "Cotton, silk, saltpetre and opium"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "Air India was nationalised and became the national (a) Peasant resistance to the oppressive conduct of carrier. planters 4. Goa became a part of independent Indi(a) (b) Its unprofitability in the world market because of Which of the following is the correct chronological new inventions sequence of the above events? (c) National leaders’ opposition to the cultivation of (a) 4 - 1 - 2 - 3 (b) 3 - 2 ",
    "year": "2019-I",
    "options": {
      "a": "The ceiling laws were aimed at family holdings and",
      "b": "The major aim of land reforms was providing agriculture land to all the landless.",
      "c": "It resulted in cultivation of cash crops as a India predominant form of cultivation.",
      "d": "Land reforms permitted no exemptions to the ceiling associates employment limits."
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "All India Anti-Untouchability League: Mahatma Gandhi (b) Jyotiba Phule 2. All India Kisan Sabha: Swami Sahajanad Saraswati (c) Mohandas Karamchand Gandhi 3. Self Respect Movement: E.V. Ramaswami Naicker (d) Bhimrao Ramji Ambedkar A 34 Topicwise Solved Papers HINTS & SOLUTIONS 1. (a) C. Rajagopalachari was the Head of the Department of help the rebels and some were openly hostile to the rebels Educ",
    "year": "1995",
    "options": {
      "a": "the Finance Commission",
      "b": "the National Development Council",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 10,
    "text": "Who among the following leaders did not believe in the (c) Nehru Report drain theory of Dadabhai Naoroji ?",
    "year": "1996",
    "options": {
      "a": "B.G. Tilak",
      "b": "R.C. Dutt",
      "d": "the Constitution of India"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 11,
    "text": "B.R. Ambedkar was elected to the Constituent Assembly (a) Kisan Sahba (b) The Worker from:",
    "year": "1996",
    "options": {
      "a": "West Bengal",
      "b": "Bombay President",
      "c": "Vanguard",
      "d": "Anushilan"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 3,
    "text": "What is the correct sequence of the following events? 1. The Lucknow Pact",
    "year": "1995",
    "options": {
      "c": "Madhya Bharat",
      "d": "Punjab"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 4,
    "text": "The Partition of Bengal (a) Rowlatt Act (b) Pitt's India Act Codes: (c) Indian Arms Act (d) Ilbert Bill (a) 1, 3, 2, 4 (b) 4, 1, 3, 2 13. The meeting of Indian and British political leaders during (c) 1, 2, 3, 4 (d) 4, 3, 2, 1 1930–32 in London has often been referred to as the First, 4. The Barrah dacoity was the first major venture of the Second and Third Round Table Conferences. It would be rev",
    "year": "1996",
    "options": {
      "a": "Bombay–Karnataka",
      "b": "Punjab of them",
      "c": "East Bengal",
      "d": "The Madras Presidency"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 5,
    "text": "In 1930, Mahatma Gandhi started Civil Disobedience participating in the conference represented sectional Movement from:",
    "year": "1995",
    "options": {
      "a": "Sevagram",
      "b": "Dandi",
      "c": "the British Labour Party had withdrawn from the",
      "d": "Wardha conference thereby making the proceeding of the"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 6,
    "text": "Which one of the following pairs is not correctly matched? conference partisan",
    "year": "1995",
    "options": {
      "a": "Jamnalal Bajaj—Satyagraha Ashram at Wardha and not that of three separate conference",
      "b": "Dadabhai Naoroji—Bombay Association",
      "d": "It was an instance of a conference held in three session"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 14,
    "text": "Who among the following was a prominent leader of the (c) Lala Lajpat Rai—National School at Lahore Congress Socialist Party?",
    "year": "1996",
    "options": {
      "a": "M.N. Roy",
      "b": "Ganesh Shankar Vidyarthi",
      "d": "Bal Gangadhar Tilak—Satya Shodhak Sabha"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 7,
    "text": "The Sarabandi (no tax) campaign of 1922 was led by: (a) Bhagat Singh (b) Chittaranjan Das",
    "year": "1996",
    "options": {
      "c": "Pattam Thanu Pillai",
      "d": "Acharya Narendra Dev"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 4,
    "text": "The growth of education (b) Interim Cabinet of Indians Committee Report in British India and (c) Acceptance of Pakistan potentialities of its (d) Constitution framing right further progress 18. Match List-I with List-II and select the correct answer: Codes:",
    "year": "1996",
    "options": {
      "a": "A – 3; B – 2; C – 1; D – 4 List-I List-II",
      "b": "A – 1; B – 4; C – 2; D – 3 A. Abhinav Bharat"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 1,
    "text": "Country-wise agitation C. 1927 3. Foundation of Muslim Reforms League at Dacca B. Simon Commission 2. Withdrawal of a movement D. 1932 4. First session of National C. Chauri-Chaura 3. Communal electrorates Conference at Calcutta incident Codes: D. Dandi March 4. Communal outbreaks (a) A – 4; B – 3; C – 1; D – 2 5. Illegal manufactures of (b) A – 3; B – 4; C – 1; D – 2 salt (c) A – 4; B – 3; C – 2;",
    "year": "1996",
    "options": {
      "b": "A – 4; B – 1; C – 2; D – 3 The Non-Cooperation Movement led to :",
      "c": "A – 2; B – 3; C – 4; D – 5"
    },
    "answer": null,
    "explanation": ""
  },
  {
    "number": 21,
    "text": "Who among the following suggested the winding up of the List-I List-II Indian National Congress after India attained independence? A. Surat Split 1. 1929",
    "year": "1996",
    "options": {
      "a": "C. Rajagopalachari",
      "b": "Achrya Kripalani D. Poorna Swaraj 4. 1907",
      "c": "Mahatma Gandhi",
      "d": "Jayaprakash Narain Resolution 5. 1905 5337_DBE"
    },
    "answer": null,
    "explanation": ""
  }
]