[
  {
    "number": 2,
    "text": "Jatin Das 1. Theodore Beck : Mohammedan Anglo Oriental College, C. Lahore Conspiracy 3. Surya Sen Aligarh. D. Ghadar Party 4. Ram Prasad Bismil 2. Ilbert Bill: Ripon 5. Vasudeo Phadke 3. Pherozeshah Mehta: Indian National Congress Codes: 4. Badruddin Tyabji: Muslims League (a) A – 3; B – 4; C – 1; D – 5 Select the correct answer using the codes given below: (b) A – 4; B – 3; C – 2; D – 5 Codes: (c",
    "year": "1997",
    "options": {
      "a": "Swaraj Party \"This statement is attributed to:",
      "b": "All India National Liberal Federation",
      "c": "Madras Labour Union",
      "d": "None of the above"
    },
    "answer": "c",
    "explanation": "Communist Vanguard was an emigre Communist"
  },
  {
    "number": 29,
    "text": "What is the correct sequence of the following events? (a) Bhagat Singh (b) Lala Hardayal 1. Tilak's Home Rule League",
    "year": "1998",
    "options": {
      "c": "Bal Gangadhar Tilak",
      "d": "V.D. Savarkar"
    },
    "answer": "d",
    "explanation": "Tilak’s Home Rule League – April, 1916; Karnagatamaru the second highest-ranking League politician Liaquat Ali Incident – September, 1914; Mahatma Gandhi’s arrival in Khan became the head of the Department of Finance. Abdur India from South Africa –1915 Rab Nishtar headed the Departments of Posts and Air and"
  },
  {
    "number": 2,
    "text": "Karnagatamaru Incident 38. Lord Mountbatten came to India as a Viceroy with specific 3. Mahatma Gandhi's arrival in India Select the correct answer using the codes given below: instruction to:",
    "year": "1998",
    "options": {
      "a": "balkanize the Indian sub-continent",
      "b": "3, 2, 1",
      "c": "2,1, 3",
      "d": "2, 3, 1"
    },
    "answer": "c",
    "explanation": "Communist Vanguard was an emigre Communist"
  },
  {
    "number": 30,
    "text": "Simon Commission of 1927 was boycotted because:",
    "year": "1998",
    "options": {
      "a": "there was no Indian member in the Commission",
      "d": "persuade the Congress to accept the partition"
    },
    "answer": "a",
    "explanation": "All the 7 members of Simon Commission were whites. Ibrahim Ismail Chundrigar headed the Department of"
  },
  {
    "number": 31,
    "text": "The Indian Muslims, in general, were not attracted to the (a) Both A and R are true but R is the correct explanation of A Extremist movement because of :",
    "year": "1998",
    "options": {
      "a": "influence' of Sir Sayed Ahmed Khan",
      "b": "Both A and R are true but R is not a correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "d",
    "explanation": "The extremists believed in sacrificing everything Commerce. The League nominated a Scheduled Caste Hindu including life for the cause of the motherland. They tried to politician Jogendra Nath Mandal to lead the Department of instill self-respect and patriotism in the people by invoking Law. past heroes like Ashoka, Shivaji, Maharana Pratap and Rani"
  },
  {
    "number": 40,
    "text": "Assertion (A): Partition of Bengal in 1905 brought to an (d) extremists' policy of harping on Hindu aspect end the moderates' role in the Indian freedom movement. 32. Which one of the following events, was characterised by Reason (R): The Surat session of Indian National Congress Montague as 'Preventive Murder'?",
    "year": "1998",
    "options": {
      "a": "Killing of INA activities",
      "b": "Massacre at Jallianwala Bagh",
      "c": "Shooting of the Mahatma",
      "d": "Shooting of Curzon-Wythe"
    },
    "answer": "d",
    "explanation": "A is false as role of moderates continued after partition cleared the exam again in 1874 and was posted as assistant of Bengal. Extremists and moderates separated at Surat magistrate in Sylhet. However, Banerjee was dismissed soon session in 1907 but reunited at 1916 session at Lucknow. from his job owing to racial discrimination. Satyendranath"
  },
  {
    "number": 4,
    "text": "The Royal Indian Naval Ratings' Revolt. (a) Both A and R are true but R is the correct explanation of A Select the correct answer using the codes given below: (b) Both A and R are true but R is not a correct explanation Codes: of A (a) 1, 3, 2, 4 (b) 3, 1, 2, 4 (c) 1, 3, 4, 2 (d) 3, 1, 4, 2 (c) A is true but R is false 34. Which one of the following defines extremist ideology (d) A is false but R ",
    "year": "1998",
    "options": {
      "a": "Both A and R are true but R is the correct explanation of A",
      "b": "Surendranath Banerji",
      "c": "R.C. Dutt",
      "d": "Subhash Chandra Bose of A"
    },
    "answer": "c",
    "explanation": "In 1908, Barrah Dacoity was organized by Dacca increasing Hindu-Muslim unity against the British. Anushilan under Pulin Das in East Bengal."
  },
  {
    "number": 53,
    "text": "The term \"imperial preference\" was applied to the:",
    "year": "1999",
    "options": {
      "a": "special privileges on British imports in India",
      "b": "racial discrimination by the Britishers",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "a",
    "explanation": "Imperial Preference (later Commonwealth Preference) refused to take up the responsibility of compulsory was a proposed system of reciprocally-levelled tariffs or free education, but accepted the policy of removal of illiteracy trade agreements between different Dominions and Colonies and urged the provincial governments to take early steps to within the British Commonwealth of Nations. The purpose of provide free elementary education to the poor and more such practices was to promote the mutual "
  },
  {
    "number": 54,
    "text": "Assertion (A): Lord Linlithgow described the August Movement (a) Both A and R are true but R is the correct explanation of A. of 1942 as the most serious rebellion since Sepoy Mutiny. (b) Both A and R are true but R is not a correct explanation Reason (R): There was massive upsurge of the peasantry of A in certain areas.",
    "year": "1999",
    "options": {
      "a": "Both A and R are true but R is the correct explanation of A",
      "b": "Both A and R are true but R is not a correct explanation of A",
      "c": "A is true but R is false",
      "d": "A is false but R is true"
    },
    "answer": "a",
    "explanation": "This movement placed the demand for independence as it recommended dominion status instead of complete on the immediate agenda of national movement. After Quit independence after the World War II. The mission consisted India, there could be no going back. In this struggle, common solely of whites. people displayed unparalleled heroism. That’s why Lord"
  },
  {
    "number": 55,
    "text": "The first venture of Gandhi in all-India politics was the: (a) foreign affairs (b) home (a) Non-Cooperation Movement",
    "year": "1999",
    "options": {
      "b": "Rowlatt Satyagraha",
      "c": "finance",
      "d": "defence"
    },
    "answer": "c",
    "explanation": "Champaran movement was the first action of Gandhi Chauri-Chaura in Gorakhpur district of UP on Feb 5, 1922 on all India level. Satyagraha was to be launched on April 6, led Gandhi to stop the movement. 1919. But after the Jallianwala Bagh massacre, Gandhiji was"
  },
  {
    "number": 45,
    "text": "The Indian National Congress agreed in 1947 to the partition (c) Champaran Movement of the country mainly because:",
    "year": "1998",
    "options": {
      "a": "the principal of two-Nation theory was then acceptable",
      "d": "Dandi March"
    },
    "answer": "c",
    "explanation": "Indian National Congress had worked hard to secure Laxmibai. Because of the extremist's policy of harping on freedom but it came at the cost of partition. They accepted Hindu past, The Indian Muslims in general were not attracted partition not because of its lust for immediate power but to the extremist movement. because of prevailing dynamics in India, which made"
  },
  {
    "number": 56,
    "text": "The Congress policy of pray and petition ultimately came to them to an end under the guidance of:",
    "year": "1999",
    "options": {
      "a": "Aurobindo Ghosh",
      "b": "it was imposed by the British Government and the",
      "c": "Lala Lajpat Rai",
      "d": "Mahatma Gandhi"
    },
    "answer": "b",
    "explanation": "Bal Gangadhar Tilak described the method of three P’s"
  },
  {
    "number": 2,
    "text": "Indian Sociologist (b) not a member of the Congress Cama (c) the President of the Congress C. Annie Besant 3. The Talwar (d) the General Secretary of the Congress D. Aurobindo Gosh 4. Commonwealth 47. 'Abinava Bharat' a secret society of revolutionaries was Codes: organised by:",
    "year": "1999",
    "options": {
      "a": "A – 2; B – 3; C – 4; D – 1",
      "b": "V.D. Savarkar",
      "c": "Prafulla Chaki",
      "d": "Bhagat Singh"
    },
    "answer": "c",
    "explanation": "Communist Vanguard was an emigre Communist"
  },
  {
    "number": 58,
    "text": "\"In this instance we could not play off the Mohammedans (a) Indian Council Act of 1861 against the Hindus.\" (b) Indian Council Act of 1892 To which one of the following events did this remark of (c) Indian Council Act of 1909 Aitchison relate?",
    "year": "2000",
    "options": {
      "a": "Revolt of 1857",
      "d": "Government of India Act of 1919"
    },
    "answer": "c",
    "explanation": "Aitcheson was the Lieutenant Governor of the Punjab,"
  },
  {
    "number": 59,
    "text": "Which one of the following is not a feature of the (a) Simon Commission (b) Gandhi-Irwin Pact Government of India Act of 1935?",
    "year": "2000",
    "options": {
      "a": "Diarchy at the Centre as well as in the provinces",
      "c": "Cripps Mission",
      "d": "Cabinet Mission"
    },
    "answer": "a",
    "explanation": "In the Act of 1935 provincial autonomy replaced distribution of a manifesto. The manifesto, signed by M. N. diarchy. The GIA, 1919 provided for diarchy at the Centre Roy and Abani Mukherjee, demanded complete as well as in the provinces. independence from British rule and asked the INC to sever"
  },
  {
    "number": 51,
    "text": "Which one of the following leaders of the Congress was (a) Japan (b) Burma totally in favour of Cabinet Mission Plan?",
    "year": "1999",
    "options": {
      "a": "Mahatma Gandhi",
      "c": "Singapore",
      "d": "Malaya"
    },
    "answer": "c",
    "explanation": "Cabinet Mission Plan came into being in May 1946. Lala Hardayal. The HQ of Ghadr was in San Francisco. Sardar Patel was totally in favor of cabinet Mission Plan."
  },
  {
    "number": 61,
    "text": "As an alternative to the partition of India, Gandhiji suggested (b) Jawaharlal Nehru to Mountbatten that he:",
    "year": "2000",
    "options": {
      "a": "postponed granting of independence",
      "b": "invited Jinnah to form the government",
      "c": "Sardar Patel",
      "d": "Maulana Abul Kalam Azad"
    },
    "answer": "b",
    "explanation": "Mountbatten Plan came into existence on June 3, 1947. The influence that the manifesto exerted on the delegates Gandhi ji suggested that he should invite Jinnah to form the and participants could be seen from the fact that a radical government rather than partition of India. Congressman, Maulana Hazrat Mohani, moved a resolution"
  },
  {
    "number": 2,
    "text": "C.R. Das was in prison when he functioned as the (b) the Bengal revolutionaries took shelter in Tripura President of the Congress (c) the tribes of the state were fiercely freedom loving 3. The first Britisher to become the President of the (d) there were already some groups fighting against the Congress was Alan Octavian Hume kingship and its protector, the British 4. Alfred Webb was the Presiden",
    "year": "2000",
    "options": {
      "a": "1 and 3",
      "b": "2 and 4",
      "c": "2, 3 and 4",
      "d": "1, 2, 3 and 4"
    },
    "answer": "c",
    "explanation": "Communist Vanguard was an emigre Communist"
  },
  {
    "number": 71,
    "text": "The Hunter Commission was appointed after the: 64. Match List-I with List-II and select the correct answer using (a) Black-hole incident",
    "year": "2001",
    "options": {
      "b": "Jalianwalla Bagh massacre List-I List-II",
      "c": "Uprising of 1857 A. Chittagong"
    },
    "answer": "b",
    "explanation": "Hunter Commission was appointed after the Jallianwala – Prayer, petition and protest as political mendicancy. He Bagh Massacre (13 April 1919). A separate Hunter propagated militancy and not mendicancy. Commission (1882-83) emphsised on primary and secondary"
  },
  {
    "number": 3,
    "text": "Vikram Damodar Savarkar (a) Abdul Kalam Azad D. Kuka Movement 4. Aurobindo Ghosh (b) Hasrat Mohani Codes: (c) Jawahar Lal Nehru (a) A – 1; B – 3; C – 4; D – 2 (d) Mohandas Karamachand Gandhi (b) A – 1; B – 3; C – 3; D – 4 73. Who among the following organized the famous Chittagong (c) A – 3; B – 1; C – 2; D – 4 Armoury raid?",
    "year": "2001",
    "options": {
      "a": "Laxmi Sehgal",
      "c": "Batukeshwar Datta",
      "d": "A – 3; B – 1; C – 4; D – 2"
    },
    "answer": "b",
    "explanation": "Lucknow Pact - 1916; Introduction of Diarchy under Montford Reforms (GIA 1919) - December, 1919; Rowlatt separate issues, but they adopted a common programme of Act - February 1919; Partition of Bengal - 1905. action that of non-violent and non-cooperation. There was"
  },
  {
    "number": 74,
    "text": "A London branch of the All India Muslim League was as 'Reason R', You are to examine these two statement carefully established in 1908 under the presidency of :",
    "year": "2001",
    "options": {
      "a": "Aga Khan",
      "b": "Ameer Ali true and if so, whether the Reason is a correct explanation of the",
      "c": "Liaquat Ali Khan",
      "d": "M.A. Jinnah Assertion. Select your answers to these items using the codes"
    },
    "answer": "b",
    "explanation": "Syed Ameer Ali established a branch of the League in"
  },
  {
    "number": 75,
    "text": "Who among the following was the President of the All India given below and mark your answer sheet accordingly. States' Peoples' Conference in 1939?",
    "year": "2001",
    "options": {
      "a": "Jaya Prakash Narayan",
      "b": "Sheikh Abdullah Codes:",
      "c": "Jawahar Lal Nehru",
      "d": "Sardar Vallabhbhai Patel"
    },
    "answer": "c",
    "explanation": "The All India States Peoples’ Conference was a political Champaran in Bihar against the indigo planters at the request organization in India during the British Raj. The first session of Raj Kumar Shukla. of the organisation was held in Bombay in December 1927."
  },
  {
    "number": 76,
    "text": "With reference to the period of extremist nationalist (b) Both A and R are true but R is not a correct explanation of A movement in India with its spirit of Swadeshi, which one of (c) A is true but R is false the following statements in not correct?",
    "year": "2002",
    "options": {
      "a": "Liaquat Hussain led the Muslim peasants of Barisal in",
      "d": "A is false but R is true"
    },
    "answer": "a",
    "explanation": "Liakat Hussain did not lead the Barisal movement of"
  },
  {
    "number": 67,
    "text": "While delivering the presidential address, the Congress 77. With reference to the Indian freedom struggle, which one of President who advocated the introduction of Roman script the following statements is not correct?",
    "year": "2002",
    "options": {
      "a": "Hakim Ajmal Khan was one of the leaders to start a",
      "b": "Jawaharlal Nehru nationalist and militant Ahrar movement",
      "c": "Abul Kalam Azad",
      "d": "Subhash Chandra Bose"
    },
    "answer": "d",
    "explanation": "In 1938, Haripura session by S.C. Bose 1935 was to use the princes to counter balance the anti"
  },
  {
    "number": 68,
    "text": "At the time of partition of India, which one of the following Ahmed Khan opposed it provinces of British India came forward with a plan for a (c) The All-India Muslim League which was formed in 1906 united and independent existence?",
    "year": "2000",
    "options": {
      "a": "Punjab",
      "b": "Assam separate electorates",
      "c": "Bengal",
      "d": "Bihar"
    },
    "answer": "a",
    "explanation": "The Partition of India was the division of British India imperialist doctrines of the nationalist leaders. in 1947 which accompanied the creation of two independent"
  },
  {
    "number": 69,
    "text": "The Balkan Plan for fragmentation of India was the brain were among those who formed a provisional child of :",
    "year": "2000",
    "options": {
      "a": "W. Churchill",
      "b": "M.A. Jinnah"
    },
    "answer": "c",
    "explanation": "Balkan Plan (1947) was the brain child of Mountbatten. Sambalpur, Udaipur, Jhansi, Nagpur and Awadh. Government This plan envisaged the transfer of power to separate of India Act 1919, introduced diarchy during the viceroyality provinces with Punjab and Bengal given the option to vote of Chelmsford. for partition of their provinces. The partioned units thus"
  },
  {
    "number": 86,
    "text": "The leader of the Bardoli Satyagraha (1928) was: (b) involve the princes actively in the administration of (a) Sardar Vallabhbhai Patel",
    "year": "2003",
    "options": {
      "b": "Mahatma Gandhi",
      "c": "finally effect the complete political and administrative",
      "d": "Mahadev Desai"
    },
    "answer": "a",
    "explanation": "The Bardoli Satyagraha of 1928, in the state of Gujarat in NWFP and Assam also. was led by Vallabhbhai Patel. The women of Bardoli gave"
  },
  {
    "number": 87,
    "text": "Assertion (A): In 1916, Maulana Mohammad Ali and Abul doctrines of the nationalist leaders Kalam Azad resigned from the Legislative Council. 79. The President of Indian National Congress at the time of Reason (R): The Rowlatt Act was passed by the Government partition of India was:",
    "year": "2002",
    "options": {
      "a": "C. Rajagopalachari",
      "b": "J. B. Kripalani Legislative Council.",
      "c": "Jawaharlal Nehru",
      "d": "Maulana Abul Kalam Azad"
    },
    "answer": "d",
    "explanation": "Rowlatt Act was passed in March, 1919. The act of Civil Disobedience. authorized the government to imprison any person without"
  },
  {
    "number": 2,
    "text": "Communal Award (a) The Rowlatt Act aroused a wave of popular indignation C. Dalhousie 3. August Offer and led to the Jallianwala Bagh massacre D. Chelmsford 4. Dyarchy (b) Subhas Chandra Bose formed the Forward Bloc Codes: (c) Bhagat Singh was one of the founders of Hindustan (a) A – 3; B – 2; C – 1; D – 4 Republican Socialist Association (b) A – 3; B – 2; C – 4; D – 1 (d) In 1931, the Congress Se",
    "year": "2003",
    "options": {
      "a": "that all Indian States should join the Indian Union as a",
      "b": "the creation of an Indian Union with Dominion status",
      "c": "the active participation and cooperation of the Indian",
      "d": "the Pathan regional nationalist unity and a struggle with full sovereign status to India after the war against colonialism."
    },
    "answer": "c",
    "explanation": "Communist Vanguard was an emigre Communist"
  },
  {
    "number": 82,
    "text": "Assertion (A): The effect of labour participation in the Indian with no separate constitution for any province, and a nationalist upsurge of the early 1930s was weak. Union Constitution to be accepted by all provinces Reason (R): The labour leaders considered the ideology of 90. When Congress leaders condemned the Montagu-Chelmsford Indian National Congress as bourgeois and reactionary. Report, ma",
    "year": "2003",
    "options": {
      "a": "Swarajya Party",
      "b": "Indian Freedom Party",
      "c": "Independence Federation of India",
      "d": "Indian Liberal Federation"
    },
    "answer": "a",
    "explanation": "The labour leaders were influenced by communist in 1894 at Madras. C.R. Das acted as the President in 1921 in ideology and considered INC as bourgeoisie and Ahmedabad session. reactionary. That's why their participation in the Indian nationalist upsurge was limited. A 54 Topicwise Solved Papers"
  },
  {
    "number": 1,
    "text": "abolition of diarchy in the Governor's provinces (b) Rajagopalachari Formula 2. power of the Governors to veto legislative action and (c) Cabinet Mission to legislate on their own (d) Wavell Plan 3. abolition of the principle of communal representation . 84. The members of the Constituent Assembly which drafted Which of the statements given above is/are correct? the Constitution of India were:",
    "year": "2002",
    "options": {
      "a": "1 only",
      "b": "1 and 2",
      "c": "2 and 3",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "Jawaharlal Nehru and Subhash Chandra Bose as"
  },
  {
    "number": 92,
    "text": "Consider the following statements: (c) elected by the Legislative Assemblies of various 1. The First Session of the Indian National Congress was province held in Calcutta (d) elected by the Indian National Congress and Muslim 2. The Second Session of the Indian National Congress League was held under the presidentship of Dadabhai Naoroji 85. Who headed the Interim Cabinet formed in the year 1946 ?",
    "year": "2003",
    "options": {
      "a": "Rajendra Prasad the Lucknow Pact",
      "b": "Jawaharlal Nehru Which of the statements given above is/are correct?",
      "c": "Sardar Vallabhbhai Patel",
      "d": "Rajagopalachari"
    },
    "answer": "c",
    "explanation": "Statement 1 is incorrect as first session was held in"
  },
  {
    "number": 93,
    "text": "Which one of the following statements is correct? 103. Who drafted the resolution on fundamental rights for the",
    "year": "2004",
    "options": {
      "a": "The Constituent Assembly of India was elected by the",
      "b": "Pandit Jawaharlal Nehru Provincial Assemblies in the year 1946",
      "c": "Dr. Rajendra Prasad",
      "d": "Sardar Vallabhbhai Patel"
    },
    "answer": "a",
    "explanation": "The first session of the Constituent Assembly of India chief commissioner's provinces and Indian states. was held on Dec 9, 1946."
  },
  {
    "number": 104,
    "text": "Who among the following was not associated with the Patel were members of theConstituent Assembly of formation of U.P. Kisan Sabha in February 1918 ?",
    "year": "2005",
    "options": {
      "a": "Indra Narain Dwivedi",
      "b": "Gauri Shankar Misra",
      "c": "The First Session of the Constituent Assembly of India",
      "d": "Madan Mohan MalAviy4a5 was held in January, 1947"
    },
    "answer": "c",
    "explanation": "UP Kisan Sabha was founded by Indra Narayani Vallabh Bhai Patel. Dwivedi and Gauri Shankar Misra in 1918. MM Malviya"
  },
  {
    "number": 2,
    "text": "Ahmedabad Mill Workers : Morarji Desai (b) the Government of India Act, 1919 3. Kheda : Vallabhai Patel (c) the Government of India Act, 1935 Select the correct answer using the code given below: (d) the Indian Independence Act, 1947 Codes: 95. During the Indian freedom struggle, who among the (a) 1 and 2 (b) 2 and 3",
    "year": "2005",
    "options": {
      "c": "1 and 3",
      "d": "1, 2 and 3 following proposed that Swaraj should be defined as"
    },
    "answer": "c",
    "explanation": "Communist Vanguard was an emigre Communist"
  },
  {
    "number": 106,
    "text": "Consider the following statements: complete independence free from all foreign control? 1. Lord Mountbatten was the Viceroy when the Shimla",
    "year": "2004",
    "options": {
      "a": "Mazharul Haque",
      "b": "Maulana Hasrat Mohani"
    },
    "answer": "b",
    "explanation": "Statement 1 is incorrect as Lord Wavell was the Viceroy and other international bodies. when Shimla Conference took place in June, 1945."
  },
  {
    "number": 2,
    "text": "Indian Navy Revolt, 1946 took place when the Indian (c) Hakim Ajmal Khan (d) Abul Kalam Azad sailors in the Royal Indian Navy at Bombay and Karachi 96. The name of the famous person of India who returned the rose against the Government. Knighthood conferred on him by the British Government as Which of the statements given above is/are correct? a token of protest against the atrocities in Punjab in",
    "year": "2005",
    "options": {
      "a": "Tej Bahadur Sapru",
      "b": "Ashutosh Mukherjee",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "c",
    "explanation": "Communist Vanguard was an emigre Communist"
  },
  {
    "number": 107,
    "text": "Consider the following statements: (c) Rabindra Nath Tagore(d) Syed Ahmed Khan 1. In the First Round Table Conference, Dr. Ambedkar 97. Consider the following events during India's freedom struggle: demanded separate electorates for the depressed classes. 1. Chauri-Chaura Outrage 2. In the Poona Act, special provisions for representation 2. Minto-Morley Reforms of the depressed people in the local",
    "year": "2004",
    "options": {
      "a": "1, 3, 2, 4",
      "b": "2, 4, 1, 3",
      "c": "1, 4, 2, 3",
      "d": "2, 3, 1, 4"
    },
    "answer": "c",
    "explanation": "First Round Table Conference was held from Nov, 1930 Chelmsford Report (July, 1918), many moderates led by - Jan 1931. Second Round Table Conference was held in Surendra Nath Banerjea left the party to form Indian Liberal Dec 1931 in London. Third Round Table Conference was Federation in 1919. held from Nov 1932 - Dec 1932. Indian National Congress"
  },
  {
    "number": 98,
    "text": "Where were the Ghadar revolutionaries, who became active 108. Which party was founded by Subhash Chandra Bose in the during the outbreak of the World War I based?",
    "year": "2005",
    "options": {
      "a": "Central America",
      "b": "North America",
      "c": "West America",
      "d": "South America."
    },
    "answer": "b",
    "explanation": "Ghadr revolutionaries were based in San Francisco"
  },
  {
    "number": 99,
    "text": "Consider the following statements: 109. Consider the following statements: On the eve of launch of Quit India Movement, Mahatma Gandhi: The Government of India Act, 1935 provided for: 1. asked the government servants to resign. 1. the provincial autonomy. 2. asked the soldiers to leave their posts. 2. the establishment of a Federal court. 3. asked the Princes of the Princely states to accept the 3",
    "year": "2005",
    "options": {
      "a": "1 and 2",
      "b": "2 and 3",
      "c": "1 and 3",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "Gandhiji asked the government servants not to resign representation. but declare their allegiance to the Congress. Soldiers were"
  },
  {
    "number": 110,
    "text": "Under whose presidency was the Lahore session of the 100. In which one of the following provinces was a Congress Indian Congress held in the year 1929, wherein a resolution ministry not formed under the Act of 1935 ?",
    "year": "2005",
    "options": {
      "a": "Bihar",
      "b": "Madras British?",
      "c": "Orissa",
      "d": "Punjab"
    },
    "answer": "c",
    "explanation": "They also celebrated the first Independence day on"
  },
  {
    "number": 101,
    "text": "At which Congress session was the working committee (c) Jawaharlal Nehru (d) Motilal Nehru authorised to launch a programme of Civil Disobedience? 111. Consider the following statements about Madam Bhikaji (a) Bombay (b) Lahore",
    "year": "2005",
    "options": {
      "c": "Lucknow",
      "d": "Tripura"
    },
    "answer": "b",
    "explanation": "At Lahore session (1929, President - J.L. Nehru) the him the title of Sardar. working committee was authorised to launch a programme"
  },
  {
    "number": 2,
    "text": "Madam Cama served as private secretary to Dadabhai (a) H.K. Sarkar (b) P.C. Joshi Naoroji. (c) M.C. Chagla (d) M.N. Roy 3. Madam Cama was born to a Parsi. A 46 Topicwise Solved Papers Which of the statement(s) given above is/are correct? (a) AN Sinha (b) Braj Kishore Prasad (a) 1, 2 and 3 (b) 2 and 3 only",
    "year": "2006",
    "options": {
      "c": "J B Kriplani",
      "d": "Rajendra Prasad"
    },
    "answer": "c",
    "explanation": "Communist Vanguard was an emigre Communist"
  },
  {
    "number": 124,
    "text": "Which one of the following was a journal brought out by 112. Which Portfolio was held by Dr. Rajendra Prasad in the Abul Kalam Azad?",
    "year": "2008",
    "options": {
      "a": "Al-Hilal",
      "b": "Comrade",
      "c": "The Indian Sociologist",
      "d": "Zamindar"
    },
    "answer": "a",
    "explanation": "The Al-Hilal was a newspaper established by Indian Autonomy in the GOI Act, 1935 leader Maulana Abul Kalam Azad and used as a medium for"
  },
  {
    "number": 125,
    "text": "Where was the First Session of the Indian National Congress 113. Assertion (A) : According to the Wavell Plan, the number held in December 1885?",
    "year": "2008",
    "options": {
      "a": "Ahmedabad",
      "b": "Bombay to be equal.",
      "c": "Calcutta"
    },
    "answer": "b",
    "explanation": "INC was formed on 28 Dec, 1885 in Bombay and its and extremists. first session was held under the presidentship of W.C."
  },
  {
    "number": 126,
    "text": "Who among the following wrote the poem, Subh-e Azadi? have avoided the partition of India.",
    "year": "2007",
    "options": {
      "a": "Sahir Ludhiyanvi",
      "b": "Faiz Ahmed Faiz",
      "c": "Muhammad Iqbal",
      "d": "Maulana Abul Kalam Azad"
    },
    "answer": "b",
    "explanation": "Subh-e Azadi (Dawn of freedom) was written in August, In 1944, he proposed a solution to the Indian Constitutional 1947 after the partition of India. tangle. He prepared a formula for Congress-League"
  },
  {
    "number": 127,
    "text": "Assertion (A): The Congress Ministries in all the provinces resigned in the year 1939. 114. Which one of the following aroused a wave of popular Reason (R): The Congress did not accept the decision of indignation that led to the massacre by the British at the Viceroy to declare war against Germany in the context of Jallianwala Bagh?",
    "year": "2007",
    "options": {
      "a": "The Arms Act",
      "b": "The Public Safety Act",
      "c": "The Rowlatt Act",
      "d": "The Vernacular Press Act"
    },
    "answer": "a",
    "explanation": "R explains A. As in September, 1939, the viceroy cooperation. It was a tacit acceptance of the League’s unilaterally declared that India was at war with Germany demand for Pakistan. Gandhi supported the formula. But without bothering to consult any Indian leader. In protest, Jinnah was in favour of two-nation theory only. Congress ministeries resigned in October, 1939. Muslim"
  },
  {
    "number": 115,
    "text": "At which one of the following places did Mahatma Gandhi (c) A is true but R is false first start his Satyagraha in India?",
    "year": "2007",
    "options": {
      "a": "Ahmedabad",
      "b": "Bardoli",
      "d": "A is false but R is true"
    },
    "answer": "c",
    "explanation": "Mahatma Gandhi first started his Satyagraha in India independence. After the war, a constituent assembly would at Champaran in Bihar in 1917. He was requested by Rajkumar be convened to frame a new constituion. Shukla to look into the problems of poor peasants caused"
  },
  {
    "number": 128,
    "text": "In the ‘Individual Satyagraha’, Vinoba Bhave was chosen (c) Champaran (d) Kheda as the first Satyagrahi. Who was the second? 116. The song ‘Amar Sonar Bangla’ written during the Swadeshi (a) Dr. Rajendra Prasad",
    "year": "2009",
    "options": {
      "a": "Rajni Kanta Sen",
      "b": "Pandit Jawaharlal Nehru Bangladesh and was adopted as the National Anthem of",
      "c": "C. Rajagopalachari Bangladesh. Who wrote this song?",
      "d": "Sardar Vallabhbhai Patel"
    },
    "answer": "b",
    "explanation": "It was started in October 1940. was that Bengal with a population of 78 million was too big A 56 Topicwise Solved Papers to be administered. The government announced partition"
  },
  {
    "number": 129,
    "text": "Consider the following statements: (c) Mukunda Das (d) Rabindranath Tagore The Cripps Proposals include the provision for 117. Who among the following rejected the title of Knighthood 1. Full independence for India. and refused to accept a position in the Council of the 2. Creation of constitution-making body. Secretary of State for India?",
    "year": "2008",
    "options": {
      "a": "Motilal Nehru",
      "b": "M G Ranade",
      "c": "G K Gokhale",
      "d": "B G Tilak"
    },
    "answer": "b",
    "explanation": "The Cripps proposals did not include the provision imprison any person without trial and conviction in a court for full independence for India but offered an Indian union of law. Tagore renounced his Knighthood in protest against with a dominion status. The Congress objected to the Jallianwala Bagh massacre. provision of dominion status instead of complete"
  },
  {
    "number": 118,
    "text": "During the Indian Freedom Struggle, who of the following 130. During the freedom struggle, Aruna Asaf Ali was a major raised an army called ‘Free Indian Legion’?",
    "year": "2008",
    "options": {
      "a": "Lala Hardayal",
      "b": "Rashbehari Bose",
      "c": "Subhas Chandra Bose",
      "d": "V D Savarkar"
    },
    "answer": "c",
    "explanation": "In January 1942, the Propaganda Ministry announced It became a reason for Jallianwala Bagh tragedy of Amritsar the formation of the “Indian National Army” (Jai Hind) in on 13 April, 1919. Berlin. At the end of July 1942, three hundred volunteers"
  },
  {
    "number": 131,
    "text": "Who of the following Prime Ministers sent Cripps Mission (a) Simon Commission (b) Shimla Conference to India?",
    "year": "2009",
    "options": {
      "a": "James Ramsay MacDonald",
      "c": "Cripps Proposal",
      "d": "Cabinet Mission"
    },
    "answer": "d",
    "explanation": "In March 1942, a mission headed by Stafford Cripps two countries, i.e. India and Bangladesh. was sent to India with constitutional proposals to seek Indian"
  },
  {
    "number": 120,
    "text": "Who gave a systematic critique of the moderate politics of (b) Stanley Baldwin the Indian National Congress in a series of articles entitled (c) Neville Chamberlain New Lamps for Old?",
    "year": "2008",
    "options": {
      "a": "Aurobindo Ghosh",
      "b": "R C Dutt",
      "d": "Winston Churchill"
    },
    "answer": "a",
    "explanation": "K.G. Deshpande, a friend of Aurbindo from his slavery. Cambridge days, was in charge of a weekly, “Induprakash”,"
  },
  {
    "number": 121,
    "text": "Who among the following used the phrase ‘UN-British’ to (a) It curtailed the freedom of religion criticize the English colonial control of India?",
    "year": "2008",
    "options": {
      "a": "Anandmohan Bose",
      "b": "It suppressed the Indian traditional education",
      "c": "It authorized the government to imprison people",
      "d": "Pherozeshah Mehta without trial"
    },
    "answer": "c",
    "explanation": "He wrote a book entitled Poverty and Un-British Rule Bengal. in India."
  },
  {
    "number": 133,
    "text": "Which one of the following began with the Dandi March? (a) Lord Irwin (b) Lord Reading (a) Home Rule Movement",
    "year": "2009",
    "options": {
      "b": "Non-Cooperation Movement",
      "c": "Lord Chelmsford",
      "d": "Lord Wavell"
    },
    "answer": "c",
    "explanation": "Gandhi, on March 12, 1930 started March his from the were issued German Army uniforms bearing a badge on the Sabarmati Ashram with 72 people and reached Dandi right arm which showed a leaping tiger superimposed on an (coastal Gujarat) on April 6, 1930, and broke the salt law by Indian tricolour, surrounded by the legend “Freies Indien”. picking up a handful of salt at Dandi and announced the The men were then officially designated the “Free Indian commencement of Civil Disobedience Movement. Leg"
  },
  {
    "number": 134,
    "text": "With which one of the following movements is the slogan (a) The partition of Bengal done by Lord Curzon “Do or die” associated?",
    "year": "2009",
    "options": {
      "a": "Swadeshi Movement imposed on Lokmanya Tilak",
      "b": "A sentence of 18 months rigorous imprisonment",
      "c": "The arrest and deportation of Lala Lajpat Rai and Ajit",
      "d": "Quit India Movement"
    },
    "answer": "d",
    "explanation": "Gandhiji gave a call for do or die in 1942 during Quit"
  },
  {
    "number": 1,
    "text": "Dr. Rajendra Prasad persuaded Mahatma Ga A nd 4 hi 7 to (a) Mahatma Gandhi (b) Sardar Vallabhbhai Patel come to Champaran to investigate the problem of the (c) N.M. Joshi (d) J.B. Kripalani peasants. 136. In the context of the Indian freedom struggle, 16th October 2. Acharya J.B. Kriplani was one of Mahatma Gandhi's 1905 is well known for ................ ?",
    "year": "2009",
    "options": {
      "a": "The formal proclamation of Swadeshi Movement was Which of the statements given above is/are correct ? made in Calcutta town hall",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "c",
    "explanation": "Jawaharlal Nehru and Subhash Chandra Bose as"
  },
  {
    "number": 137,
    "text": "The \"Instrument of Instructions\" contained in the (a) Mahatma Gandhi (b) Pandit Jawaharlal Nehru Government of India Act, 1935 have been incorporated in (c) Dr. Rajendra Prasad (d) Dr. B.R. Ambedkar the Constitution of India in the year 1950 as : 144. Who among the following were official Congress (a) Fundamental Rights",
    "year": "2010",
    "options": {
      "a": "Mahatma Gandhi and Sardar Patel",
      "b": "Directive Principles of State Policy",
      "c": "Extent of executive power of State",
      "d": "Conduct of business of the Government of India"
    },
    "answer": "b",
    "explanation": "Instrument of instructions under Government of India"
  },
  {
    "number": 147,
    "text": "What was the reason for Mahatma Gandhi to organize a (a) Annulment of partition of Bengal satyagraha on behalf of the peasants off Kheda ? (b) Boycott 1. The administration did not suspend the land revenue (c) National education collection in spite of a drought (d) Swadeshi 2. The administration proposed to introduce permanent 140. After Quit India Movement, C. Rajagopalachari issued a settlement ",
    "year": "2010",
    "options": {
      "a": "1 only",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2 composed of representatives of British India and the"
    },
    "answer": "a",
    "explanation": "However, a famine had struck the district and a large name of its chairman as the Simon Commission. All the part of Gujarat, and virtually destroyed the agrarian economy. members of the commission were Englishmen. This The poor peasants had barely enough to feed themselves, announcement was greeted with chorus of protest from all but the British government of the Bombay Presidency Indians. What angered them most was the exclusion of insisted that the farmers not only pay full taxes, but also Ind"
  },
  {
    "number": 1,
    "text": "Radhakanta Deb: First President of the British Indian (b) attainment of Poorna Swaraj was adopted as the goal Association of the Congress 2. GazuluLakshminarasuChetty: Founder of the Madras (c) Non-Cooperation Movement was launched Mahajana Sabha A 49 (d) decision to participate in the Round Table Conference 3. Surendranath Banerjee: Founder of the Indian in London was taken Association 164. Which",
    "year": "2015-I",
    "options": {
      "a": "Swadeshi Movement",
      "c": "2 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "Jawaharlal Nehru and Subhash Chandra Bose as"
  },
  {
    "number": 172,
    "text": "In the context of Indian history, the principle of \"Dyarchy (b) Quit India Movement (diarchy)\" refers to",
    "year": "2017-I",
    "options": {
      "a": "Division of the central legislature into two houses.",
      "b": "Introduction of double government i.e., Central and",
      "c": "Non-Cooperation Movement",
      "d": "Civil Disobedience Movement"
    },
    "answer": "d",
    "explanation": "Government of India act 1919 provided for dyarchy significance in the history of the Freedom Movement in provinces i.e. provincial subjects were classified into because the attainment of Poorna Swaraj was adopted as two parts 1) transferred and 2) reserved. the goal of the Congress."
  },
  {
    "number": 1,
    "text": "Mutiny in Royal Indian Navy (a) 1 and 2 only (b) 3 only 2. Quit India Movement launched (e) 1, 2 and 3 (d) None 3. Second Round Table Conference 166. With reference to Rowlatt Satyagraha, which of the following What is the correct chronological sequence of the above events? statements is/ are correct?",
    "year": "2015-I",
    "options": {
      "a": "1-2-3",
      "b": "2-1-3"
    },
    "answer": "c",
    "explanation": "Jawaharlal Nehru and Subhash Chandra Bose as"
  },
  {
    "number": 3,
    "text": "Demonstrations against the arrival of Simon Governments. Commission coincided with Rowlatt Satyagraha. (b) Define the powers of the Secretary of State for India. Select the correct answer using the code given below. (c) Impose censorship on national press. (a) 1 only (b) 1 and 2 only (d) Improve the relationship between the Government of (c) 2 and 3 only (d) 1, 2 and 3 India and the Indian States.",
    "year": "2015-I",
    "options": {
      "a": "V. O. Chidambaram Pillai",
      "b": "C. Rajagopalachari industries.",
      "c": "K. Kamaraj",
      "d": "Annie Besant disputes."
    },
    "answer": "b",
    "explanation": "Lucknow Pact - 1916; Introduction of Diarchy under Montford Reforms (GIA 1919) - December, 1919; Rowlatt separate issues, but they adopted a common programme of Act - February 1919; Partition of Bengal - 1905. action that of non-violent and non-cooperation. There was"
  },
  {
    "number": 1,
    "text": "The Factories Act, 1881 was passed with a view to fix Which of the statements given above is / are correct? the wages of industrial workers and to allow the (a) 1 only (b) 2 only workers to form trade unions. (c) Both 1 and 2 (d) Neither 1 nor 2 2. N.M. Lokhande was a pioneer in organizing the labour 169. The ‘Swadeshi’ and ‘Boycott’ were adopted as methods of movement in British India. struggle f",
    "year": "2016-I",
    "options": {
      "a": "agitation against the Partition of Bengal",
      "b": "2 only",
      "c": "Both 1 and 2",
      "d": "Neither 1 nor 2"
    },
    "answer": "c",
    "explanation": "Jawaharlal Nehru and Subhash Chandra Bose as"
  },
  {
    "number": 177,
    "text": "He wrote biographies of Mazzini, Garibaldi, Shivaji and (d) visit of the Simon Commission to India Shrikrishna; stayed in America for some time; and was also 170. Who among the following was/were associated with the elected to the Central Assembly. He was",
    "year": "2018-I",
    "options": {
      "a": "Aurobindo Ghosh",
      "b": "Bipin Chandra Pal British rule?",
      "c": "Lala Lajpat Rai",
      "d": "Motilal Nehru"
    },
    "answer": "c",
    "explanation": "Lala Lajpat Rai founded the Indian Home Rule League was the \"First Muslim\" to become the \"President of Indian in the US in 1916 (TN History Class 12 book, page 150). National Congress\". So, he's the closest match. ICSE History textbook class 10"
  },
  {
    "number": 2,
    "text": "It became illegal for a Santhal to transfer land to a non- Persons: Position head Santhal. 1. Sir Tej Bahadur Sapru : President, All India Liberal Select the correct answer using the code given below: Federation (a) 1 only (b) 2 only 2. K.C. Neogy : Member, The Constituent Assembly (c) Both 1 and 2 (d) Neither 1 nor 2 3. P.C. Joshi : General Secretary, Communist Party of India 179. Which one of th",
    "year": "2018-I",
    "options": {
      "a": "1 only",
      "b": "1 and 2 only",
      "c": "3 only",
      "d": "1, 2 and 3 women in the National Movement"
    },
    "answer": "c",
    "explanation": "Communist Vanguard was an emigre Communist"
  },
  {
    "number": 184,
    "text": "With reference to the history of India, “Ulgulan” or the (b) Active involvement of Dalit and Tribal communities of Great Tumult is the description of which of the following India in the National Movement events?",
    "year": "2020-I",
    "options": {
      "a": "The Revolt of 1857",
      "b": "The Mappila rebellion of 1921 and commercial crops",
      "c": "Joining of peasant unrest to India's National Movement",
      "d": "Drastic decrease in the cultivation of plantation crops"
    },
    "answer": "d",
    "explanation": "1890s: under the leadership of Birsa Munda, the demands of withdrawal of ordinances Mundass of the Chota Nagpur Plateau rebelled against • Enquiry into the police excess was not part of the the British. It was called Ulgulan. Gandhi- Irwin Pact. 5337_DBE"
  },
  {
    "number": 180,
    "text": "In 1920, which of the following changed its name to (c) The Indigo revolt of 1859 – 60 \"Swarajya Sabha\"?",
    "year": "2018-I",
    "options": {
      "a": "All India Home Rule League",
      "d": "Birsa Munda’s revolt of 1899-1900"
    },
    "answer": "a",
    "explanation": "Upon repeated instance from home rule leaguers, 142 Gandhi did accept the presidentship of the Home Rule • Madras Mahajansabha (1884) was setup by League only in 1920 and changed its name to \"Swarajya M.Viraghavachari , B.SubramaniyaAiyer and P. Ananda Sabha\". While we are at it, let's also gain knowledge Charlu. So pair #2 is wrong, this eliminates \"C\" and \"D\". about the wrong statements, lest it's asked in future exam! • India Association (1876): Surendranath Banerjee and • South India Liberal"
  },
  {
    "number": 2,
    "text": "It inspired the performance of swadeshi street plays 1. It contributed to the revival of the indigenous artisan crafts and industries. and folk songs. 2. The National Council of Education was established as 3. The use of ‘desh’ by Deuskar was in the specific a part of Swadeshi Movement. context of the region of Bengal. Which of the statements given above is/are correct? Which of the statements giv",
    "year": "2019-I",
    "options": {
      "a": "1 and 2 only",
      "b": "1 and 3 only Select the correct answer using the code given below",
      "c": "2 and 3 only",
      "d": "1, 2 and 3"
    },
    "answer": "c",
    "explanation": "Communist Vanguard was an emigre Communist"
  }
]